{"id":"17594.0","boxrecId":"580952","boxrecUrl":"https://boxrec.com/en/box-pro/580952","boxrecWikiUrl":null,"slug":"olanrewaju-durodola","name":"Olanrewaju Durodola","birthName":null,"nicknames":null,"avatarImage":"https://boxrec.com/images/thumb/a/a7/580952.jpeg/200px-580952.jpeg","residence":null,"birthPlace":null,"dateOfBirth":null,"gender":"M","nationality":null,"height":null,"reach":null,"stance":null,"bio":"<p>The boxing world has witnessed many fierce and talented fighters over the years, but one name that stands out in the light heavyweight division is Olanrewaju Durodola. Born on October 16, 1980, Durodola is a Nigerian professional boxer who has made a significant impact on the sport. Standing tall at 189cm with a reach of 77½\" or 197cm, Durodola possesses the physical attributes that make him a formidable opponent in the ring.</p>\n\n<p>Nicknamed \"[]\", Durodola has displayed his exceptional skills and determination throughout his career. As an orthodox fighter, he is known for his powerful punches and his ability to control the distance between him and his opponents. His weight of 90.72kg places him in the light heavyweight weight class, where he has proved himself to be a dominant force.</p>\n\n<p>Throughout his boxing journey, Durodola has faced numerous tough competitors and has come out on top with his impressive record. His years of experience and dedication to the sport have shaped him into the fighter he is today. But what makes Durodola truly exceptional is not just his physical prowess, but also his mental fortitude and unwavering determination.</p>\n\n<p>When Durodola steps into the ring, he brings a burst of energy and intensity that captivates the audience. His boxing style is dynamic and unpredictable, keeping his opponents on their toes. One moment he may unleash a lightning-fast combination, and in the next, he could deliver a devastating knockout blow. His ability to adapt to different situations and capitalize on his opponents' weaknesses is what sets him apart from the rest.</p>\n\n<p>But Durodola's journey to success has not been without its challenges. Like any athlete, he has faced setbacks and defeats that have tested his resilience. However, it is through these trials that he has grown and evolved as a boxer. Durodola uses his past failures as stepping stones to propel himself forward, learning from his mistakes and emerging stronger every time.</p>\n\n<p>As a top-ranked boxer, Durodola has achieved remarkable milestones in his career. From winning regional titles to competing in high-profile bouts, he has left an indelible mark in the boxing world. His performances inside the ring have earned him respect and admiration from fans and fellow fighters alike.</p>\n\n<p>But what truly sets Durodola apart is not just his accomplishments as a boxer, but his character outside of the ring. He is known for his humility and sportsmanship, always showing respect to his opponents and appreciating the opportunities he has been given. Durodola serves as an inspiration to young athletes, reminding them that hard work, perseverance, and respect are essential ingredients for success.</p>\n\n<p>As Durodola continues his boxing journey, fans eagerly anticipate his upcoming fights and eagerly watch as he continues to make his mark on the sport. With his unwavering determination, talent, and dedication, there is no doubt that he will continue to shine in the light heavyweight division.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"","proDivision":"","proWins":50,"proWinsByKnockout":44,"proLosses":10,"proLossesByKnockout":8,"proDraws":0,"proStatus":"","proTotalBouts":60,"proTotalRounds":null,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":null,"createdAt":"2025-08-08T14:32:03.626529","updatedAt":"2025-08-08T14:32:03.626531","bouts":null}