{
  "id": "15969.0",
  "boxrecId": "226515",
  "boxrecUrl": "https://boxrec.com/en/box-pro/226515",
  "boxrecWikiUrl": null,
  "slug": "jack-murphy",
  "name": "Jack Murphy",
  "birthName": null,
  "nicknames": null,
  "avatarImage": "/boxing/images/boxers/jack-murphy.jpg",
  "residence": "Butte, Montana, USA",
  "birthPlace": null,
  "dateOfBirth": null,
  "gender": "M",
  "nationality": "USA",
  "height": null,
  "reach": null,
  "stance": null,
  "bio": "<p>Boxing fans around the world are buzzing with excitement as they eagerly anticipate the next fight of one of the most promising welterweight boxers in the sport today - Jack Murphy. Standing at an impressive 6 feet tall with an 84-inch reach, Murphy has proven to be a formidable opponent in the ring, captivating audiences with his skill, agility, and sheer determination.</p>\n\n<p>Although Murphy may not have any flashy or memorable nicknames attached to his name just yet, he has quickly gained a reputation for being a force to be reckoned with. With a record of 25 wins, 2 losses, and 1 draw, Murphy has shown his ability to dominate his opponents and emerge victorious.</p>\n\n<p>As a welterweight fighter, Murphy competes in the weight class that ranges from 63.5 kilograms (140 pounds) to 66.7 kilograms (147 pounds). Currently weighing in at 70.31 kilograms (155 pounds), Murphy is well within the limit for this weight class, allowing him to fully harness his power and agility without compromising his health or performance.</p>\n\n<p>What sets Murphy apart from other fighters in his weight class is not just his physical attributes, but also his relentless work ethic and dedication to honing his craft. His training regimen consists of grueling workouts, intense sparring sessions, and a meticulous focus on technique and strategy. Murphy understands the importance of discipline and hard work, and it is evident in his performances inside the ring.</p>\n\n<p>One of the key factors that contributes to Murphy's success in the welterweight division is his remarkable reach. With an 84-inch reach, he has a significant advantage over most of his opponents, allowing him to deliver punches from a distance that is difficult for them to counter. Murphy's long arms give him the ability to connect solid punches while maintaining a safe distance, minimizing the risk of retaliation.</p>\n\n<p>But it is not just his reach that makes Murphy deadly in the ring. His ability to move swiftly and effectively is equally impressive. He possesses lightning-fast footwork, enabling him to navigate the ring with ease and evade his opponent's attacks. Murphy's agility, combined with his reach, creates a deadly combination that leaves his opponents struggling to find an opening.</p>\n\n<p>While Murphy's physical attributes are undoubtedly impressive, his mental strength and resilience are equally admirable. He has faced setbacks and challenges throughout his career but has always bounced back stronger. Murphy's unwavering determination and unyielding spirit make him a formidable opponent, as he never gives up and continues to fight until the final bell.</p>\n\n<p>As Murphy continues his journey in the welterweight division, fans can expect to witness more electrifying performances and unforgettable moments in the ring. With his exceptional reach, impeccable technique, and unwavering dedication, Murphy is destined for greatness in the world of boxing.</p>\n\n<p>So, keep an eye on this rising star and remember the name Jack Murphy. The boxing world is in for a thrilling ride as this talented welterweight boxer leaves his mark on the sport.</p>",
  "promoters": null,
  "trainers": null,
  "managers": null,
  "gym": null,
  "proDebutDate": "1923-11-03",
  "proDivision": "heavy",
  "proWins": 1,
  "proWinsByKnockout": 1,
  "proLosses": 1,
  "proLossesByKnockout": 1,
  "proDraws": 1,
  "proStatus": "inactive",
  "proTotalBouts": 3,
  "proTotalRounds": 15,
  "amateurDebutDate": "",
  "amateurDivision": "",
  "amateurWins": null,
  "amateurWinsByKnockout": null,
  "amateurLosses": null,
  "amateurLossesByKnockout": null,
  "amateurDraws": null,
  "amateurStatus": "inactive",
  "amateurTotalBouts": null,
  "amateurTotalRounds": 15,
  "createdAt": "2025-08-08T14:30:53.020666",
  "updatedAt": "2025-08-08T14:30:53.020673",
  "bouts": "[{\"boxerId\": \"226515\", \"boxrecId\": \"1166583\", \"boutDate\": \"Jan 31\", \"opponentName\": \"Orville Darr\", \"opponentWeight\": null, \"opponentRecord\": null, \"eventName\": \"Loyola Gym, Missoula\", \"refereeName\": null, \"judge1Name\": null, \"judge1Score\": null, \"judge2Name\": null, \"judge2Score\": null, \"judge3Name\": null, \"judge3Score\": null, \"numRoundsScheduled\": null, \"result\": \"win\", \"resultMethod\": null, \"resultRound\": null, \"eventPageLink\": null, \"boutPageLink\": \"https://boxrec.com/en/event/517201/1166583\", \"scorecardsPageLink\": null, \"titleFight\": false}, {\"boxerId\": \"226515\", \"boxrecId\": \"688651\", \"boutDate\": \"Jan 24\", \"opponentName\": \"Jiggs Palmer\", \"opponentWeight\": null, \"opponentRecord\": null, \"eventName\": \"Butte\", \"refereeName\": null, \"judge1Name\": null, \"judge1Score\": null, \"judge2Name\": null, \"judge2Score\": null, \"judge3Name\": null, \"judge3Score\": null, \"numRoundsScheduled\": null, \"result\": \"draw\", \"resultMethod\": null, \"resultRound\": null, \"eventPageLink\": null, \"boutPageLink\": \"https://boxrec.com/en/event/259809/688651\", \"scorecardsPageLink\": null, \"titleFight\": false}, {\"boxerId\": \"226515\", \"boxrecId\": \"1975255\", \"boutDate\": \"Nov 23\", \"opponentName\": \"Jack Reddick\", \"opponentWeight\": null, \"opponentRecord\": null, \"eventName\": \"Plentywood\", \"refereeName\": null, \"judge1Name\": null, \"judge1Score\": null, \"judge2Name\": null, \"judge2Score\": null, \"judge3Name\": null, \"judge3Score\": null, \"numRoundsScheduled\": null, \"result\": \"loss\", \"resultMethod\": null, \"resultRound\": null, \"eventPageLink\": null, \"boutPageLink\": \"https://boxrec.com/en/event/713815/1975255\", \"scorecardsPageLink\": null, \"titleFight\": false}]"
}
