{"id":"17384.0","boxrecId":"535736","boxrecUrl":"https://boxrec.com/en/box-pro/535736","boxrecWikiUrl":null,"slug":"joe-louis","name":"Joe Louis","birthName":null,"nicknames":null,"avatarImage":"/boxing/images/boxers/joe-louis.jpg","residence":"Chicago, Illinois, USA","birthPlace":null,"dateOfBirth":null,"gender":"M","nationality":"USA","height":null,"reach":null,"stance":null,"bio":"<p>Joe Louis, also known as the \"Brown Bomber,\" was born on May 13, 1914. He was a legendary boxer who competed in the heavyweight division and left an indelible mark on the sport. Standing at an impressive height of 187cm and with a reach of 75.98 inches (193 cm), Louis possessed the physical attributes that made him a formidable opponent in the ring.</p>\n\n<p>One cannot talk about Joe Louis without mentioning his nickname, the \"Brown Bomber.\" This moniker was a testament to his explosive punching power and his ability to knock out his opponents with devastating blows. Louis was known for his unparalleled punching accuracy and his knack for delivering knockouts that thrilled and captivated audiences worldwide.</p>\n\n<p>Throughout his career, Louis faced and defeated numerous top-level opponents, solidifying his place as one of the greatest boxers of all time. His fights were always eagerly anticipated, and spectators knew they were in for a show whenever Louis stepped into the ring. His sheer athleticism, coupled with his technique and precision, allowed him to dominate his opponents, leaving a lasting impression on the boxing world.</p>\n\n<p>But Joe Louis was more than just a fearsome fighter with a devastating punch. He was also a symbol of resilience and strength in a time of racial segregation and discrimination. As an African American athlete in the 1930s and 1940s, Louis faced many challenges outside the ring. However, his success inside the squared circle helped break down barriers and pave the way for future generations of black athletes.</p>\n\n<p>Louis's rise to prominence began with his victory over James J. Braddock in 1937 to become the heavyweight champion of the world. From that moment on, he became the face of boxing, captivating fans with his explosive style and unwavering determination. His reign as champion lasted for an incredible 12 years and 11 months, making him the longest-reigning heavyweight champion in history.</p>\n\n<p>During his reign, Louis successfully defended his title 25 times, a record that remained unbroken for decades. One cannot help but marvel at his ability to consistently perform at such a high level. Louis's fights were must-see events, and fans eagerly awaited the opportunity to witness his extraordinary skills in action.</p>\n\n<p>Joe Louis's impact on the sports world extended far beyond his boxing prowess. He was a cultural icon who transcended the sport, becoming a symbol of hope and inspiration for people all over the world. Louis's humility and grace outside the ring endeared him to fans, who admired his sportsmanship and character.</p>\n\n<p>Over his career, Louis faced off against some of the most formidable opponents in boxing history. His matches against Max Schmeling, Rocky Marciano, and Jersey Joe Walcott are legendary and brought out the best in Louis. These fights showcased his ability to adapt to different styles and showed his versatility as a boxer.</p>\n\n<p>Perhaps the most famous of these matchups was his rematch against Max Schmeling in 1938. Schmeling had defeated Louis in their previous encounter, and the rematch was highly anticipated. Louis entered the fight with a burning determination to avenge his defeat, and he did just that by knocking out Schmeling in the first round. The victory symbolized more than just a win for Louis; it was a triumph over racial prejudice.</p>\n\n<p>Despite his incredible achievements, Joe Louis's personal life was not without struggles. Like many athletes, he faced challenges in managing his finances and maintaining a successful post-boxing career. However, Louis's legacy as a pioneer in the sport and an inspiration to generations of boxers cannot be overshadowed.</p>\n\n<p>To this day, Joe Louis's impact is felt in the boxing world. His style and accomplishments continue to inspire young fighters, and his name will forever be associated with greatness in the sport. Joe Louis's legacy transcends time, and his contributions to boxing and society as a whole will never be forgotten.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1992-06-19","proDivision":"welter","proWins":0,"proWinsByKnockout":0,"proLosses":1,"proLossesByKnockout":0,"proDraws":0,"proStatus":"inactive","proTotalBouts":1,"proTotalRounds":4,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":4,"createdAt":"2025-08-08T14:31:55.291567","updatedAt":"2025-08-08T14:31:55.291578","bouts":"[{\"boxerId\": \"535736\", \"boxrecId\": \"1512380\", \"boutDate\": \"Jun 92\", \"opponentName\": \"Robert Bourgeois\", \"opponentWeight\": null, \"opponentRecord\": null, \"eventName\": \"Centennial Hall, London\", \"refereeName\": null, \"judge1Name\": null, \"judge1Score\": null, \"judge2Name\": null, \"judge2Score\": null, \"judge3Name\": null, \"judge3Score\": null, \"numRoundsScheduled\": null, \"result\": \"loss\", \"resultMethod\": null, \"resultRound\": null, \"eventPageLink\": null, \"boutPageLink\": \"https://boxrec.com/en/event/21491/1512380\", \"scorecardsPageLink\": null, \"titleFight\": false}]"}