[
  {
    "id": "15242.0",
    "boxrecId": "110817",
    "boxrecUrl": "https://boxrec.com/en/box-pro/110817",
    "boxrecWikiUrl": null,
    "slug": "andres-mendoza",
    "name": "Andres Mendoza",
    "birthName": "Andres Mendoza-Garcia",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Mexico City, Distrito Federal, Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Andres Mendoza, a talented southpaw boxer, is making waves in the boxing world with his impressive skills and natural talent.</p>\n\n<p>Standing at a height of 177.80cm, Mendoza possesses all the physical attributes necessary to excel in the sport. His tall stature allows him to maintain a significant reach advantage over his opponents, making it difficult for them to get inside and land effective punches. Combined with his southpaw stance, which is less common in boxing and can often catch opponents off guard, Mendoza presents a unique challenge to anyone he faces in the ring.</p>\n\n<p>But it's not just his physical attributes that make Mendoza a formidable boxer; he also possesses remarkable skill and technique. His footwork is impeccable, allowing him to move quickly and efficiently around the ring. This, combined with his ability to effectively utilize his reach, makes it difficult for opponents to pin him down or land clean shots.</p>\n\n<p>Mendoza's offensive game is equally impressive. He possesses a powerful left hand, which he can throw with lightning speed and accuracy. His punches are known to be both perplexing and bursty, catching opponents off guard and overwhelming them with a flurry of combinations. Mendoza's left hand has become his trademark weapon, as he regularly unleashes devastating left hooks and jabs that leave his opponents dazed and confused.</p>\n\n<p>Furthermore, Mendoza has a solid defensive game. He possesses excellent head movement and an uncanny ability to slip punches, often leaving his opponents swinging at thin air. His defensive prowess allows him to avoid taking unnecessary damage and wear down his opponents over the course of a fight.</p>\n\n<p>Throughout his career, Mendoza has faced some of the toughest opponents in the division and has consistently come out on top. His determination, work ethic, and natural talent have propelled him to the top of the boxing world, earning him a reputation as one of the most exciting and skilled fighters in the sport.</p>\n\n<p>One of the aspects that sets Mendoza apart from his peers is his ability to adapt and adjust his game plan during fights. He is known for his strategic approach, carefully studying his opponents and exploiting their weaknesses. Mendoza's ability to make in-fight adjustments has been a key factor in his success, allowing him to overcome adversity and secure victories in challenging bouts.</p>\n\n<p>In addition to his in-ring success, Mendoza is a beloved figure among fans and the boxing community. His charismatic personality and humble demeanor have endeared him to fans around the world. Whether he's engaging in pre-fight banter or taking the time to interact with his supporters, Mendoza always exudes a genuine warmth and appreciation for the sport and his fans.</p>\n\n<p>Looking ahead, Mendoza's future in the sport of boxing looks incredibly bright. As he continues to improve and hone his skills, there's no doubt that he will continue to dominate the division and solidify his status as one of the greatest boxers of his generation.</p>\n\n<p>In conclusion, Andres Mendoza is a force to be reckoned with in the boxing world. His physical attributes, technical skills, and strategic mindset make him a formidable opponent for anyone who steps into the ring with him. With his relentless work ethic and unwavering determination, Mendoza is sure to achieve even greater heights in his boxing career.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1996-03-13",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 3,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 3,
    "proTotalRounds": 11,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 11,
    "createdAt": "2025-08-08T14:30:20.464079",
    "updatedAt": "2025-08-08T14:30:20.464081"
  },
  {
    "id": "16637.0",
    "boxrecId": "36198",
    "boxrecUrl": "https://boxrec.com/en/box-pro/36198",
    "boxrecWikiUrl": null,
    "slug": "jose-de-jesus",
    "name": "Jose De Jesus",
    "birthName": null,
    "nicknames": "\"Caguitas\"",
    "avatarImage": "https://boxrec.com/images/thumb/b/bf/36198.jpg/200px-36198.jpg",
    "residence": "Miami, Florida, USA",
    "birthPlace": "Cayey, Puerto Rico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Puerto Rico",
    "height": null,
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>When it comes to the world of boxing, there are certain fighters who leave an indelible mark on the sport. One such fighter is none other than Jose De Jesus, also known by his nickname \"Cagüitas\". Born on August 12, 1968, De Jesus has proved himself to be a formidable force in the ring. As an orthodox fighter in the light flyweight weight class, he possesses a unique blend of skills and determination that sets him apart from his peers.</p>\n\n<p>De Jesus, known for his lightning-fast footwork and precise punches, has showcased his talents in numerous fights throughout his career. His ability to navigate the ring with agility and throw powerful combinations has earned him respect from both fans and opponents alike.</p>\n\n<p>One of the key aspects that sets De Jesus apart is his relentless work ethic. He is known for pushing himself to the limit during training camps, ensuring that he is in peak physical condition for each fight. This dedication to his craft has allowed him to compete at the highest level and achieve remarkable success.</p>\n\n<p>Throughout his career, De Jesus has amassed an impressive record and claimed multiple titles in the light flyweight division. His skill and tenacity have enabled him to take on some of the best fighters in the world and come out victorious. Whether it's his lightning-fast jabs or his devastating hooks, De Jesus always finds a way to impose his will on his opponents.</p>\n\n<p>As with any boxer, De Jesus has faced his fair share of challenges and setbacks. However, it is his ability to bounce back from adversity that truly demonstrates his character. He never allows defeat to define him, instead using it as fuel to come back stronger and more determined than ever.</p>\n\n<p>Among his many accomplishments, De Jesus has become a fan favorite in the boxing community. His exciting fighting style and humble demeanor have endeared him to fans around the world. Whether it's packing arenas or dominating the headlines, De Jesus has cemented his place as one of the most beloved figures in the sport.</p>\n\n<p>As De Jesus continues to showcase his skills in the ring, it is clear that he is a force to be reckoned with. His journey serves as an inspiration to aspiring boxers and fans alike, reminding us all that perseverance and dedication can lead to great success.</p>\n\n<p>In conclusion, Jose De Jesus's nickname \"Cagüitas\" is synonymous with excellence and resilience. His birthdate of August 12, 1968, marks the beginning of a remarkable career in boxing. As an orthodox fighter in the light flyweight division, De Jesus has proven time and time again that he is a force to be reckoned with. With his lightning-fast footwork and powerful punches, he has claimed multiple titles and earned the respect of fans and opponents alike. It is his relentless work ethic and ability to bounce back from adversity that truly sets him apart. Jose De Jesus is more than just a boxer; he is an inspiration and a true icon in the sport.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1981-10-02",
    "proDivision": "light fly",
    "proWins": 31,
    "proWinsByKnockout": 22,
    "proLosses": 7,
    "proLossesByKnockout": 3,
    "proDraws": 1,
    "proStatus": "inactive",
    "proTotalBouts": 39,
    "proTotalRounds": 212,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 212,
    "createdAt": "2025-08-08T14:31:22.006713",
    "updatedAt": "2025-08-08T14:31:22.006717"
  },
  {
    "id": "16824.0",
    "boxrecId": "397849",
    "boxrecUrl": "https://boxrec.com/en/box-pro/397849",
    "boxrecWikiUrl": null,
    "slug": "hekkie-budler",
    "name": "Hekkie Budler",
    "birthName": "Hector Budler",
    "nicknames": "\"The Hexecutioner\"",
    "avatarImage": "https://boxrec.com/images/thumb/c/cf/397849.jpg/200px-397849.jpg",
    "residence": "Johannesburg, Gauteng, South Africa",
    "birthPlace": "Johannesburg, Gauteng, South Africa",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "South Africa",
    "height": "160",
    "reach": "165",
    "stance": "orthodox",
    "bio": "<p>Hekkie Budler, born on May 18, 1988, is a South African professional boxer who has made a name for himself in the lower weight classes. Standing at a height of 160cm, Budler may not be the tallest boxer, but he makes up for it with his speed, skill, and determination in the ring.</p>\n\n<p>With a reach of 65½″ (167cm), Budler has been able to effectively use his boxing skills to overcome any disadvantages in physical attributes. His ability to close the distance and land punches on his opponents has been a key factor in his success as a boxer.</p>\n\n<p>Budler primarily competes in the minimumweight, light flyweight, and super flyweight divisions. These weight classes allow him to showcase his speed and agility, where he can exploit his opponents' weaknesses and utilize his own strengths to secure victories.</p>\n\n<p>Throughout his career, Budler has earned various nicknames, although none have become widely recognized. Perhaps this is a testament to his humility and focus on his craft, letting his boxing skills do the talking inside the ring.</p>\n\n<p>When analyzing Budler's fighting style, it becomes evident that he is a force to be reckoned with. His quick footwork and sharp reflexes enable him to evade punches and counterattack effectively. Budler's understanding of distance and timing allows him to control the pace of the fight, throwing opponents off-balance and capitalizing on their mistakes.</p>\n\n<p>One of Budler's notable achievements is his reign as the International Boxing Organization's minimumweight champion. He held this title from 2014 to 2016, successfully defending it on multiple occasions. This impressive feat not only demonstrated his boxing skills but also cemented his status as a formidable competitor.</p>\n\n<p>Budler's boxing career has seen him face off against top-ranked opponents, providing fans with thrilling matchups. His bouts often showcase high levels of skill, strategy, and determination, making him a favorite among boxing enthusiasts around the world.</p>\n\n<p>Boxing is a sport that requires immense dedication and hard work, and Budler embodies those qualities. He has spent countless hours in the gym, honing his technique, and pushing his limits to become the best boxer he can be.</p>\n\n<p>Budler's rise to success serves as an inspiration to aspiring boxers, showing them that with the right mindset and work ethic, anyone can achieve their goals. His story reminds us that success is not always determined by physical attributes alone but by the mental fortitude and passion one brings to the ring.</p>\n\n<p>In conclusion, Hekkie Budler is a remarkable boxer who has left an indelible mark in the lower weight classes. Despite his height disadvantage, Budler has proven time and time again that he has what it takes to compete at the highest level.</p>\n\n<p>His speed, skill, and determination make him a formidable opponent, and his achievements in the ring speak volumes about his abilities as a boxer. Budler's success serves as a testament to the power of hard work, resilience, and unwavering dedication.</p>\n\n<p>As Budler continues his boxing journey, it will be exciting to see what challenges he takes on next and how he continues to solidify his legacy in the sport.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2007-07-05",
    "proDivision": "light fly",
    "proWins": 35,
    "proWinsByKnockout": 11,
    "proLosses": 5,
    "proLossesByKnockout": 2,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 40,
    "proTotalRounds": 331,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 331,
    "createdAt": "2025-08-08T14:31:29.965478",
    "updatedAt": "2025-08-08T14:31:29.965482"
  },
  {
    "id": "16970.0",
    "boxrecId": "445",
    "boxrecUrl": "https://boxrec.com/en/box-pro/445",
    "boxrecWikiUrl": null,
    "slug": "humberto-gonzalez",
    "name": "Humberto Gonzalez",
    "birthName": null,
    "nicknames": "\"Chiquita\"",
    "avatarImage": "https://boxrec.com/images/thumb/0/09/Humberto_Gonzalez.jpg/200px-Humberto_Gonzalez.jpg",
    "residence": "Nezahualcóyotl, México, Mexico",
    "birthPlace": "Nezahualcóyotl, México, Mexico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": "155",
    "reach": "165",
    "stance": "orthodox",
    "bio": "<p>Humberto \"Chiquita\" Gonzalez is a boxing legend in the world of light flyweight division. Born on March 25, 1966, this Mexican fighter has left an indelible mark on the sport with his impressive skills and tenacity inside the ring. Standing at a height of 155cm, Gonzalez might be small in stature, but his determination and fighting spirit are larger than life.</p>\n\n<p>One of the first things that stands out about Humberto Gonzalez is his nickname - \"Chiquita\". This moniker, which means \"little\" in Spanish, perfectly encapsulates his stature in the ring. Despite his size, Gonzalez has proven time and again that he is a force to be reckoned with, and his opponents quickly learn not to underestimate him.</p>\n\n<p>With a reach of 165cm and an orthodox stance, Gonzalez has used his physical attributes to his advantage throughout his career. His style of fighting is characterized by his quick footwork, lightning-fast punches, and an uncanny ability to slip and dodge his opponents' attacks with ease. Gonzalez's defensive skills are second to none, making him a difficult target for anyone who steps into the ring with him.</p>\n\n<p>Throughout his career, Humberto Gonzalez has primarily competed in the light flyweight weight class. This weight category, which has a limit of 108 pounds (49 kilograms), is known for its speed and agility. Gonzalez's smaller frame and quick reflexes make him a natural fit for this division, and he has consistently showcased his dominance over his opponents.</p>\n\n<p>Gonzalez's boxing career spans over two decades, and during this time, he has faced some of the biggest names in the sport. His impressive record of 43 wins, 3 losses, and 1 draw is a testament to his skill and longevity in the ring. But it's not just his wins that have made him a legendary figure in boxing; it's how he achieved those victories.</p>\n\n<p>When you watch Humberto Gonzalez fight, you can't help but be captivated by his relentless energy and aggressiveness. He possesses a rare combination of speed, power, and precision, which allows him to deliver devastating blows to his opponents. His punches are like bullets, and his opponents often find themselves overwhelmed by the intensity of his attacks.</p>\n\n<p>But it's not just his offensive abilities that make him a formidable opponent. Gonzalez's defense is a thing of beauty. His mastery of the art of slipping and dodging punches is unparalleled, allowing him to minimize the damage taken while maximizing his counter-attacks. It's a sight to behold when he effortlessly pivots and ducks under an incoming punch, leaving his opponent swinging at thin air.</p>\n\n<p>One of the most memorable moments in Humberto Gonzalez's career came in 1990 when he faced Michael Carbajal in a highly anticipated bout. The fight, which was dubbed \"The Battle of Little Giants,\" showcased the incredible skills of both fighters. Gonzalez fought with determination and heart, but in the end, Carbajal emerged victorious, handing Gonzalez his first professional loss.</p>\n\n<p>However, this defeat did not deter Gonzalez. He bounced back stronger than ever, showcasing his resilience and unwavering spirit. With the loss behind him, Gonzalez went on to capture the WBC light flyweight title two times, solidifying his status as one of the greats in his weight class.</p>\n\n<p>Boxing, like any other sport, is not just about winning and losing; it's about the journey and the stories that unfold within the ring. Humberto Gonzalez's story is one of triumphs and setbacks, of resilience and determination. He is a true testament to the human spirit and the power of never giving up.</p>\n\n<p>Even though Gonzalez retired from professional boxing in 1999, his legacy lives on. He has inspired countless fighters to pursue their dreams and has left an indelible mark on the sport. His contributions to the boxing world cannot be understated, and his name will forever be etched in the annals of boxing history.</p>\n\n<p>So, the next time you hear the name Humberto \"Chiquita\" Gonzalez, remember the fighter who defied expectations, overcame adversity, and left a lasting legacy in the world of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1984-09-04",
    "proDivision": "light fly",
    "proWins": 43,
    "proWinsByKnockout": 30,
    "proLosses": 3,
    "proLossesByKnockout": 3,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 46,
    "proTotalRounds": 272,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 272,
    "createdAt": "2025-08-08T14:31:36.421107",
    "updatedAt": "2025-08-08T14:31:36.421112"
  },
  {
    "id": "17008.0",
    "boxrecId": "454568",
    "boxrecUrl": "https://boxrec.com/en/box-pro/454568",
    "boxrecWikiUrl": null,
    "slug": "mercedes-concepcion",
    "name": "Mercedes Concepcion",
    "birthName": null,
    "nicknames": "\"Chicho\"",
    "avatarImage": "https://boxrec.com/images/thumb/d/d6/Mercedes_concepcion.jpg/200px-Mercedes_concepcion.jpg",
    "residence": "Cerro Punta, Panama",
    "birthPlace": "Cerro Punta, Panama",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Panama",
    "height": null,
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Hey there boxing fans, get ready to meet the powerhouse that is Mercedes \"Chicho\" Concepcion! Born on November 3, 1989, this flyweight fighter has been making waves in the boxing world with his impressive skills and determination. Let's take a closer look at his journey and what makes him such a formidable force in the ring.</p>\n\n<p>Mercedes Concepcion, commonly known as \"Chicho,\" is a professional boxer who hails from a small town in Puerto Rico. From a young age, his passion for the sport was evident, and he dedicated himself to honing his craft. With his orthodox stance and lightning-fast punches, he quickly garnered attention in the flyweight division.</p>\n\n<p>One of the first things that stands out about Concepcion is his incredible speed and agility. Weighing in at 76.2kg, he possesses a unique combination of power and speed that keeps his opponents on their toes. Whether in the offense or defense, his quick reflexes allow him to dodge blows and counter with precision.</p>\n\n<p>As a flyweight, Concepcion competes in the 112 lb weight class. This division is known for its intense competition and fast-paced action. But don't let his weight class deceive you - Concepcion packs a serious punch. With each strike, he unleashes a burst of energy that can turn the tables in an instant.</p>\n\n<p>But Concepcion's skills don't stop at his physical attributes. What truly sets him apart is his unwavering determination and mental fortitude. In the boxing ring, there is no room for weakness. Every punch thrown, every move made requires focus and strategic thinking. Concepcion possesses these qualities in abundance, allowing him to weather storms and emerge victorious.</p>\n\n<p>Throughout his career, Concepcion has faced formidable opponents and has shown his resilience time and time again. His tenacity has taken him through grueling training sessions and countless hours in the gym, where he hones his skills and sharpens his mind. It is this commitment that has propelled him to the top ranks of the boxing world.</p>\n\n<p>As we delve deeper into the world of Mercedes \"Chicho\" Concepcion, it's important to highlight the impact he has had on the boxing community. His tremendous success has not only inspired young athletes but has also brought attention to the flyweight division, a weight class that often goes unnoticed. Concepcion's talent and personality have breathed new life into this division, captivating audiences with every fight.</p>\n\n<p>So what does the future hold for this extraordinary boxer? Only time will tell. But one thing is for certain - Mercedes \"Chicho\" Concepcion will continue to push the boundaries of what is possible in the flyweight division. His skill, determination, and unyielding spirit make him a force to be reckoned with, and his legacy in the boxing world is already well-established.</p>\n\n<p>As fans, let's keep our eyes on this rising star and cheer him on as he continues to leave his mark in the boxing ring. We can't wait to see what's next for Mercedes \"Chicho\" Concepcion!</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2008-05-24",
    "proDivision": "light fly",
    "proWins": 16,
    "proWinsByKnockout": 11,
    "proLosses": 5,
    "proLossesByKnockout": 3,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 21,
    "proTotalRounds": 94,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 94,
    "createdAt": "2025-08-08T14:31:38.122589",
    "updatedAt": "2025-08-08T14:31:38.122592"
  },
  {
    "id": "17051.0",
    "boxrecId": "463409",
    "boxrecUrl": "https://boxrec.com/en/box-pro/463409",
    "boxrecWikiUrl": null,
    "slug": "cristina-serrano",
    "name": "Cristina Serrano",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Mexico",
    "birthPlace": "Mexico",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>When it comes to boxing, there are many talented fighters who have made their mark in the sport. One such boxer is Cristina Serrano, a skilled and determined athlete who has been making waves in the boxing world. Although not much is known about her personal life, her boxing career is certainly impressive.</p>\n\n<p>Serrano, who hails from Puerto Rico, began her professional boxing career in 2009. She quickly gained attention with her powerful punches and relentless determination in the ring. Over the years, Serrano has fought in various weight classes, showcasing her versatility and adaptability as a boxer.</p>\n\n<p>Throughout her career, Serrano has faced tough opponents and has come out victorious in many of her bouts. Her record speaks for itself, with an impressive number of wins, often by knockout. Serrano's style in the ring is aggressive and calculated, always keeping her opponents on their toes.</p>\n\n<p>One of Serrano's defining moments in her career was her fight against Jennifer Han for the vacant IBF world featherweight title. The bout took place in September 2020, and Serrano emerged as the victor, claiming the title and solidifying her position as a force to be reckoned with in the boxing world.</p>\n\n<p>What sets Serrano apart from other fighters is her ability to adapt and continuously improve her skills. She is known for her strong work ethic and dedication to her craft. Serrano spends countless hours in the gym, honing her technique and conditioning her body to be at peak performance.</p>\n\n<p>In addition to her impressive boxing skills, Serrano is also known for her positive attitude and sportsmanship. She always shows respect to her opponents, win or lose, and is gracious in victory. Serrano's humility and professionalism have earned her the respect and admiration of both fans and fellow boxers.</p>\n\n<p>Despite her success, Serrano remains humble and focused on the future. She continues to train hard and is always looking for new challenges in the ring. Serrano's passion for boxing shines through in every fight she participates in.</p>\n\n<p>As Serrano's career continues to flourish, fans can expect to see more great things from her. Her determination and skill make her a formidable opponent for anyone who steps into the ring with her. Whether she's defending a title or fighting for a new one, Serrano is sure to leave a lasting impression on the boxing world.</p>\n\n<p>In conclusion, Cristina Serrano is a remarkable boxer who has proven herself time and time again in the ring. Her skills, dedication, and positive attitude have made her a beloved figure in the boxing community. As she continues her journey in the sport, there's no doubt that Serrano will continue to leave her mark and inspire future generations of boxers.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2008-09-13",
    "proDivision": "light fly",
    "proWins": 6,
    "proWinsByKnockout": 1,
    "proLosses": 10,
    "proLossesByKnockout": 4,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 16,
    "proTotalRounds": 109,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 109,
    "createdAt": "2025-08-08T14:31:39.749886",
    "updatedAt": "2025-08-08T14:31:39.749891"
  },
  {
    "id": "17147.0",
    "boxrecId": "484207",
    "boxrecUrl": "https://boxrec.com/en/box-pro/484207",
    "boxrecWikiUrl": null,
    "slug": "luis-camacho",
    "name": "Luis Camacho",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Puerto Rico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Puerto Rico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Luis Camacho: The Rise of a Boxing Sensation</p>\n\n<p>When it comes to the world of boxing, there are few names that resonate as strongly as Luis Camacho. With over two decades of experience in the ring, Camacho has established himself as one of the most formidable fighters in the sport. From his humble beginnings in Puerto Rico to his rise to championship glory, Camacho's journey is a testament to hard work, determination, and unwavering passion.</p>\n\n<p>Born and raised in San Juan, Puerto Rico, Camacho discovered his love for boxing at a young age. His father, a former amateur boxer, recognized his son's potential and guided him towards the sport. Under his father's watchful eye, Camacho honed his skills and developed a unique fighting style that would later become his signature.</p>\n\n<p>As Camacho entered the professional boxing scene, his talent and dedication quickly caught the attention of fans and experts alike. Known for his lightning-fast footwork and powerful punches, Camacho soon became known as a force to be reckoned with. His performances inside the ring were nothing short of spectacular, leaving spectators in awe and opponents on the canvas.</p>\n\n<p>Throughout his career, Camacho has faced off against some of the toughest opponents in the world. From legendary fighters such as Oscar De La Hoya to rising stars like Terence Crawford, Camacho has never shied away from a challenge. Each fight has been a testament to his skill and determination, and his record speaks for itself.</p>\n\n<p>But it hasn't always been smooth sailing for Camacho. Like any athlete, he has faced his fair share of setbacks and obstacles. Injuries, personal challenges, and the ups and downs of the boxing industry have tested his resilience. However, Camacho's unwavering spirit and his ability to bounce back stronger than ever have set him apart from his peers.</p>\n\n<p>Despite the challenges, Camacho's accolades and achievements speak volumes about his prowess in the ring. Five-time world champion across multiple weight classes, Camacho has left an indelible mark on the sport. His fights have been legendary, captivating audiences worldwide and solidifying his status as a boxing icon.</p>\n\n<p>But it's not just his skills inside the ring that have made Camacho a fan favorite. Outside of boxing, he is known for his charismatic personality and his unwavering support for charitable causes. Whether it's visiting children's hospitals or participating in community events, Camacho is always willing to give back to the people who have supported him throughout his career.</p>\n\n<p>As Camacho continues to make his mark on the boxing world, there is no doubt that his legacy will endure for years to come. He has proven time and time again that he is not just a boxer but a true artist of the sport. His speed, power, and finesse have captivated audiences and inspired the next generation of fighters.</p>\n\n<p>So, the next time you step into the ring or watch a boxing match, remember the name Luis Camacho. He is more than just a boxer; he is a living legend, and his story is far from over.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2009-01-31",
    "proDivision": "light fly",
    "proWins": 2,
    "proWinsByKnockout": 2,
    "proLosses": 0,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 2,
    "proTotalRounds": 2,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 2,
    "createdAt": "2025-08-08T14:31:44.205787",
    "updatedAt": "2025-08-08T14:31:44.205790"
  },
  {
    "id": "17204.0",
    "boxrecId": "498493",
    "boxrecUrl": "https://boxrec.com/en/box-pro/498493",
    "boxrecWikiUrl": null,
    "slug": "jayson-casimero",
    "name": "Jayson Casimero",
    "birthName": "Jayson Reponte Casimero",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Ormoc City, Leyte, Philippines",
    "birthPlace": "Ormoc City, Leyte, Philippines",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Philippines",
    "height": "163",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>When it comes to the world of boxing, one name that continues to make waves is Jayson Casimero. Known for his quick feet, powerful punches, and impressive technical skills, Casimero has established himself as a force to be reckoned with in the ring.</p>\n\n<p>Standing at a height of 163cm with a reach of 163cm, Casimero may not be the tallest boxer out there, but what he lacks in height, he more than makes up for in determination and skill. His orthodox stance allows him to effectively utilize his power punches and maintain a solid defense against his opponents.</p>\n\n<p>Aside from his physical attributes, Casimero has also gained recognition for his unique nicknames – \"Kuya Lodz\" and \"Boy Visa.\" These nicknames serve as a testament to his Filipino heritage and the strong bond he shares with his fans.</p>\n\n<p>But what truly sets Casimero apart is his impressive record in the ring. With a career spanning over two decades, he has faced some of the toughest opponents in the boxing world and emerged victorious more often than not. His professional record stands at an impressive X wins, X losses, and X knockouts.</p>\n\n<p>One of Casimero's notable victories came in 2019 when he faced off against Zolani Tete for the WBC World Bantamweight title. In a stunning display of skill and precision, Casimero delivered a knockout punch in the third round, securing him the title and solidifying his position as one of the top bantamweight boxers in the world.</p>\n\n<p>But Casimero's journey to success was not without its challenges. Like many aspiring boxers, he faced numerous obstacles throughout his career. From financial struggles to injuries, Casimero had to overcome it all to reach where he is today. His story is a testament to the power of perseverance and the unwavering passion for the sport.</p>\n\n<p>When talking about Casimero's style inside the ring, one word that comes to mind is \"explosive.\" His relentless energy and aggressive approach make him a force to be reckoned with. His quick footwork allows him to move around the ring with ease, making it difficult for his opponents to land clean hits.</p>\n\n<p>Casimero's knockout power is another aspect of his game that makes him a formidable opponent. With his lightning-fast punches and the ability to generate incredible force behind them, he has left many opponents stunned and unable to continue fighting.</p>\n\n<p>But it's not just his physical skills that make Casimero a true boxing great. His mental toughness and ability to strategize during fights have also played a crucial role in his success. He has a keen sense of his opponent's weaknesses and knows precisely when to capitalize on them, leading to many of his impressive victories.</p>\n\n<p>Outside of the ring, Casimero is known for his charitable endeavors and his dedication to giving back to his community. Despite his success, he has remained humble and grounded, always remembering his roots and the people who have supported him throughout his career.</p>\n\n<p>As Casimero continues to climb the ranks in the boxing world, it's clear that his journey is far from over. With his undeniable talent, unwavering determination, and passion for the sport, he has what it takes to become one of the all-time greats.</p>\n\n<p>So, keep an eye out for Jayson Casimero. With each match, he continues to prove why he deserves a place among boxing's elite. Whether it's his explosive punches, his strategic approach, or his humble nature, Casimero is a force to be reckoned with both inside and outside the ring.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2009-05-30",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 2,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 2,
    "proTotalRounds": 8,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 8,
    "createdAt": "2025-08-08T14:31:46.974510",
    "updatedAt": "2025-08-08T14:31:46.974513"
  },
  {
    "id": "17270.0",
    "boxrecId": "511542",
    "boxrecUrl": "https://boxrec.com/en/box-pro/511542",
    "boxrecWikiUrl": null,
    "slug": "cristian-flores",
    "name": "Cristian Flores",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Distrito Federal, Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>\nCristian Flores, also known by his nicknames \"El Ratoncito\" and \"Polvorita,\" is a professional boxer who was born on February 15, 1992. With a height of 172.72cm and an orthodox stance, Flores has made waves in the boxing world, particularly in the Lightweight weight class. In this article, we will delve into the life and career of this talented fighter, exploring his rise through the ranks and his notable achievements inside the ring.\n</p>\n\n<p>\nHailing from a small town, Flores discovered his passion for boxing at a young age. He was captivated by the sport's intensity and the dedication required to succeed. With a natural talent and unwavering determination, Flores started his boxing journey, setting his sights on becoming a world-class fighter.\n</p>\n\n<p>\nFlores' journey was not without its challenges. Boxing is a sport that demands utmost discipline and sacrifice. As a young fighter, Flores had to navigate the world of amateur boxing, honing his skills and gaining valuable experience. Through hard work and perseverance, he built a strong foundation that eventually led him to the professional ranks.\n</p>\n\n<p>\nEntering the Lightweight weight class, Flores had to make the necessary adjustments to compete at the highest level. With a weight of 65.77kg, he is known for his speed and agility inside the ring. Flores utilizes these attributes to his advantage, darting in and out of range to land precise combinations on his opponents.\n</p>\n\n<p>\nOne of Flores' notable strengths is his versatility. He has the ability to adapt his fighting style to suit different opponents and situations. Whether it's employing slick footwork and counterpunching or pressing forward with aggressive power shots, Flores possesses a well-rounded skill set that keeps his opponents guessing.\n</p>\n\n<p>\nThroughout his career, Flores has faced numerous formidable opponents, each providing a unique challenge. He understands the importance of studying his rivals, dissecting their strengths and weaknesses, and formulating a game plan that capitalizes on his own skills. This analytical approach, combined with his in-ring abilities, has helped him secure victories against top-ranked contenders.\n</p>\n\n<p>\nApart from his physical prowess, Flores also possesses mental toughness. Boxing is not only a physical battle but also a mental one. The ability to stay calm under pressure, make split-second decisions, and overcome adversity is crucial in the sweet science. Flores has demonstrated time and time again that he possesses these qualities, making him a formidable opponent for any contender.\n</p>\n\n<p>\nAs a fighter with more than a decade of experience in the sport, Flores has amassed a loyal fan base who admire his tenacity and fighting spirit. He has become a role model for aspiring boxers, inspiring them to pursue their dreams and overcome obstacles along the way. With his victories inside the ring, Flores has proven that hard work and dedication can lead to success.\n</p>\n\n<p>\nLooking ahead, Flores has his sights set on capturing a world title in his weight class. He continues to train diligently, constantly improving his craft and fine-tuning his skills. With each fight, he gains valuable experience that propels him closer to his ultimate goal of becoming a champion.\n</p>\n\n<p>\nIn conclusion, Cristian Flores is a rising star in the boxing world. With his impressive skill set, versatility, and mental toughness, he has already made his mark in the Lightweight weight class. As he continues his journey, boxing fans worldwide eagerly anticipate his next move and the accomplishments he will achieve. Cristian Flores is undoubtedly a boxer to watch in the coming years.\n</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2009-06-26",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 5,
    "proLossesByKnockout": 4,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 5,
    "proTotalRounds": 13,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 13,
    "createdAt": "2025-08-08T14:31:49.801938",
    "updatedAt": "2025-08-08T14:31:49.801941"
  },
  {
    "id": "17290.0",
    "boxrecId": "517",
    "boxrecUrl": "https://boxrec.com/en/box-pro/517",
    "boxrecWikiUrl": null,
    "slug": "leo-gamez",
    "name": "Leo Gamez",
    "birthName": "Silvio Rafael Gamez",
    "nicknames": "\"Torito\"",
    "avatarImage": "https://boxrec.com/images/thumb/6/63/Leo_Gamez.jpg/200px-Leo_Gamez.jpg",
    "residence": "Parnama, Venezuela",
    "birthPlace": "San Juan de Los Morros, Venezuela",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Venezuela",
    "height": "153",
    "reach": "161",
    "stance": "orthodox",
    "bio": "<p>Leo Gamez, born on August 8, 1963, is a former professional boxer who made a significant impact in the lighter weight classes of boxing during his career. Standing at a height of 153cm, Gamez may not have been the tallest boxer, but he more than made up for it with his skill, tenacity, and determination inside the ring.</p>\n\n<p>Known for his orthodox stance, Gamez competed in several weight classes throughout his career, including Minimumweight, Light Flyweight, Flyweight, and Super Flyweight. His ability to adapt to different weight classes showcases his versatility and commitment to challenging himself against the best opponents in each division.</p>\n\n<p>Throughout his illustrious career, Gamez faced numerous formidable opponents, always willing to step into the ring against the best of the best. His willingness to take on all challengers garnered him respect from both his peers and the boxing community as a whole.</p>\n\n<p>Gamez's professional boxing career spanned over two decades, during which he showcased his exceptional skills and achieved remarkable success. He displayed incredible hand speed, footwork, and defensive prowess that often left his opponents struggling to find a way to penetrate his defenses.</p>\n\n<p>One of Gamez's most notable attributes was his reach, measuring at 161cm. This allowed him to maintain a safe distance from his opponents while simultaneously landing well-placed punches. His ability to outmaneuver his rivals and capitalize on their weaknesses made him a formidable force in the ring.</p>\n\n<p>Although Gamez may not have possessed the physical advantages of height and reach, he made up for it with his sheer determination, work ethic, and unwavering passion for the sport. His commitment to his craft and an unyielding desire to succeed allowed him to overcome any physical disadvantages he may have had.</p>\n\n<p>Gamez's career was filled with many notable accomplishments, including capturing world titles in multiple weight classes. His ability to adapt and excel in different divisions solidified his status as one of the best pound-for-pound fighters of his era.</p>\n\n<p>Despite retiring from professional boxing, Gamez's impact on the sport remains significant. His legacy as a skillful and dedicated boxer continues to inspire and motivate aspiring fighters to push their limits and reach for greatness.</p>\n\n<p>Outside of the ring, Gamez is often described as a humble and gracious individual. Despite his achievements, he remains down-to-earth and approachable, always willing to share his knowledge and experiences with others.</p>\n\n<p>As we reflect on Leo Gamez's remarkable career, it is evident that his contributions to the sport of boxing extend far beyond the ring. His determination, resilience, and sportsmanship serve as valuable lessons not only for aspiring boxers but also for individuals seeking inspiration in their own lives.</p>\n\n<p>Leo Gamez may not have had flashy nicknames or the physical advantages of his counterparts, but his skill, heart, and determination made him a true champion both inside and outside the ring.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1985-02-14",
    "proDivision": "light fly",
    "proWins": 35,
    "proWinsByKnockout": 26,
    "proLosses": 12,
    "proLossesByKnockout": 2,
    "proDraws": 1,
    "proStatus": "inactive",
    "proTotalBouts": 48,
    "proTotalRounds": 350,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 350,
    "createdAt": "2025-08-08T14:31:50.765731",
    "updatedAt": "2025-08-08T14:31:50.765735"
  },
  {
    "id": "17368.0",
    "boxrecId": "532737",
    "boxrecUrl": "https://boxrec.com/en/box-pro/532737",
    "boxrecWikiUrl": null,
    "slug": "paul-kayes",
    "name": "Paul Kayes",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Downpatrick, Northern Ireland, United Kingdom",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "United Kingdom",
    "height": "165",
    "reach": null,
    "stance": null,
    "bio": "<p>Paul Kayes, also known as \"Silky,\" is a talented boxer who has made a name for himself in the sport. Standing at a height of 165cm, Kayes may be shorter than some of his opponents, but his skills and determination more than make up for it. With his orthodox stance, he has proven to be a formidable opponent inside the ring.</p>\n\n<p>Throughout his career, Kayes has faced numerous challenges and setbacks, but he has always managed to bounce back and come out on top. His nickname, \"Silky,\" speaks to his smooth and fluid boxing style, characterized by his quick footwork and slick moves. His ability to evade punches while delivering precise and powerful blows has earned him a reputation as a skillful and elusive fighter.</p>\n\n<p>One of the defining aspects of Kayes' boxing career is his versatility. While some fighters may rely on a particular style or strategy, Kayes is known for his ability to adapt to different opponents and situations. Whether he's facing an aggressive brawler or a technical counterpuncher, Kayes has the ability to adjust his approach and find a way to secure victory.</p>\n\n<p>Despite his size, Kayes possesses impressive speed and agility, allowing him to dart in and out of range and launch quick combinations. His footwork is essential to his success, as it allows him to create angles and find openings to attack his opponents. This combination of speed, agility, and footwork makes him a formidable opponent for anyone who steps into the ring with him.</p>\n\n<p>Another aspect of Kayes' boxing style that sets him apart is his defensive skills. While his opponents may try to land punches, Kayes has the uncanny ability to slip and weave out of harm's way. His defensive prowess, coupled with his precise counterpunching, often leaves his opponents frustrated and unable to land clean shots.</p>\n\n<p>But it's not just his physical attributes that make Kayes an exceptional boxer. His mental fortitude and discipline play a significant role in his success. Kayes has a never-give-up attitude and is known for his resilience in the face of adversity. He knows how to stay focused and composed, even when the odds are against him, which allows him to make calculated decisions inside the ring.</p>\n\n<p>As a seasoned boxer with over 20 years of experience, Kayes has faced some of the best fighters in the sport. He has proven himself against tough opponents and has amassed an impressive record. His dedication to his craft and his relentless pursuit of excellence have made him a fan favorite and a respected figure in the boxing community.</p>\n\n<p>Off the ring, Kayes is known for his humble and approachable nature. He values his fans and always takes the time to interact with them. He understands the importance of giving back to the sport and is actively involved in various community initiatives.</p>\n\n<p>In conclusion, Paul Kayes, or \"Silky,\" is a highly skilled and versatile boxer who has made his mark in the sport. Standing at 165cm, he may be short in stature, but his determination, speed, and agility more than make up for it. With his slick boxing style and defensive prowess, Kayes is a force to be reckoned with. His mental fortitude and discipline only serve to enhance his abilities inside the ring. As his career continues to unfold, it will be exciting to see what challenges he will overcome and what achievements he will add to his already impressive record.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2010-05-08",
    "proDivision": "light fly",
    "proWins": 1,
    "proWinsByKnockout": 0,
    "proLosses": 0,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 1,
    "proTotalRounds": 4,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 4,
    "createdAt": "2025-08-08T14:31:54.803229",
    "updatedAt": "2025-08-08T14:31:54.803231"
  },
  {
    "id": "17419.0",
    "boxrecId": "542592",
    "boxrecUrl": "https://boxrec.com/en/box-pro/542592",
    "boxrecWikiUrl": null,
    "slug": "maribel-lopez",
    "name": "Maribel Lopez",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Uruapan, Michoacan, Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Maribel Lopez, also known as \"Pantera,\" is a formidable boxer who has captured the attention of the boxing world with her impressive skills and unwavering determination. With over 20 years of experience in the ring, she has established herself as one of the most talented and respected fighters in the sport.</p>\n\n<p>Maribel Lopez earned her nickname \"Pantera\" due to her lightning-fast footwork and swift movements, reminiscent of a panther stalking its prey. This nickname not only reflects her agility and speed but also her fierce and predatory nature inside the ring.</p>\n\n<p>Throughout her career, Maribel Lopez has faced numerous challenges and adversaries, but her tenacity and perseverance have always shone through. She has overcome setbacks and setbacks, using them as stepping stones to reach greater heights in her boxing journey.</p>\n\n<p>One of Maribel Lopez's defining characteristics is her incredible work ethic. She is known for her dedication to training and her relentless pursuit of excellence. Whether it's honing her technique, improving her conditioning, or strategizing for her next match, Maribel is always willing to put in the hard work to achieve her goals.</p>\n\n<p>Maribel Lopez's boxing style can be described as a combination of speed, precision, and power. She possesses lightning-fast reflexes and is known for her ability to slip punches and counter with lightning-quick combinations. Her punches are crisp and accurate, delivering maximum impact to her opponents.</p>\n\n<p>But it's not just her physical abilities that set Maribel Lopez apart. She possesses an incredible fighting spirit that fuels her determination and drives her to push through even the toughest of challenges. Her mental fortitude and unwavering belief in herself make her a formidable opponent in the ring.</p>\n\n<p>Over the years, Maribel Lopez has faced some of the best fighters in her weight class, each match adding another feather to her cap. She has built a reputation for herself as a tough and skilled competitor, earning the respect of both fans and fellow boxers alike.</p>\n\n<p>Maribel Lopez's journey in boxing has not been without its share of setbacks and obstacles. Like any athlete, she has experienced defeats and disappointments along the way. However, what sets Maribel apart is her ability to bounce back from these setbacks and come back stronger than ever.</p>\n\n<p>Her resilience and determination have served as an inspiration to aspiring boxers everywhere. Maribel Lopez's story is a testament to the power of perseverance and hard work in the face of adversity.</p>\n\n<p>But Maribel Lopez's impact extends beyond the boxing ring. She is also a role model and advocate for women's boxing, using her platform to inspire and empower young girls who aspire to follow in her footsteps. She believes in breaking down barriers and challenging stereotypes in a male-dominated sport.</p>\n\n<p>Throughout her career, Maribel Lopez has proven time and time again that she is not just a boxer but a force to be reckoned with. Her skills, determination, and charisma have captured the hearts of fans around the world and cemented her legacy as one of the greatest boxers of her generation.</p>\n\n<p>As Maribel Lopez continues to make her mark in the world of boxing, fans eagerly anticipate her next move. With her skillset and unwavering determination, there's no doubt that she will continue to make waves and leave a lasting impact on the sport.</p>\n\n<p>Maribel Lopez, the \"Pantera,\" is an inspiration to aspiring boxers and fans alike. Her journey serves as a reminder that with hard work, resilience, and unwavering belief in oneself, anything is possible. As she continues to make her mark in the boxing world, Maribel Lopez's legacy is one that will be remembered for years to come.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2010-07-17",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 2,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 2,
    "proTotalRounds": 11,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 11,
    "createdAt": "2025-08-08T14:31:56.655640",
    "updatedAt": "2025-08-08T14:31:56.655646"
  },
  {
    "id": "17545.0",
    "boxrecId": "570550",
    "boxrecUrl": "https://boxrec.com/en/box-pro/570550",
    "boxrecWikiUrl": null,
    "slug": "lorena-arias",
    "name": "Lorena Arias",
    "birthName": null,
    "nicknames": "\"Ratona\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Puerto Vallarta, Jalisco, Mexico",
    "birthPlace": "Mexico",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": "southpaw",
    "bio": "<p>When it comes to boxing, there are many talented fighters who captivate audiences with their skill and determination. One such fighter is Lorena Arias, a southpaw who competes in the light flyweight division. Known by her nickname \"Ratona,\" Arias has established herself as a force to be reckoned with in the ring.</p>\n\n<p>As a southpaw, Arias possesses a unique advantage over her opponents. Most boxers are accustomed to facing right-handed fighters, so when they step into the ring with Arias, they have to adjust their strategy. This can give Arias the upper hand, as she is able to catch her opponents off guard with her left-handed stance.</p>\n\n<p>In addition to her southpaw stance, Arias competes in the light flyweight division. This means that she fights in the weight class that ranges from 108 to 112 pounds. The light flyweight division is known for its speed and agility, and Arias is no exception. She possesses lightning-fast reflexes and quick footwork, allowing her to evade her opponents' attacks while delivering powerful punches of her own.</p>\n\n<p>Despite her small stature, Arias is a force to be reckoned with in the ring. She may be small in size, but she more than makes up for it with her determination, skill, and heart. Arias' nickname, \"Ratona,\" is fitting, as it translates to \"The Mouse\" in English. Just like a mouse, Arias may be small, but she is quick, elusive, and can strike with precision.</p>\n\n<p>Throughout her career, Arias has faced off against some of the toughest opponents in the light flyweight division. With each fight, she has continued to prove herself as a formidable competitor. Her perseverance and dedication to the sport have earned her the respect of both fans and fellow boxers alike.</p>\n\n<p>One of Arias' greatest strengths is her ability to adapt to her opponents. She is known for studying her rivals extensively, analyzing their strengths and weaknesses to develop a strategy that will give her the best chance of victory. This attention to detail and meticulous preparation allows Arias to enter the ring with confidence and a game plan tailored to her opponent's style.</p>\n\n<p>When Arias steps into the ring, it's clear that she is in her element. Her passion for the sport shines through in every punch she throws and every defensive move she makes. Her fights are a display of skill, determination, and sheer willpower.</p>\n\n<p>Outside of the ring, Arias is known for her humble and down-to-earth personality. She is not one to boast or brag about her successes, but instead remains focused on her training and improving her craft. Arias understands that boxing is a constant learning process and that there is always room for growth.</p>\n\n<p>As a boxer, Arias has faced her fair share of challenges and setbacks. However, she has never let these obstacles define her or hold her back. Instead, she uses them as fuel to push herself even harder and become an even better athlete.</p>\n\n<p>Whether you're a fan of boxing or not, it's hard not to be inspired by Lorena Arias' journey. She has proven time and time again that hard work, determination, and perseverance can lead to success in any endeavor. Arias serves as a reminder that we should never underestimate someone based on their size or appearance.</p>\n\n<p>So the next time you step into the ring or face a challenge of your own, remember Lorena Arias. Remember that even the smallest opponents can pack a powerful punch. And most importantly, remember that with the right mindset and determination, anything is possible.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2011-04-29",
    "proDivision": "light fly",
    "proWins": 3,
    "proWinsByKnockout": 0,
    "proLosses": 8,
    "proLossesByKnockout": 3,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 11,
    "proTotalRounds": 61,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 61,
    "createdAt": "2025-08-08T14:32:01.660008",
    "updatedAt": "2025-08-08T14:32:01.660014"
  },
  {
    "id": "17665.0",
    "boxrecId": "594726",
    "boxrecUrl": "https://boxrec.com/en/box-pro/594726",
    "boxrecWikiUrl": null,
    "slug": "mariam-abdallah",
    "name": "Mariam Abdallah",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Tanzania",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Tanzania",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Mariam Abdallah, a formidable boxer known for her outstanding skills and determination, has made a significant impact on the boxing world. With over two decades of experience, Abdallah has become a force to be reckoned with in the ring. Born and raised in a boxing family, her passion for the sport runs deep, and it is evident in every punch she throws.</p>\n\n<p>Adopting an orthodox stance, Abdallah has developed a style of boxing that combines technical prowess with raw power. Her footwork is impeccable, allowing her to dance around the ring and evade her opponents' attacks with ease. This agility, coupled with her lightning-fast hand speed, makes her a formidable opponent in any weight class.</p>\n\n<p>Beyond her physical attributes, Abdallah possesses the mental strength necessary to excel in the sport. She is known for her unwavering focus and determination, never backing down from a challenge. In the face of adversity, she remains calm and composed, strategizing her next move with precision.</p>\n\n<p>Throughout her career, Abdallah has faced some of the toughest opponents in the sport, each fight pushing her to new limits. Her ability to adapt to different fighting styles and capitalize on her opponents' weaknesses is truly remarkable. In the ring, she is a true chameleon, constantly evolving and improving her skills.</p>\n\n<p>Mariam Abdallah's boxing record speaks for itself. With a string of impressive victories under her belt, she has established herself as one of the top-ranked boxers in her weight class. Her determination and hard work have earned her numerous titles and accolades, further solidifying her legacy in the sport.</p>\n\n<p>But Abdallah's impact reaches far beyond the ring. She is an inspiration to aspiring boxers all over the world, especially young women who dream of pursuing a career in a predominantly male-dominated sport. Abdallah proves that with dedication and perseverance, anything is possible.</p>\n\n<p>In addition to her impressive boxing career, Abdallah is also actively involved in various charitable endeavors. She understands the importance of giving back to the community and uses her platform to make a positive impact. Whether it's raising funds for a worthy cause or mentoring young boxers, Abdallah consistently demonstrates her commitment to making a difference.</p>\n\n<p>Looking ahead, Mariam Abdallah shows no signs of slowing down. As her career continues to flourish, she remains focused on conquering new challenges and breaking barriers. With each fight, she strives to inspire others and leave a lasting legacy in the boxing world.</p>\n\n<p>In conclusion, Mariam Abdallah is a true force in the boxing world. Her technical expertise, mental fortitude, and commitment to giving back make her a role model both inside and outside the ring. As she continues her journey, Abdallah's impact on the sport will undoubtedly be felt for years to come.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2012-01-01",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 2,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 2,
    "proTotalRounds": 8,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 8,
    "createdAt": "2025-08-08T14:32:06.576556",
    "updatedAt": "2025-08-08T14:32:06.576565"
  },
  {
    "id": "17696.0",
    "boxrecId": "602880",
    "boxrecUrl": "https://boxrec.com/en/box-pro/602880",
    "boxrecWikiUrl": null,
    "slug": "christian-hernandez",
    "name": "Christian Hernandez",
    "birthName": null,
    "nicknames": "\"Pulgarcito\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Tijuana, Baja California, Mexico",
    "birthPlace": "Tijuana, Baja California, Mexico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Christian Hernandez: The Lightweight Contender Bringing Fire to the Boxing Ring</p>\n\n<p>When it comes to the world of boxing, few can match the skill and dedication of Christian Hernandez. This talented fighter, known for his relentless energy and unwavering determination, has made a name for himself in the lightweight division. With his orthodox stance and impressive technique, Hernandez has captivated audiences and left opponents in awe. Let's take a closer look at the man behind the gloves and uncover what makes him such a formidable force in the ring.</p>\n\n<p>Born and raised in the heart of a boxing-loving community, Hernandez was destined to become a fighter. From an early age, he showed a natural aptitude for the sport, impressing his coaches and peers with his quick reflexes and lightning-fast punches. As he honed his skills over the years, it became evident that Hernandez possessed the perfect combination of speed, power, and accuracy.</p>\n\n<p>Standing at an average height and weight, Hernandez finds himself in the lightweight division. This weight class, often considered one of the most fiercely competitive, is home to some of the most talented fighters in the world. Yet, Hernandez has managed to rise above the pack and establish himself as a true contender.</p>\n\n<p>One of the many factors that sets Hernandez apart is his unconventional training regimen. While many boxers focus solely on physical conditioning, Hernandez puts equal emphasis on mental preparation. He understands that boxing involves not only physical strength but also mental fortitude and strategic thinking. By training his mind as well as his body, Hernandez is able to enter the ring with a sense of calmness and clarity, giving him a decisive advantage over his opponents.</p>\n\n<p>Inside the ring, Hernandez is a force to be reckoned with. His orthodox stance allows him to generate maximum power with his right hand, often delivering knockout punches that leave opponents floored. But it's not just his power that makes him dangerous. Hernandez possesses remarkable footwork and head movement, enabling him to bob and weave with ease, avoiding incoming blows while simultaneously setting up his own counterattacks.</p>\n\n<p>What truly sets Hernandez apart, however, is his relentless work ethic and unwavering drive. He is known for his punishing training sessions, pushing himself to the limit day in and day out. Whether it's running miles in the early morning or sparring with seasoned veterans, Hernandez never shies away from hard work. This dedication has not gone unnoticed, as it has propelled him to new heights in his career.</p>\n\n<p>When it comes to his boxing style, Hernandez is a master of adaptation. He possesses a keen understanding of his opponents' strengths and weaknesses, allowing him to adjust his strategy on the fly. Whether facing a speedy southpaw or a powerful brawler, Hernandez knows how to adjust his tactics to exploit any vulnerabilities. This versatility has made him a formidable opponent in the ring and a nightmare for his rivals.</p>\n\n<p>While Hernandez is a fighter through and through, he also possesses a charismatic personality outside of the ring. Often seen with a smile on his face and a genuine warmth in his interactions, he has endeared himself to fans and fellow boxers alike. Hernandez understands the importance of connecting with his audience, and his ability to do so only enhances his status as a rising star.</p>\n\n<p>As Hernandez continues his ascent in the boxing world, it's clear that he has all the ingredients for greatness. With his orthodox stance, lightning-fast punches, and unwavering dedication, he poses a formidable threat to anyone in the lightweight division. It's only a matter of time before Hernandez claims his spot at the top of the ranks, cementing his place in boxing history as one of the greats.</p>\n\n<p>So keep an eye out for Christian Hernandez, the lightweight contender who is bringing fire to the boxing ring. With his impressive skills and undeniable passion, he is sure to continue making waves in the world of professional boxing. The stage is set, and the spotlight awaits this rising star.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2000-03-27",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 11,
    "proLossesByKnockout": 9,
    "proDraws": 1,
    "proStatus": "inactive",
    "proTotalBouts": 12,
    "proTotalRounds": 50,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 50,
    "createdAt": "2025-08-08T14:32:07.805677",
    "updatedAt": "2025-08-08T14:32:07.805683"
  },
  {
    "id": "17774.0",
    "boxrecId": "620640",
    "boxrecUrl": "https://boxrec.com/en/box-pro/620640",
    "boxrecWikiUrl": null,
    "slug": "ricardo-perez",
    "name": "Ricardo Perez",
    "birthName": "Joanan Ricardo Perez Ramos",
    "nicknames": "\"Torito\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Cancun, Quintana Roo, Mexico",
    "birthPlace": "Cancun, Quintana Roo, Mexico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Ricardo Perez, born on June 15, 1991, is a prominent figure in the world of professional boxing. Standing at a height of 167.64cm, he has made a name for himself in the Minimumweight and Light Flyweight weight classes. With his orthodox stance and exceptional skills, Perez has become a force to be reckoned with in the ring.</p>\n\n<p>Although Perez does not have any known nicknames, his achievements speak for themselves. Throughout his career, he has proven time and time again that he is a formidable opponent. His dedication, perseverance, and passion for the sport have propelled him to new heights, earning him the respect of both fans and fellow boxers.</p>\n\n<p>As a boxer in the Minimumweight and Light Flyweight divisions, Perez competes against opponents who weigh no more than 105 pounds. This weight restriction presents its own unique challenges, as boxers must rely on speed, technique, and agility to outmaneuver their opponents. It requires discipline and precision to excel in these weight classes, and Perez has risen to the occasion.</p>\n\n<p>Perez's orthodox stance is another attribute that sets him apart in the ring. With his left hand and foot forward, he utilizes his right hand as his power punch. The orthodox stance provides stability and balance, allowing boxers to generate power while maintaining defensive capabilities. Perez has mastered this stance, using it to his advantage in his fights.</p>\n\n<p>One of the key factors contributing to Perez's success is his relentless work ethic. He puts in countless hours of training and conditioning to ensure he is in peak physical condition for every bout. Whether it's honing his technical skills, improving his footwork, or building strength and explosiveness, Perez leaves no stone unturned in his pursuit of excellence.</p>\n\n<p>Beyond his physical attributes, Perez possesses exceptional boxing IQ. He has a profound understanding of the sport's nuances, enabling him to analyze his opponents and strategize accordingly. This intelligence inside the ring allows him to exploit his adversaries' weaknesses and capitalize on opportunities as they arise.</p>\n\n<p>While Perez's journey to success has not been without its challenges, he has embraced the setbacks and used them as stepping stones toward improvement. Every defeat has served as a lesson, motivating him to train harder, refine his skills, and approach each fight with a renewed sense of determination. This resilience and ability to bounce back are testament to his character and dedication to his craft.</p>\n\n<p>When it comes to his fighting style, Perez is known for his combination of speed and power. His punches are lightning fast, capable of catching opponents off-guard and delivering significant damage. At the same time, his punches carry tremendous power, capable of knocking out even the most formidable opponents.</p>\n\n<p>Outside the ring, Perez is a humble and soft-spoken individual. He lets his actions speak louder than words, approaching each fight with a quiet confidence. Whether it's facing a seasoned veteran or an up-and-coming opponent, Perez treats every fight with the same level of respect and preparedness.</p>\n\n<p>In the world of boxing, Ricardo Perez is a name that resonates with enthusiasts and experts alike. His skills, determination, and sportsmanship have earned him a reputation as one of the sport's most promising talents. As Perez continues to showcase his abilities in the ring, fans eagerly await his next bout, eager to witness the electrifying display of skill and tenacity that has become synonymous with his name.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2012-07-19",
    "proDivision": "light fly",
    "proWins": 10,
    "proWinsByKnockout": 8,
    "proLosses": 2,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 12,
    "proTotalRounds": 58,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 58,
    "createdAt": "2025-08-08T14:32:10.635688",
    "updatedAt": "2025-08-08T14:32:10.635694"
  },
  {
    "id": "17857.0",
    "boxrecId": "632869",
    "boxrecUrl": "https://boxrec.com/en/box-pro/632869",
    "boxrecWikiUrl": null,
    "slug": "yuki-uchida",
    "name": "Yuki Uchida",
    "birthName": "内田勇気",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/f/fe/BUchidaYuuki.jpg/200px-BUchidaYuuki.jpg",
    "residence": "Yamato, Kanagawa, Japan",
    "birthPlace": "Yokohama, Kanagawa, Japan",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Japan",
    "height": "158",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Yuki Uchida: Rising Star in the Boxing Ring</p>\n\n<p>When it comes to boxing, there are always those few fighters who capture the hearts of fans and leave a lasting impression. Yuki Uchida is one such rising star. Born on May 23, 1993, this Japanese boxer has made a name for herself in the Minimumweight and Light Flyweight weight classes.</p>\n\n<p>Coming in at just 158cm in height, Yuki Uchida may be small in stature, but she packs a punch that can't be ignored. As an orthodox fighter, she utilizes her skills and technique to outmaneuver her opponents and deliver devastating blows.</p>\n\n<p>With her impressive record and determination, it's no wonder that Yuki has gained a loyal following of fans. But who is this young fighter and what has she achieved in her career so far?</p>\n\n<p>Yuki Uchida began her boxing journey at a young age, driven by a passion for the sport. Through dedication and hard work, she quickly rose through the ranks and caught the attention of boxing enthusiasts worldwide. While she may not have any official nicknames yet, her skill in the ring speaks for itself.</p>\n\n<p>One of the defining factors that sets Yuki apart is her weight class. Competing in the Minimumweight and Light Flyweight divisions, she faces opponents who are similar in size and weight. This allows for fair and exciting matchups, showcasing her true abilities as a boxer.</p>\n\n<p>Throughout her career, Yuki Uchida has faced some tough opponents, testing her mettle and pushing her to her limits. However, she has consistently risen to the challenge, showcasing her strength and determination in every fight.</p>\n\n<p>One of the aspects that makes Yuki such a formidable fighter is her orthodox stance. This means that she favors her right hand as her power punch, keeping her left foot forward. By utilizing this stance, she can effectively land powerful punches while maintaining her balance and defensive capabilities.</p>\n\n<p>Even though Yuki Uchida has achieved great success in her relatively short career, her hunger for victory remains insatiable. She continually strives to improve her skills and techniques, always looking for ways to outsmart her opponents and come out on top.</p>\n\n<p>It's not just her technical skills that make Yuki Uchida an intriguing boxer to watch, but also her sheer determination and passion for the sport. Each time she steps into the ring, she gives her all, leaving nothing behind. Her explosive bursts of energy and precise movements keep fans on the edge of their seats, eagerly anticipating her every move.</p>\n\n<p>Yuki Uchida's rise to fame in the boxing world serves as a testament to her talent and hard work. Despite the challenges she has faced, she continues to defy expectations and make her mark in the ring.</p>\n\n<p>But what does the future hold for this young fighter? With her skillset and relentless drive, there's no doubt that Yuki Uchida has a bright future ahead of her. As she continues to climb the ranks and face tougher opponents, she will undoubtedly leave a lasting legacy in the world of boxing.</p>\n\n<p>In conclusion, Yuki Uchida is a force to be reckoned with in the Minimumweight and Light Flyweight divisions. Her small stature and orthodox stance belie her true power, making her an exciting and unpredictable opponent. With her determination and skill, she is set to make waves in the boxing world for years to come.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2012-11-18",
    "proDivision": "light fly",
    "proWins": 8,
    "proWinsByKnockout": 1,
    "proLosses": 12,
    "proLossesByKnockout": 2,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 20,
    "proTotalRounds": 116,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 116,
    "createdAt": "2025-08-08T14:32:13.833699",
    "updatedAt": "2025-08-08T14:32:13.833702"
  },
  {
    "id": "17862.0",
    "boxrecId": "634552",
    "boxrecUrl": "https://boxrec.com/en/box-pro/634552",
    "boxrecWikiUrl": null,
    "slug": "angel-l-acosta-gomez",
    "name": "Angel L. Acosta Gomez",
    "birthName": "Angel L. Acosta Gómez",
    "nicknames": "\"Tito\"",
    "avatarImage": "https://boxrec.com/images/thumb/0/08/634552.jpeg/200px-634552.jpeg",
    "residence": "San Juan, Puerto Rico",
    "birthPlace": "San Juan, Puerto Rico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Puerto Rico",
    "height": "163",
    "reach": "161",
    "stance": "orthodox",
    "bio": "<p>Ángel \"Tito\" Acosta is a professional boxer known for his lightning-fast speed and devastating knockout power. Born on October 8, 1990, in Puerto Rico, Acosta has proven himself to be one of the top fighters in the light flyweight division.</p>\n\n<p>Standing at a compact height of 163cm and boasting a reach of 163cm, Acosta possesses incredible agility and the ability to close the distance quickly. His orthodox stance gives him a solid foundation to generate power and unleash his explosive combinations.</p>\n\n<p>Acosta competes in the light flyweight division, with a weight of 56.79kg. This weight class is known for its fierce competition and fast-paced action, making it the perfect platform for Acosta to showcase his skills.</p>\n\n<p>Nicknamed \"Tito,\" Acosta has built a reputation for his relentless style in the ring and his ability to overpower his opponents. His knockout power is truly a sight to behold, as he has the capability to end a fight with a single, well-placed punch.</p>\n\n<p>Over his impressive career, Acosta has faced some of the toughest fighters in his weight class and emerged victorious. His ability to adapt to his opponents' styles and exploit their weaknesses has made him a formidable force to be reckoned with.</p>\n\n<p>With a record of [insert record here], Acosta has proven himself to be a dominant force in the light flyweight division. His speed, power, and technical skill set him apart from his competitors, making him a fan favorite and a force to be feared.</p>\n\n<p>Acosta's journey to success in the boxing world has not been without its challenges. Like any athlete, he has had to endure grueling training sessions, strict dieting, and countless hours of preparation to become the best in his weight class.</p>\n\n<p>But through it all, Acosta has remained focused and determined, never losing sight of his goals. His sheer dedication and unwavering commitment to his craft have propelled him to the top of the boxing world.</p>\n\n<p>Outside the ring, Acosta is known for his friendly and humble demeanor. He is a true ambassador for the sport of boxing, always taking the time to interact with his fans and give back to the community.</p>\n\n<p>Whether it's inside the ring or outside of it, Ángel \"Tito\" Acosta continues to captivate audiences with his electrifying performances and inspiring story. As he climbs the ranks of the light flyweight division, there is no doubt that Acosta will leave an indelible mark on the world of boxing.</p>\n\n<p>So, keep an eye out for this extraordinary fighter as he continues to showcase his skills and add to his already impressive list of victories. Ángel \"Tito\" Acosta is a force to be reckoned with and a true boxing talent.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "light fly",
    "proWins": 25,
    "proWinsByKnockout": 23,
    "proLosses": 5,
    "proLossesByKnockout": 3,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 30,
    "proTotalRounds": 155,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 155,
    "createdAt": "2025-08-08T14:32:14.011731",
    "updatedAt": "2025-08-08T14:32:14.011737"
  },
  {
    "id": "17925.0",
    "boxrecId": "644435",
    "boxrecUrl": "https://boxrec.com/en/box-pro/644435",
    "boxrecWikiUrl": null,
    "slug": "esteban-bermudez",
    "name": "Esteban Bermudez",
    "birthName": "Esteban Bermudez Salas",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/8/8d/644435.jpg/200px-644435.jpg",
    "residence": "Nezahualcóyotl, México, Mexico",
    "birthPlace": "Nezahualcóyotl, México, Mexico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": "170",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Esteban Bermudez: The Rising Star in Boxing</p>\n\n<p>When it comes to the world of boxing, there are few fighters as promising as Esteban Bermudez. Born on October 11, 1995, Bermudez has quickly made a name for himself in the sport, impressing fans and critics alike with his skill, determination, and unwavering spirit.</p>\n\n<p>Standing at a height of 170cm and with a reach of 170cm, Bermudez is a force to be reckoned with in the ring. He possesses incredible speed, agility, and precision, making him a formidable opponent for any boxer in his weight class. Speaking of weight class, Bermudez competes in the Light Flyweight division, where he has proven to be a true champion.</p>\n\n<p>One of the things that sets Bermudez apart from his peers is his orthodox stance. While many fighters opt for a southpaw stance, Bermudez prefers the orthodox style, which allows him to utilize his dominant hand and foot to his advantage. This stance, combined with his lightning-fast reflexes, gives him an edge in every fight he enters.</p>\n\n<p>Despite his young age, Bermudez already has over 20 years of experience in the boxing world. From the moment he laced up his first pair of gloves, he knew that he was meant to be a fighter. With each passing year, he honed his skills, learning from every victory and defeat, and emerging as a true boxing prodigy.</p>\n\n<p>While some boxers rely purely on their physical attributes, Bermudez understands the importance of mental strength in the ring. He approaches every fight with a laser-like focus, analyzing his opponent's strengths and weaknesses, and strategizing how to come out on top. His ability to adapt during a fight is unmatched, making him a formidable force to contend with.</p>\n\n<p>Bermudez's dedication to the sport is evident in his rigorous training regimen. He spends countless hours in the gym, perfecting his technique and building his endurance. From shadow boxing to sparring sessions with some of the best fighters in the world, he pushes himself to the limit in order to achieve greatness.</p>\n\n<p>When Bermudez steps into the ring, he possesses an unyielding determination. He fights not only for himself but also for his fans and the people who have supported him throughout his journey. Every punch he throws is fueled by passion and a desire to be the best, making his fights electrifying and filled with anticipation.</p>\n\n<p>While Bermudez may not have a flashy nickname like some other fighters, his record speaks for itself. His win-loss ratio is impressive, with a majority of his wins coming by way of knockout. His punches have been described as lightning bolts, capable of knocking out opponents in an instant.</p>\n\n<p>As the boxing world continues to take notice of Bermudez's talent, the question on everyone's mind is: what's next for this rising star? With his skillset, there is no doubt that he has a bright future ahead of him. Whether it's capturing more titles in his weight class or moving up to higher divisions, the sky's the limit for Bermudez.</p>\n\n<p>So, keep an eye out for Esteban Bermudez. This young fighter is poised to leave a lasting impact on the world of boxing. With his impressive physical attributes, unwavering determination, and knack for delivering knockout punches, he is undoubtedly a force to be reckoned with. Don't blink, because you won't want to miss a moment of Bermudez's journey to boxing greatness.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2013-03-07",
    "proDivision": "light fly",
    "proWins": 14,
    "proWinsByKnockout": 10,
    "proLosses": 4,
    "proLossesByKnockout": 2,
    "proDraws": 2,
    "proStatus": "inactive",
    "proTotalBouts": 20,
    "proTotalRounds": 87,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 87,
    "createdAt": "2025-08-08T14:32:16.277516",
    "updatedAt": "2025-08-08T14:32:16.277521"
  },
  {
    "id": "18069.0",
    "boxrecId": "668",
    "boxrecUrl": "https://boxrec.com/en/box-pro/668",
    "boxrecWikiUrl": null,
    "slug": "jacob-matlala",
    "name": "Jacob Matlala",
    "birthName": null,
    "nicknames": "\"Baby Jake\"",
    "avatarImage": "https://boxrec.com/images/thumb/5/54/Jacob_Matlala1.jpg/200px-Jacob_Matlala1.jpg",
    "residence": "Meadowlands, Gauteng, South Africa",
    "birthPlace": "Soweto, Gauteng, South Africa",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "South Africa",
    "height": "148",
    "reach": "150",
    "stance": "orthodox",
    "bio": "<p>In the world of boxing, there are legendary fighters who leave a lasting impact on the sport. One such fighter is the renowned Jacob \"Baby Jake\" Matlala. Born on August 1, 1962, Matlala stands at a compact 147cm tall and possesses a reach of 150cm. Despite his small stature, he carved his name in boxing history and achieved greatness in various weight classes such as Minimumweight, Light Flyweight, Flyweight, and Super Flyweight.</p>\n\n<p>Baby Jake Matlala, as he is affectionately known, captured the hearts of fans around the world with his electrifying performances inside the ring. His diminutive size belied the explosive power he possessed and the lightning-fast punches he unleashed upon his opponents.</p>\n\n<p>Matlala's boxing journey began in the late 1980s, and it didn't take long for him to make his mark on the professional scene. He proved to be a formidable force in the Minimumweight division, where he showcased his exceptional skills and unparalleled determination.</p>\n\n<p>What made Matlala stand out even more was his ability to adapt and excel in different weight classes. Moving up to Light Flyweight, he continued to demonstrate his prowess and resilience, captivating fans with his relentless pursuit of victory.</p>\n\n<p>Throughout his career, Matlala faced numerous challenges, both inside and outside the ring. But true to his fighting spirit, he overcame them all with unwavering determination and steadfast commitment to his craft.</p>\n\n<p>One of Matlala's most memorable moments came in 1997 when he faced off against the highly regarded Michael Carbajal. Carbajal, a former world champion, was considered by many as one of the best fighters in the Super Flyweight division. However, Matlala defied the odds and emerged victorious, stunning the boxing world and solidifying his place among the elite.</p>\n\n<p>Matlala's legacy extends far beyond his impressive record and world titles. He was a beacon of light in his community, using his success to inspire and uplift those around him. He believed in the power of education and tirelessly advocated for the importance of staying in school and pursuing dreams.</p>\n\n<p>As we reflect on the remarkable career of Jacob \"Baby Jake\" Matlala, it is clear that his impact reaches far beyond the boxing ring. He was a true champion, not only in terms of his sporting achievements but also in the way he carried himself and touched the lives of others.</p>\n\n<p>Matlala's story serves as a reminder that greatness knows no boundaries. Despite his physical limitations, he defied the odds and achieved remarkable success. His journey is a testament to the power of determination, resilience, and unwavering belief in oneself.</p>\n\n<p>Today, we pay tribute to the indomitable spirit of Jacob \"Baby Jake\" Matlala and the enduring legacy he leaves behind. He will forever be remembered as one of the all-time greats in the world of boxing, a true inspiration to aspiring fighters and fans alike.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1980-02-02",
    "proDivision": "light fly",
    "proWins": 53,
    "proWinsByKnockout": 26,
    "proLosses": 13,
    "proLossesByKnockout": 3,
    "proDraws": 2,
    "proStatus": "inactive",
    "proTotalBouts": 68,
    "proTotalRounds": 547,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 547,
    "createdAt": "2025-08-08T14:32:21.625252",
    "updatedAt": "2025-08-08T14:32:21.625260"
  },
  {
    "id": "18106.0",
    "boxrecId": "675026",
    "boxrecUrl": "https://boxrec.com/en/box-pro/675026",
    "boxrecWikiUrl": null,
    "slug": "panya-pradabsri",
    "name": "Panya Pradabsri",
    "birthName": "Panya Pradabsri",
    "nicknames": "\"Petchmanee CP Freshmart\"",
    "avatarImage": "https://boxrec.com/images/thumb/8/85/675026a.jpg/200px-675026a.jpg",
    "residence": "Bangkok, Thailand",
    "birthPlace": "Nam Yuen, Thailand",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Thailand",
    "height": "158",
    "reach": "162",
    "stance": "orthodox",
    "bio": "<p>Introducing Panya Pradabsri, a rising star in the world of professional boxing. Born on February 21, 1991, this talented athlete, known by the nicknames \"Ya\" and \"Petchmanee CP Freshmart,\" has quickly made a name for himself in the ring. With a height of 162cm and a reach of 162cm, Pradabsri possesses a compact frame that allows him to showcase his impressive skills with precision and agility.</p>\n\n<p>Pradabsri competes in the Minimumweight weight class, where he weighs an admirable 47.63kg. Known for his orthodox stance, Pradabsri utilizes his technical abilities and lightning-fast reflexes to outmaneuver and outclass his opponents. He has gained a reputation for his swift footwork, sharp jabs, and devastating combinations, leaving his adversaries in awe.</p>\n\n<p>With over two decades of experience in the sport, Panya Pradabsri has honed his craft to near perfection. He has dedicated countless hours to training, allowing him to seamlessly blend his exceptional physical talents with an astute boxing IQ. Pradabsri's dedication and commitment have propelled him to the forefront of the boxing scene, and his journey is one that has captured the attention and admiration of fans worldwide.</p>\n\n<p>While Pradabsri's professional record speaks for itself, it is also important to highlight his remarkable progression throughout his career. Starting from humble beginnings, Pradabsri faced numerous challenges on his path to success. However, his resilience and unwavering determination pushed him to never give up on his dreams.</p>\n\n<p>Entering the professional boxing scene, Pradabsri showcased his skills and sheer tenacity in each bout. With each victory, his confidence grew, and his fanbase expanded. He gradually climbed the ranks, cementing his position as one of the most formidable Minimumweight boxers in the world.</p>\n\n<p>Pradabsri's style inside the ring is a blend of finesse and power. He possesses a deep understanding of the sweet science, which allows him to adapt to any opponent's style and exploit weaknesses with precision. His lightning-quick combinations often catch his adversaries off guard, leaving them perplexed and struggling to find an answer.</p>\n\n<p>One of Pradabsri's strongest attributes is his burstiness. He has a remarkable ability to unleash a sudden flurry of punches, overwhelming his opponents within seconds. This burst of energy and aggression often catches his rivals off guard, leaving them vulnerable and struggling to mount an effective counterattack.</p>\n\n<p>Offensively, Pradabsri's punching power cannot be underestimated. Despite his compact stature, he generates an impressive amount of force behind each strike, capable of delivering knockout blows to even the toughest opponents. His precise punching technique, coupled with his explosive power, makes him a genuinely feared presence in the ring.</p>\n\n<p>Defensively, Pradabsri's reflexes and footwork allow him to evade punches with grace and finesse. His ability to slip and weave often frustrates his adversaries, leaving them swinging at thin air. Pradabsri's adept defensive skills offer him a significant advantage, as he can swiftly transition from avoiding punches to launching devastating counterattacks.</p>\n\n<p>Pradabsri's rise to prominence has not come without sacrifices and setbacks. Like any athlete, he has faced his fair share of challenges and overcome obstacles along the way. However, it is the willingness to confront adversity head-on that separates Pradabsri from his peers.</p>\n\n<p>Looking forward, Panya Pradabsri's future in the sport of boxing is undoubtedly bright. His exceptional talent, coupled with his relentless drive and thirst for greatness, makes him a formidable force in the Minimumweight division. As he continues to climb the ranks and expand his skillset, the world eagerly awaits his next move inside the squared circle.</p>\n\n<p>Panya Pradabsri's journey is a testament to the power of perseverance and determination. From his humble beginnings to his current status as a rising star, Pradabsri has proven that dreams can indeed become a reality with hard work and dedication. As he continues to leave his mark on the sport of boxing, fans can only imagine the heights he will reach and the excitement he will bring to the ring.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "light fly",
    "proWins": 44,
    "proWinsByKnockout": 27,
    "proLosses": 3,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 47,
    "proTotalRounds": 295,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 295,
    "createdAt": "2025-08-08T14:32:23.191070",
    "updatedAt": "2025-08-08T14:32:23.191078"
  },
  {
    "id": "18129.0",
    "boxrecId": "679546",
    "boxrecUrl": "https://boxrec.com/en/box-pro/679546",
    "boxrecWikiUrl": null,
    "slug": "daniel-valladares",
    "name": "Daniel Valladares",
    "birthName": "Angel Daniel Valladares Perez",
    "nicknames": "\"Cejitas\"",
    "avatarImage": "https://boxrec.com/images/thumb/b/ba/679546.jpg/200px-679546.jpg",
    "residence": "Monterrey, Nuevo León, Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": "159",
    "reach": "160",
    "stance": "orthodox",
    "bio": "<p>Boxing has always been a sport that tests the limits of human endurance and skill. It is a sport that commands respect and admiration, as the athletes involved undergo rigorous training and put their bodies on the line for a shot at glory. One such athlete who has captured the attention of the boxing world is Daniel Valladares - a formidable boxer who competes in the Minimumweight weight class.</p>\n\n<p>Born on June 10, 1994, Valladares has dedicated his life to the sport he loves. Standing at 160cm tall with a reach of 163cm, he possesses a compact frame that allows him to be nimble and elusive in the boxing ring. His nickname, \"Cejitas,\" which translates to \"little eyebrows,\" hints at his unyielding determination and tenacity as a fighter.</p>\n\n<p>Valladares's boxing style is orthodox - a stance that is observed by the majority of fighters. This means that he uses his left hand as his lead hand and his right hand as his power hand. It is a stance that allows for quick jabs and powerful straight punches, giving him an advantage in close-quarters combat.</p>\n\n<p>The Minimumweight weight class in boxing is known for its fierce competition and skilled fighters. It is a weight class where athletes must not exceed 105 pounds or 48 kilograms. Competing in this weight class requires discipline and dedication to maintaining a lean and fit physique, allowing fighters to maximize their speed and agility inside the ring.</p>\n\n<p>As a Minimumweight boxer, Valladares faces opponents who share his desire for victory and supremacy. The competition in this weight class is fierce, with each fighter vying for a chance to establish themselves as a force to be reckoned with in the boxing world.</p>\n\n<p>Valladares's journey in the sport of boxing began at an early age. His passion for the sport was evident, and he quickly caught the attention of trainers and coaches who recognized his potential. Under the guidance of experienced mentors, Valladares honed his skills and developed into a formidable boxer.</p>\n\n<p>His training routine is grueling, consisting of long hours in the gym, focused on improving his strength, speed, and endurance. Valladares understands that to succeed in the boxing world, every aspect of his physical and mental game must be finely tuned.</p>\n\n<p>Inside the boxing ring, Valladares showcases his technical prowess and strategic approach to the sport. His footwork allows him to move swiftly around his opponents, setting up opportunities to strike with precision and power. His punches are calculated and delivered with intent, aiming to inflict maximum damage on his opponents.</p>\n\n<p>One of the greatest challenges Valladares faces as a Minimumweight boxer is the need to maintain his weight before a fight. The strict weight restrictions demand discipline and sacrifice, as he must carefully manage his diet and training to ensure he is within the weight limit on fight night. This aspect of the sport can test a fighter both physically and mentally, but Valladares rises to the challenge.</p>\n\n<p>Valladares's career as a professional boxer has witnessed both triumphs and setbacks. But through it all, he remains focused and determined to achieve greatness. Every fight is a learning experience for him, providing valuable insights and lessons that he carries into his next bout.</p>\n\n<p>As Valladares continues to make his mark in the boxing world, his fans eagerly await his next appearance in the ring. His undeniable skill and unwavering commitment to the sport make him a force to be reckoned with, and his journey is far from over.</p>\n\n<p>Boxing fans can rest assured that Daniel \"Cejitas\" Valladares will continue to captivate and inspire with his exceptional boxing talent and unwavering dedication to the sport he loves. The world of boxing eagerly awaits his next triumph, as he continues to break barriers and leave his mark in boxing history.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "light fly",
    "proWins": 30,
    "proWinsByKnockout": 18,
    "proLosses": 4,
    "proLossesByKnockout": 1,
    "proDraws": 1,
    "proStatus": "",
    "proTotalBouts": 35,
    "proTotalRounds": 214,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 214,
    "createdAt": "2025-08-08T14:32:23.985195",
    "updatedAt": "2025-08-08T14:32:23.985201"
  },
  {
    "id": "18315.0",
    "boxrecId": "716066",
    "boxrecUrl": "https://boxrec.com/en/box-pro/716066",
    "boxrecWikiUrl": null,
    "slug": "sandy-lam",
    "name": "Sandy Lam",
    "birthName": "林海明",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/0/03/Sandy_Lam.jpg/200px-Sandy_Lam.jpg",
    "residence": "Hong Kong S.A.R., China",
    "birthPlace": "Hong Kong S.A.R., China",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Hong Kong S.A.R., China",
    "height": null,
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>When it comes to the world of boxing, there are few names that hold the power to captivate audiences and inspire awe quite like Sandy Lam. With a career spanning over two decades, Lam has become a formidable force in the sport, earning a reputation for his skill, determination, and unwavering commitment to his craft.</p>\n\n<p>Born and raised in a small town, Lam discovered his love for boxing at a young age. He was drawn to the intensity, the physicality, and the strategic elements of the sport. From the moment he stepped into the ring, it was clear that Lam was destined for greatness.</p>\n\n<p>One of the key factors that set Lam apart from his competitors is his orthodox stance. Standing with his left foot forward and his right foot back, Lam has honed his skills to seamlessly transition between offense and defense. This stance allows him to deliver powerful punches while maintaining a solid defensive position, making him a force to be reckoned with.</p>\n\n<p>Throughout his illustrious career, Lam has faced off against some of the most formidable opponents in the boxing world. From grueling battles in the gym to high-stakes matches on the world stage, Lam has consistently proven his mettle and showcased his exceptional boxing prowess.</p>\n\n<p>While Lam may not have a specific nickname that has become synonymous with his name, his accomplishments in the ring speak volumes. Known for his lightning-fast reflexes, devastating hooks, and impeccable footwork, Lam has earned the respect and admiration of fans and fellow boxers alike.</p>\n\n<p>But it's not just Lam's physical abilities that have contributed to his success; it's his unwavering mental fortitude as well. Lam has demonstrated an impressive ability to remain calm under pressure, to strategically analyze his opponents, and to adjust his tactics accordingly. This mental agility has played a crucial role in his victories throughout the years.</p>\n\n<p>Over the course of his career, Lam has amassed an impressive collection of accolades and championship titles. From winning regional championships to claiming world titles, Lam has consistently proven himself to be among the best in the business. But he hasn't let the fame and fortune go to his head; Lam remains humble and focused on his goals, always striving to improve and push his own limits.</p>\n\n<p>Outside of the ring, Lam is known for his philanthropic endeavors. From supporting local youth programs to advocating for mental health awareness, Lam is passionate about using his platform for good. He understands the importance of giving back to the community that has supported him throughout his career, and he remains committed to making a positive impact.</p>\n\n<p>In conclusion, Sandy Lam's impact on the world of boxing is undeniable. His skill, determination, and relentless pursuit of excellence have catapulted him to the top of the sport. With his orthodox stance, lightning-fast reflexes, and unwavering mental fortitude, Lam has left an indelible mark on the boxing world. As he continues to dominate the ring and inspire a new generation of boxers, there's no doubt that Lam's legacy will endure for years to come.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2015-12-26",
    "proDivision": "light fly",
    "proWins": 2,
    "proWinsByKnockout": 1,
    "proLosses": 1,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 3,
    "proTotalRounds": 11,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 11,
    "createdAt": "2025-08-08T14:32:30.836289",
    "updatedAt": "2025-08-08T14:32:30.836298"
  },
  {
    "id": "18398.0",
    "boxrecId": "733298",
    "boxrecUrl": "https://boxrec.com/en/box-pro/733298",
    "boxrecWikiUrl": null,
    "slug": "elizabeth-garcia",
    "name": "Elizabeth Garcia",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Honduras",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Honduras",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Meet Elizabeth Garcia, a rising star in the world of boxing. At just 48.08kg, Garcia may be small in stature, but she possesses an enormous amount of talent and determination.</p>\n\n<p>Despite her relatively young age, Garcia has already made a name for herself in the boxing community. With a record of 20 years of experience, she has honed her skills and become a force to be reckoned with inside the squared circle.</p>\n\n<p>Garcia's journey in boxing began at a young age. Growing up in a boxing-loving family, she was exposed to the sport from an early age. It didn't take long for Garcia to realize that boxing was her true passion.</p>\n\n<p>Throughout her career, Garcia has faced many challenges. Boxing is a physically demanding sport, requiring immense strength and endurance. But Garcia has consistently risen to the occasion, pushing herself to the limits and exceeding expectations.</p>\n\n<p>One of Garcia's greatest strengths is her speed and agility. She is able to quickly maneuver around her opponents, using her footwork to create openings and land precise punches. Her opponents often find themselves chasing shadows as Garcia evades their attacks with ease.</p>\n\n<p>But it's not just her speed that sets Garcia apart. She also possesses incredible power in her punches. When she connects, it's like a thunderous clap of thunder, leaving her opponents dazed and overwhelmed.</p>\n\n<p>However, Garcia's success is not solely attributed to her physical abilities. She is also an incredibly intelligent fighter, constantly analyzing her opponents' weaknesses and adjusting her strategy accordingly. Garcia is a master of timing and precision, always capitalizing on the slightest vulnerability.</p>\n\n<p>Outside of the ring, Garcia is known for her humility and down-to-earth demeanor. Despite her accomplishments, she remains humble and keeps striving to improve. She understands that boxing is a never-ending journey of growth and development.</p>\n\n<p>Garcia's future in boxing looks incredibly bright. As she continues to climb the ranks, it's only a matter of time before she captures a world title. With her unmatched talent and unwavering determination, Garcia is destined to leave a lasting legacy in the sport.</p>\n\n<p>So, keep your eyes on Elizabeth Garcia, because she is primed to become the next big thing in boxing. Whether she's dodging punches or landing devastating blows, one thing is for certain – Garcia is a force to be reckoned with.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2015-09-18",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 1,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 1,
    "proTotalRounds": 3,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 3,
    "createdAt": "2025-08-08T14:32:33.838272",
    "updatedAt": "2025-08-08T14:32:33.838274"
  },
  {
    "id": "18403.0",
    "boxrecId": "733976",
    "boxrecUrl": "https://boxrec.com/en/box-pro/733976",
    "boxrecWikiUrl": null,
    "slug": "jose-barrios",
    "name": "Jose Barrios",
    "birthName": "Jose Gregorio Barrios Ramirez",
    "nicknames": "\"El Guajiro\"",
    "avatarImage": "https://boxrec.com/images/thumb/d/d4/733976.jpg/200px-733976.jpg",
    "residence": "Caracas, Venezuela",
    "birthPlace": "Caracas, Venezuela",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Venezuela",
    "height": "156",
    "reach": "162",
    "stance": "orthodox",
    "bio": "<p>Breaking Barriers: The Inspiring Journey of Jose Barrios</p>\n\n<p>When it comes to boxing, few stories are as inspiring and captivating as that of Jose Barrios. Born and raised in a tough neighborhood, Barrios faced numerous challenges and setbacks throughout his life. However, his unwavering determination, indomitable spirit, and sheer talent have made him a force to be reckoned with in the boxing world.</p>\n\n<p>Barrios discovered his love for boxing at an early age. Growing up in a neighborhood plagued by violence and crime, he turned to the sport as an escape from the harsh realities of his surroundings. It quickly became clear that Barrios had a natural talent for boxing, displaying exceptional speed, power, and agility.</p>\n\n<p>As a teenager, Barrios began training at a local boxing gym under the guidance of a seasoned coach. His raw talent and dedication to his craft quickly caught the attention of the boxing community, and he was soon invited to join a prestigious boxing academy.</p>\n\n<p>Under the tutelage of renowned trainers, Barrios honed his skills and developed his unique style in the ring. His lightning-fast footwork, precision punches, and strategic defense made him an unstoppable force. Barrios soon gained a reputation for his ability to outmaneuver and outbox opponents, earning him a string of victories in the amateur boxing circuit.</p>\n\n<p>One of Barrios' defining moments came when he represented his country in the Olympics. The sheer magnitude of the event didn't faze him - instead, it fueled his determination to succeed. Barrios fought with unmatched intensity and skill, ultimately winning a silver medal for his country. His stellar performance on the world stage not only brought him recognition but also solidified his status as a rising boxing star.</p>\n\n<p>After the Olympics, Barrios made the decision to turn professional. His professional career got off to a blazing start, with a series of knockout wins that left spectators in awe of his power and precision. Barrios quickly became a fan favorite, captivating audiences with his dynamic boxing style and innate charisma.</p>\n\n<p>Throughout his professional career, Barrios faced seasoned champions and rising prospects alike, never shying away from a challenge. His relentless work ethic and ability to adapt to different opponents made him a formidable opponent in the ring. Barrios consistently delivered electrifying performances, thrilling fans with his explosive combinations and technical prowess.</p>\n\n<p>However, Barrios' journey hasn't been without its fair share of setbacks. He has faced injuries, personal struggles, and moments of self-doubt along the way. But true to his resilient nature, Barrios has always managed to bounce back stronger than ever.</p>\n\n<p>Barrios' meteoric rise in the boxing world has earned him multiple titles and accolades. His championship belts serve as a testament to his unwavering dedication and unwavering pursuit of greatness. Barrios' story is a testament to the power of resilience, determination, and the ability to overcome adversity.</p>\n\n<p>Outside the ring, Barrios is passionate about giving back to his community and inspiring the next generation of boxers. He frequently holds boxing clinics and mentors young fighters, instilling in them the values of discipline, hard work, and perseverance.</p>\n\n<p>In conclusion, Jose Barrios is not just a boxer but a symbol of hope, resilience, and triumph. His journey from a troubled neighborhood to the pinnacle of the boxing world is a testament to the power of the human spirit. Barrios continues to inspire and captivate fans all over the world with his electrifying performances and unyielding determination. As he continues to break barriers and push the boundaries of the sport, there's no doubt that Jose Barrios will be remembered as one of boxing's greatest legends.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "light fly",
    "proWins": 5,
    "proWinsByKnockout": 2,
    "proLosses": 12,
    "proLossesByKnockout": 8,
    "proDraws": 4,
    "proStatus": "",
    "proTotalBouts": 21,
    "proTotalRounds": 85,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 85,
    "createdAt": "2025-08-08T14:32:33.965106",
    "updatedAt": "2025-08-08T14:32:33.965112"
  },
  {
    "id": "18464.0",
    "boxrecId": "744107",
    "boxrecUrl": "https://boxrec.com/en/box-pro/744107",
    "boxrecWikiUrl": null,
    "slug": "natalie-gonzalez",
    "name": "Natalie Gonzalez",
    "birthName": null,
    "nicknames": "\"The Barracuda\"",
    "avatarImage": "https://boxrec.com/images/thumb/2/27/744107.jpg/200px-744107.jpg",
    "residence": "New Rochelle, New York, USA",
    "birthPlace": "New Rochelle, New York, USA",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "USA",
    "height": "157",
    "reach": "155",
    "stance": "orthodox",
    "bio": "<p>Introducing Natalie Gonzalez, a rising star in the boxing world. Born on February 20, 1991, this talented fighter has already made a name for herself with her impressive skills inside the ring. Standing at a height of 157cm and boasting a reach of 155cm, Gonzalez may be small in stature but she packs a powerful punch.</p>\n\n<p>Gonzalez, also known by her nickname [], possesses an orthodox stance, which is the traditional stance for right-handed boxers. This allows her to use her dominant hand for powerful punches and her non-dominant hand for defense. Combined with her lightning-fast footwork and agility, she has proven to be a formidable opponent for anyone who steps in the ring with her.</p>\n\n<p>One of Gonzalez's key strengths is her versatility. She can adapt to different fighting styles and adjust her strategy accordingly. Whether she's up against an aggressive brawler or a technical counterpuncher, Gonzalez has the ability to analyze her opponent's strengths and weaknesses and tailor her approach to gain the upper hand.</p>\n\n<p>In terms of weight, Gonzalez competes in the 53.52kg category. Maintaining this weight allows her to optimize her power and speed, giving her an advantage against opponents in her weight class. However, it's worth noting that in boxing, weight categories can be incredibly competitive, and Gonzalez consistently trains to maintain her weight and keep herself in peak physical condition.</p>\n\n<p>Inside the ring, Gonzalez's dedication to her craft is evident. She spends hours honing her skills, focusing on her technique and conditioning. Training camps play a crucial role in her preparation for fights, allowing her to fine-tune her strengths and work on areas that may need improvement.</p>\n\n<p>Off the ring, Gonzalez is also an advocate for mental and emotional well-being. She understands the importance of mental toughness and resilience in such a demanding sport. Through meditation, visualization, and positive affirmations, she cultivates a strong mindset that allows her to overcome challenges and stay focused during intense bouts.</p>\n\n<p>Gonzalez has already achieved remarkable success in her boxing career, but she is far from done. With her undeniable talent and unwavering determination, she has her sights set on even greater accomplishments. Her dream is to become a world champion, and she is leaving no stone unturned in her pursuit of that title.</p>\n\n<p>It's not just her skills inside the ring that make Gonzalez stand out, but also her passion for giving back to the community. She actively participates in charity events and youth boxing programs, using her platform to inspire and uplift others. In a sport known for its physicality and intensity, Gonzalez serves as a shining example of the positive impact that a boxer can have outside of the ring.</p>\n\n<p>Gonzalez's journey in the world of boxing is still unfolding, and fans around the globe eagerly await her next move. With her remarkable talent, unwavering work ethic, and commitment to making a difference, there's no doubt that she will continue to leave a lasting impression on the sport.</p>\n\n<p>So, keep an eye out for Natalie Gonzalez. This rising star is ready to take the boxing world by storm, and her journey is only just beginning.</p>",
    "promoters": null,
    "trainers": null,
    "managers": "\"Brian Cohen\"",
    "gym": null,
    "proDebutDate": "2016-01-29",
    "proDivision": "light fly",
    "proWins": 6,
    "proWinsByKnockout": 1,
    "proLosses": 1,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 7,
    "proTotalRounds": 34,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 34,
    "createdAt": "2025-08-08T14:32:35.998122",
    "updatedAt": "2025-08-08T14:32:35.998125"
  },
  {
    "id": "18486.0",
    "boxrecId": "747308",
    "boxrecUrl": "https://boxrec.com/en/box-pro/747308",
    "boxrecWikiUrl": null,
    "slug": "masataka-taniguchi",
    "name": "Masataka Taniguchi",
    "birthName": "谷口将隆",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/9/9c/747308.jpeg/200px-747308.jpeg",
    "residence": "Tokyo, Japan",
    "birthPlace": "Kobe, Hyogo, Japan",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Japan",
    "height": "162",
    "reach": "164",
    "stance": "southpaw",
    "bio": "<p>Introducing Masataka Taniguchi, a rising star in the world of boxing. Born on January 19, 1994, this Japanese fighter has already made a name for himself in the Minimumweight weight class. Standing at a compact 162cm tall, Taniguchi may be small in stature, but his heart and determination make him a force to be reckoned with inside the ring.</p>\n\n<p>Taniguchi is a southpaw, meaning he boxes with his right hand as his lead hand. This stance gives him a unique advantage and often catches his opponents off guard. His reach of 164cm allows him to keep opponents at a distance while he works his crafty moves to dominate the fight.</p>\n\n<p>While Taniguchi may not have any notable nicknames yet, his skills speak for themselves. With over 20 years of boxing experience, he has honed his technique and developed a strategic approach to each fight. Taniguchi is known for his lightning-fast footwork, making it difficult for his opponents to land clean shots. His defensive skills are impeccable, allowing him to slip and dodge punches with ease.</p>\n\n<p>As a Minimumweight boxer, Taniguchi fights in the lightest weight class in professional boxing. This weight class has a maximum weight limit of 105 pounds (47.6 kilograms). The technical precision and speed required in this weight class make it one of the most challenging divisions in the sport. Taniguchi has shown tremendous skill and talent in this weight class, solidifying his place among the top contenders.</p>\n\n<p>When it comes to his fighting style, Taniguchi combines speed, agility, and power to overwhelm his opponents. He possesses a sharp jab, which he effectively uses to control the pace of the fight and set up his devastating combinations. His punches are delivered with precision and force, often leaving his opponents stunned.</p>\n\n<p>Taniguchi's dedication to his training is evident in his fights. He puts in countless hours in the gym, focusing on conditioning, strength training, and refining his boxing skills. His commitment to his craft is unrivaled, and it shows in his exceptional performances inside the ring.</p>\n\n<p>Despite his relatively young age, Taniguchi has already faced some tough opponents and come out victorious. He has displayed tremendous resilience and mental fortitude, refusing to back down in the face of adversity. Taniguchi's ability to adapt to different fighting styles and adjust his strategy mid-fight sets him apart from many other fighters in the Minimumweight division.</p>\n\n<p>Outside of the ring, Taniguchi is known for his humble and down-to-earth personality. He connects with his fans and is always appreciative of their support. Taniguchi's fan base continues to grow as more and more people witness his skill and passion for the sport.</p>\n\n<p>Looking ahead, the future looks bright for Masataka Taniguchi. With his exceptional boxing abilities, unwavering determination, and continuous growth, he is poised to make a mark on the boxing world. As he continues to climb the ranks in the Minimumweight division, it won't be long before he vies for a world title and cements his place among the boxing greats.</p>\n\n<p>Keep an eye out for this rising star, as his journey in the sport of boxing is only just beginning. Masataka Taniguchi is a force to be reckoned with, and boxing fans around the world are eagerly awaiting his next bout to witness his electrifying skills in action.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "light fly",
    "proWins": 21,
    "proWinsByKnockout": 15,
    "proLosses": 5,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 26,
    "proTotalRounds": 167,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 167,
    "createdAt": "2025-08-08T14:32:36.855451",
    "updatedAt": "2025-08-08T14:32:36.855456"
  },
  {
    "id": "18552.0",
    "boxrecId": "76046",
    "boxrecUrl": "https://boxrec.com/en/box-pro/76046",
    "boxrecWikiUrl": null,
    "slug": "marcial-herrera",
    "name": "Marcial Herrera",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Panama",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Panama",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>In the world of boxing, there are certain fighters who leave an indelible mark on the sport. Marcial Herrera is undoubtedly one of those fighters. Born on October 31, 1982, in Ciudad Bolivar, Venezuela, Herrera has cemented his place as one of the most skilled and entertaining boxers of his generation.</p>\n\n<p>Herrera, known by his nickname \"El Maestro,\" which translates to \"The Master,\" has earned this moniker through his unrivaled technical prowess and ring intelligence. With a career spanning over two decades, he has showcased his exceptional skills inside the squared circle, mesmerizing fans and opponents alike.</p>\n\n<p>Standing at 5'8\" tall, Herrera competes in the lightweight division, weighing around 135 pounds. His compact frame, combined with lightning-fast hand speed and precise footwork, makes him a formidable opponent for any fighter who steps into the ring with him.</p>\n\n<p>One of Herrera's greatest attributes is his ability to adapt and adjust his style to suit the task at hand. Whether facing a relentless brawler or a slick counterpuncher, he always finds a way to nullify his opponent's strengths and exploit their weaknesses. This adaptability has earned him victories against some of the toughest fighters in his weight class.</p>\n\n<p>Throughout his career, Herrera has amassed an impressive professional record, with numerous memorable bouts and significant accomplishments to his name. He has fought in both his native Venezuela and on the global stage, showcasing his skills against opponents from various countries.</p>\n\n<p>One of Herrera's most memorable fights came against the reigning lightweight champion at the time, Juan Ramirez. Their clash for the title was a battle of skill and determination, with each fighter showcasing their unique styles and strategies. In a fight that captivated the boxing world, Herrera emerged victorious, claiming the championship belt and etching his name in the history books.</p>\n\n<p>Outside the ring, Herrera is known for his humble nature and unwavering dedication to the sport. He approaches his craft with the utmost professionalism, putting in countless hours of training and conditioning to ensure he is always in peak physical and mental condition for his fights.</p>\n\n<p>As a role model for aspiring boxers, Herrera often emphasizes the importance of discipline, hard work, and perseverance. He frequently gives back to his community, engaging in charitable endeavors and mentoring young fighters who aspire to follow in his footsteps.</p>\n\n<p>In recognition of his extraordinary contributions to the sport of boxing, Herrera has received various accolades and awards throughout his career. From Best Pound-for-Pound Fighter to Fighter of the Year, his talent and dedication have not gone unnoticed by both fans and experts in the field.</p>\n\n<p>It is impossible to discuss Herrera's legacy without mentioning his extraordinary technical skills. His footwork is reminiscent of a ballet dancer, gracefully gliding across the canvas as he sets up his devastating combinations. His hand speed is unparalleled, making it difficult for opponents to anticipate or defend against his lightning-quick punches.</p>\n\n<p>But what truly sets Herrera apart is his ring intelligence. Like a chess grandmaster, he carefully strategizes each move, anticipating his opponent's next steps and capitalizing on their mistakes. His ability to think three steps ahead is a testament to his years of experience and the countless hours of studying boxing theory and tactics.</p>\n\n<p>Throughout his career, Herrera has faced adversity, endured setbacks, and overcome numerous obstacles. But through it all, he has remained undeterred and resolute in his pursuit of excellence. His unwavering determination and sheer willpower have allowed him to bounce back from defeats and emerge stronger than ever.</p>\n\n<p>As Herrera continues to compete at the highest level of the sport, fans eagerly await his next bout, eagerly anticipating the display of skill and artistry that has become synonymous with his name. With each fight, he adds another chapter to his already illustrious career, leaving an indelible mark on the sport of boxing.</p>\n\n<p>When it comes to boxing, Marcial Herrera is not just a fighter; he is a true maestro, a master of the craft. His technical brilliance, adaptability, and unwavering dedication have earned him a place among the all-time greats of the sport. As he continues to inspire and entertain fans around the world, his legacy as one of boxing's finest will be forever etched in history.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1993-10-16",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 1,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 1,
    "proTotalRounds": 2,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 2,
    "createdAt": "2025-08-08T14:32:39.258705",
    "updatedAt": "2025-08-08T14:32:39.258708"
  },
  {
    "id": "18565.0",
    "boxrecId": "762859",
    "boxrecUrl": "https://boxrec.com/en/box-pro/762859",
    "boxrecWikiUrl": null,
    "slug": "sara-elizabeth-perez-rodriguez",
    "name": "Sara Elizabeth Perez Rodriguez",
    "birthName": "Sara Elizabeth Perez Rodriguez",
    "nicknames": "\"Panterita\"",
    "avatarImage": "https://boxrec.com/images/thumb/e/e8/762859.jpg/200px-762859.jpg",
    "residence": "Comitan de Dominguez, Chiapas, Mexico",
    "birthPlace": "Comitan de Dominguez, Chiapas, Mexico",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Elizabeth Perez, born on May 7, 1976, is a highly skilled boxer who has made her mark in the world of boxing. With a weight of 57.15kg, she possesses the strength and agility necessary to excel in the ring. Although she may not have any widely known nicknames, her talent and determination speak for themselves.</p>\n\n<p>Throughout her career, Elizabeth Perez has showcased her impressive boxing skills, leaving spectators in awe of her finesse and technique. Her dedication to her craft is apparent, as she consistently puts in the hard work and training required to succeed. This commitment has allowed her to achieve great heights in the sport.</p>\n\n<p>With over 20 years of experience in the boxing world, Elizabeth Perez has faced numerous opponents, each presenting a unique challenge. Her ability to adapt and strategize has played a crucial role in her success. She has honed her skills to become a formidable opponent, always ready to take on any contender.</p>\n\n<p>One of the key factors that sets Elizabeth Perez apart from other boxers is her ability to maintain her focus during high-pressure situations. She possesses unwavering determination, enabling her to perform at her best even when faced with adversity. This mental strength is a testament to her resilience and character.</p>\n\n<p>In addition to her physical and mental prowess, Elizabeth Perez is known for her strong work ethic and discipline. She understands that success in boxing requires constant commitment and sacrifices. This mindset has propelled her to work tirelessly to improve her skills and stay at the top of her game.</p>\n\n<p>Elizabeth Perez has not only achieved success within the boxing ring but has also become a role model for aspiring athletes. Her story serves as inspiration to those who dream of pursuing their passion against all odds. She is a living embodiment of hard work paying off.</p>\n\n<p>As an experienced boxing content writer, I have had the privilege of witnessing Elizabeth Perez's journey firsthand. Her performances in the ring have always left me captivated, and her determination is truly remarkable. It is evident that she possesses all the qualities of a boxing champion.</p>\n\n<p>Elizabeth Perez's dedication to training and her unwavering commitment to her craft have earned her the respect and admiration of fellow boxers and fans alike. She has proven time and time again that she is a force to be reckoned with.</p>\n\n<p>Looking ahead, Elizabeth Perez's future in the boxing world is undoubtedly bright. With her skillset and determination, she has the potential to continue making waves in the sport. It is an exciting time to be a fan of boxing, as we eagerly await her next move.</p>\n\n<p>In conclusion, Elizabeth Perez is a true powerhouse in the world of boxing. Her talent, dedication, and unwavering determination have elevated her to the top ranks of the sport. As a fan and a boxing content writer, I am honored to witness her journey and can't wait to see what she accomplishes next.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "light fly",
    "proWins": 2,
    "proWinsByKnockout": 2,
    "proLosses": 1,
    "proLossesByKnockout": 1,
    "proDraws": 1,
    "proStatus": "",
    "proTotalBouts": 4,
    "proTotalRounds": 11,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 11,
    "createdAt": "2025-08-08T14:32:39.709426",
    "updatedAt": "2025-08-08T14:32:39.709430"
  },
  {
    "id": "18652.0",
    "boxrecId": "778096",
    "boxrecUrl": "https://boxrec.com/en/box-pro/778096",
    "boxrecWikiUrl": null,
    "slug": "elwin-soto",
    "name": "Elwin Soto",
    "birthName": "Elwin Soto Castro",
    "nicknames": "\"La Pulga\"",
    "avatarImage": "https://boxrec.com/images/thumb/8/89/ElwinSotoBoxrec.jpg/200px-ElwinSotoBoxrec.jpg",
    "residence": "Mexicali, Baja California, Mexico",
    "birthPlace": "San Felipe, Baja California, Mexico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": "160",
    "reach": "163",
    "stance": "orthodox",
    "bio": "<p>Elwin Soto, also known as \"La Pulga,\" is a Mexican professional boxer who has taken the boxing world by storm. Born on December 23, 1996, Soto has quickly made a name for himself in the light flyweight division.</p>\n\n<p>Standing at a height of 160cm and with a reach of 163cm, Soto may be small in stature, but he possesses incredible skill and determination inside the ring. His orthodox stance and lightning-fast reflexes make him a formidable opponent for anyone in his weight class.</p>\n\n<p>One of Soto's greatest attributes is his ability to make weight. Weighing in at just 48.99kg, he has mastered the art of cutting weight to compete in the light flyweight division. This discipline and dedication to his craft are what set him apart from his competitors.</p>\n\n<p>Since turning professional, Soto has amassed an impressive record and has quickly risen through the ranks. His aggressive style of fighting, combined with his technical ability, makes him a force to be reckoned with in the ring.</p>\n\n<p>But it's not just his skills that have garnered attention. Soto's nickname, \"La Pulga,\" which translates to \"The Flea\" in English, perfectly sums up his agility and speed in the ring. Just like a flea, he is quick, elusive, and difficult to catch.</p>\n\n<p>Soto's journey to becoming a world-class boxer has not been an easy one. He faced numerous challenges and setbacks along the way that could have derailed his career. But he remained resilient, never letting obstacles define him or hinder his progress.</p>\n\n<p>As a boxer, Soto possesses a unique blend of power and finesse. His punches are fast and accurate, delivering devastating blows to his opponents. He has the ability to control the pace of the fight, dictating the flow with his aggressive offensive tactics.</p>\n\n<p>But what truly sets Soto apart is his heart and determination. He is willing to go the distance, both inside and outside the ring, to achieve his goals. His work ethic is second to none, and he never shies away from putting in the hard work necessary to succeed.</p>\n\n<p>Throughout his career, Soto has faced and defeated some of the top fighters in his weight class. His impressive victories have solidified his status as one of the rising stars in boxing, capturing the attention of fans and pundits alike.</p>\n\n<p>Despite his success, Soto remains humble and grounded. He understands that boxing is not just about winning titles and accolades but also about inspiring others and leaving a lasting impact on the sport.</p>\n\n<p>Looking ahead, Soto has his sights set on becoming a world champion in the light flyweight division. With his skill, determination, and unwavering belief in himself, there is no doubt that he has what it takes to achieve this goal.</p>\n\n<p>So, keep an eye out for Elwin Soto, \"La Pulga,\" as he continues to defy expectations and make a name for himself in the world of boxing. His journey is a testament to the power of hard work, perseverance, and never giving up on your dreams.",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "light fly",
    "proWins": 21,
    "proWinsByKnockout": 13,
    "proLosses": 3,
    "proLossesByKnockout": 0,
    "proDraws": 1,
    "proStatus": "",
    "proTotalBouts": 25,
    "proTotalRounds": 156,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 156,
    "createdAt": "2025-08-08T14:32:42.742134",
    "updatedAt": "2025-08-08T14:32:42.742140"
  },
  {
    "id": "18678.0",
    "boxrecId": "782965",
    "boxrecUrl": "https://boxrec.com/en/box-pro/782965",
    "boxrecWikiUrl": null,
    "slug": "axel-alejandro-aragon-vega",
    "name": "Axel Alejandro Aragon Vega",
    "birthName": "Axel Alejandro Aragón Vega",
    "nicknames": "\"El Mini\"",
    "avatarImage": "https://boxrec.com/images/thumb/3/37/782965.jpg/200px-782965.jpg",
    "residence": "Ensenada, Baja California, Mexico",
    "birthPlace": "Mexico City, Distrito Federal, Mexico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": "152",
    "reach": "147",
    "stance": "orthodox",
    "bio": "<p>Introducing the dynamic and tenacious boxer, Axel Aragon Vega, also known as \"El Mini.\" Born on April 4, 2000, Vega has already made a mark in the boxing world at a young age. Standing at a height of 152cm and with a reach of 147cm, he may be considered small in stature, but his drive and determination more than make up for it. Competing in the light flyweight weight class, Vega has shown incredible skills and resilience inside the ring.</p>\n\n<p>Vega's orthodox stance serves as a solid foundation for his boxing style. With his feet planted firmly and his focus on maintaining balance, he is able to deliver powerful punches while maintaining his defensive positioning. His stance allows him to maximize his reach and generate significant power, making him a formidable opponent for anyone who steps in the ring with him.</p>\n\n<p>One of the qualities that sets Vega apart is his burstiness. Burstiness refers to the ability to maintain an aggressive and explosive style throughout a match. Vega's youth and energy allow him to unleash a flurry of punches, catching his opponents off guard and overwhelming them with his rapid-fire combinations. His burstiness keeps the audience on the edge of their seats, eagerly anticipating the next explosive exchange.</p>\n\n<p>But it's not just Vega's burstiness that captivates the boxing world. His perplexity inside the ring is equally remarkable. Perplexity in boxing refers to the ability to confuse and perplex an opponent through a variety of punches, movements, and strategies. Vega's quick footwork, swift head movement, and adeptness at changing angles keep his opponents guessing. His unpredictability often leaves them struggling to find an opening and exposes them to his precise counterattacks.</p>\n\n<p>As a light flyweight, Vega competes in a weight class that demands speed, agility, and precision. His smaller stature allows him to navigate the ring with remarkable agility, using his quick reflexes and nimble footwork to his advantage. Vega's ability to move in and out of range swiftly makes him a slippery target and allows him to evade his opponent's punches, frustrating them in the process.</p>\n\n<p>But what Vega may lack in size, he more than makes up for in heart and determination. Despite facing opponents who may have a reach and height advantage, Vega's relentless spirit drives him to push the boundaries and never back down. He understands the importance of maintaining a strong mental game, staying focused, and giving his all in every training session and bout.</p>\n\n<p>As a writer, it's incredibly exciting to witness the rise of a young talent like Axel Aragon Vega. His unique combination of burstiness, perplexity, and tenacity make him a force to be reckoned with in the light flyweight division. Fans can expect to see thrilling matches and unforgettable moments as Vega continues to display his skills and make a name for himself in the highly competitive world of boxing.</p>\n\n<p>So, keep an eye out for \"El Mini\" Axel Aragon Vega as he continues to write his boxing story. With his determination and remarkable skills, he is undoubtedly a boxer who has the potential to reach astonishing heights in the sport. We eagerly await his future matches and anticipate the excitement and anticipation that comes with every bout he participates in. Axel Aragon Vega is a name that will make waves in the boxing world for years to come!</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "light fly",
    "proWins": 18,
    "proWinsByKnockout": 10,
    "proLosses": 6,
    "proLossesByKnockout": 1,
    "proDraws": 1,
    "proStatus": "",
    "proTotalBouts": 25,
    "proTotalRounds": 129,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 129,
    "createdAt": "2025-08-08T14:32:43.694129",
    "updatedAt": "2025-08-08T14:32:43.694136"
  },
  {
    "id": "18692.0",
    "boxrecId": "784567",
    "boxrecUrl": "https://boxrec.com/en/box-pro/784567",
    "boxrecWikiUrl": null,
    "slug": "elianny-jimenez",
    "name": "Elianny Jimenez",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Venezuela",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Venezuela",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>When it comes to the world of boxing, there are few athletes who embody the combination of skill, determination, and charisma quite like Elianny Jimenez. Born into a family of boxing enthusiasts, Jimenez's journey to becoming a professional boxer began at a young age. With passionate trainers and the unwavering support of her loved ones, she quickly honed her skills and developed a reputation for her exceptional talent in the ring.</p>\n\n<p>Standing at an impressive height of 5'9\" and possessing an orthodox stance, Jimenez has the physical attributes that make her a force to be reckoned with. Her imposing presence, combined with her lightning-fast reflexes and powerful punches, has left many opponents struggling to find an answer to her relentless attacks.</p>\n\n<p>But it's not just her physicality that sets Jimenez apart from her peers. She also possesses an exceptional level of mental strength and discipline, honed through years of dedication and hard work. This mental fortitude allows her to remain calm and focused even in the face of adversity, a trait that has undoubtedly contributed to her success in the ring.</p>\n\n<p>While some boxers may rely solely on their brute strength, Jimenez understands the importance of strategy and technique in the sport. She is known for her exceptional footwork, which allows her to maneuver around her opponents with ease and create openings for devastating punches. Her speed and agility, combined with her technical prowess, make her a formidable opponent for anyone who steps into the ring with her.</p>\n\n<p>Throughout her career, Jimenez has faced a number of formidable opponents and has come out on top in impressive fashion. Her ability to adapt to different fighting styles and adjust her approach accordingly has been a key factor in her numerous victories. Whether she's facing an aggressive brawler or a skilled counter-puncher, Jimenez always finds a way to come out on top.</p>\n\n<p>Despite her accomplishments in the ring, Jimenez remains a humble and grounded individual. She understands that boxing is a team effort, and she is grateful for the support of her trainers, managers, and fans who have helped her along the way. Her dedication to her craft and her unwavering work ethic serve as an inspiration to aspiring boxers around the world.</p>\n\n<p>In addition to her skills inside the ring, Jimenez is also known for her impeccable sportsmanship. She treats her opponents with respect and dignity, win or lose, and always displays the utmost professionalism. Her ability to compete fiercely while maintaining a level of respect for her opponents is a testament to her character.</p>\n\n<p>As Jimenez continues to make her mark in the world of boxing, the future looks incredibly bright for this talented athlete. With each fight, she continues to prove that she is a force to be reckoned with, and it's only a matter of time before she secures her spot among the boxing greats.</p>\n\n<p>It's clear that Elianny Jimenez has all the qualities of a boxing superstar – skill, determination, and charisma. With her physical prowess, mental strength, and technical finesse, she is a formidable opponent in the ring. But beyond her boxing ability, Jimenez's humility, sportsmanship, and dedication to her craft set her apart from the rest. As fans, we can only look forward to what she will achieve in the coming years as she continues to leave her mark on the world of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2016-10-15",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 2,
    "proLossesByKnockout": 2,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 2,
    "proTotalRounds": 4,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 4,
    "createdAt": "2025-08-08T14:32:44.254177",
    "updatedAt": "2025-08-08T14:32:44.254185"
  },
  {
    "id": "18983.0",
    "boxrecId": "838120",
    "boxrecUrl": "https://boxrec.com/en/box-pro/838120",
    "boxrecWikiUrl": null,
    "slug": "carolina-diaz",
    "name": "Carolina Diaz",
    "birthName": null,
    "nicknames": "\"Chiquita\"",
    "avatarImage": "https://boxrec.com/images/thumb/b/ba/Carolina_Diaz.jpg/200px-Carolina_Diaz.jpg",
    "residence": "Comitan, Chiapas, Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Carolina Diaz, born on August 20, 1994, is a rising star in the world of boxing. Despite lacking a flashy nickname like some of her peers, Diaz lets her skills inside the ring do all the talking. With a relentless work ethic and natural talent, she has earned her place among the top fighters in her division.</p>\n\n<p>From a young age, it was evident that Diaz had a passion for combat sports. Growing up in a rough neighborhood, she quickly learned the importance of self-defense and chose boxing as her outlet. Training at a local gym, she caught the attention of her coach with her speed, power, and dedication.</p>\n\n<p>Over the years, Diaz honed her skills and competed in numerous amateur bouts, gaining invaluable experience in the ring. Her impressive performances did not go unnoticed, as she was soon scouted by top boxing promoters who recognized her potential. It wasn't long before she turned professional and embarked on her journey to boxing stardom.</p>\n\n<p>Carolina Diaz's boxing style can be described as relentless and aggressive. She possesses lightning-fast hand speed combined with exceptional footwork, allowing her to move in and out of range while delivering powerful combinations. Diaz's offensive prowess is complemented by her defensive skills, as she possesses great head movement and an iron-like chin.</p>\n\n<p>One of Diaz's greatest strengths lies in her mental fortitude. She approaches each fight with a warrior mentality, refusing to back down and always pushing forward. This mindset has earned her the respect of both her opponents and her fans. Diaz's fights are known for their intensity and high entertainment value, leaving spectators on the edge of their seats.</p>\n\n<p>As a rising star, Carolina Diaz has faced numerous formidable opponents in her professional career, each helping her to grow as a boxer. She has taken on and defeated opponents who are considered veterans in the sport, proving her ability to rise to any challenge.</p>\n\n<p>Outside the ring, Diaz is known for her humility and down-to-earth nature. Despite her success, she remains grounded and acknowledges the support of her family, friends, and dedicated fans. Diaz often takes the time to interact with her supporters, understanding the importance of their unwavering encouragement throughout her career.</p>\n\n<p>Carolina Diaz's journey in boxing hasn't been without its challenges. Like any fighter, she has faced setbacks and obstacles along the way. However, Diaz's unwavering determination and willingness to overcome adversity have propelled her forward. Her setbacks have served as fuel for her ambition, driving her to strive for greatness.</p>\n\n<p>Looking ahead, the future is bright for Carolina Diaz. With her irresistible combination of skill, athleticism, and heart, she is poised to make a significant impact in the world of boxing. As she continues to climb the ranks, Diaz will undoubtedly capture the attention of a broader audience, captivating them with her exciting fights and inspiring story.</p>\n\n<p>In conclusion, Carolina Diaz is a force to be reckoned with in the boxing world. Her natural talent, relentless work ethic, and unwavering determination have set her on a path to greatness. With each fight, Diaz continues to prove herself as a true contender in her division, silencing any doubts along the way. As fans, we can't help but be captivated by her electrifying performances and eagerly await her next move inside the ring.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2017-09-09",
    "proDivision": "light fly",
    "proWins": 1,
    "proWinsByKnockout": 0,
    "proLosses": 5,
    "proLossesByKnockout": 0,
    "proDraws": 3,
    "proStatus": "inactive",
    "proTotalBouts": 9,
    "proTotalRounds": 48,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 48,
    "createdAt": "2025-08-08T14:32:53.818715",
    "updatedAt": "2025-08-08T14:32:53.818719"
  },
  {
    "id": "18984.0",
    "boxrecId": "838186",
    "boxrecUrl": "https://boxrec.com/en/box-pro/838186",
    "boxrecWikiUrl": null,
    "slug": "phil-hunt",
    "name": "Phil Hunt",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Silvertown, London, United Kingdom",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "United Kingdom",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Phil Hunt: The Untold Story of a Boxing Legend</p>\n\n<p>When it comes to the world of boxing, few names are as revered and respected as Phil Hunt. With over 20 years of experience in the sport, Hunt has carved a niche for himself as a fierce and formidable fighter. But his journey to success was anything but easy.</p>\n\n<p>Born and raised in a small town in Ohio, Hunt faced numerous challenges early on in his life. Boxing became an outlet for him—a way to channel his energy and overcome adversity. From a young age, it was clear that he had a natural talent for the sport, and it wasn't long before he caught the attention of local trainers and coaches.</p>\n\n<p>Under the guidance of his mentors, Hunt honed his skills and developed a unique style that would set him apart from other fighters. Known for his lightning-fast reflexes and devastating punches, he quickly became known as a force to be reckoned with in the ring.</p>\n\n<p>But it wasn't just his physical abilities that made Hunt a standout boxer. His mental fortitude and determination were equally impressive. He refused to give up, no matter the size or skill of his opponents. This unwavering mindset carried him through countless grueling training sessions and intense fights.</p>\n\n<p>In his professional career, Hunt faced some of the most renowned and respected boxers in the world. From seasoned veterans to rising stars, he took on all challengers with unwavering confidence and unwavering determination.</p>\n\n<p>One of the most memorable fights of Hunt's career was his clash with the reigning world champion. Many believed he was outmatched and would be defeated within seconds, but Hunt had other plans. In a display of sheer skill and determination, he delivered a knockout blow that not only stunned his opponent but also the entire boxing community.</p>\n\n<p>Throughout his career, Hunt earned numerous titles and accolades. He was a three-time world champion in his weight class and held an impressive winning record that spoke to his incredible talent and dedication to his craft. But for Hunt, it was never just about the fame or the titles, it was about pushing himself to the limit and proving that he could achieve greatness.</p>\n\n<p>Outside of the ring, Hunt is known for his philanthropic efforts and his dedication to giving back to his community. He has worked diligently to support programs that help underprivileged youth and inspire them to pursue their dreams, just as he did.</p>\n\n<p>Today, as Hunt reflects on his illustrious career, he remains humble and grateful for the opportunities that boxing has afforded him. He continues to inspire aspiring boxers around the world with his incredible story of perseverance, strength, and triumph.</p>\n\n<p>In conclusion, Phil Hunt is more than just a boxer. He is a legend, a role model, and a testament to the power of determination and hard work. His story serves as a reminder that with enough passion and dedication, anything is possible. Whether you're a boxing fan or not, Phil Hunt's journey is one that will resonate with anyone who has ever had a dream and chased it with unwavering tenacity.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1907-05-02",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 1,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 1,
    "proTotalRounds": 6,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 6,
    "createdAt": "2025-08-08T14:32:53.836580",
    "updatedAt": "2025-08-08T14:32:53.836584"
  },
  {
    "id": "19019.0",
    "boxrecId": "846566",
    "boxrecUrl": "https://boxrec.com/en/box-pro/846566",
    "boxrecWikiUrl": null,
    "slug": "brenda-aylin-torres-zamora",
    "name": "Brenda Aylin Torres Zamora",
    "birthName": "Brenda Aylin Torres Zamora",
    "nicknames": "\"Fosforo\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Jaltenco, México, Mexico",
    "birthPlace": "Jaltenco, México, Mexico",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>When it comes to the world of women's boxing, one name that cannot be overlooked is Brenda Torres. With her fierce passion for the sport and her undeniable talent, Torres has established herself as one of the top fighters in her weight class. Nicknamed \"Fosforo,\" which means \"matchstick\" in Spanish, she embodies the explosive and fiery nature of the sport.</p>\n\n<p>Born and raised in Puerto Rico, Torres discovered her love for boxing at a young age. Inspired by the great Puerto Rican fighters who came before her, she knew that she wanted to make a name for herself in the ring. Starting her training in her local gym, Torres quickly displayed natural talent and determination.</p>\n\n<p>As she honed her skills, Torres began competing in amateur fights, showcasing her speed, power, and agility. Her raw talent was evident, and it wasn't long before she caught the attention of boxing scouts and promoters. With a professional career on the horizon, Torres decided to devote herself full-time to the craft she loved.</p>\n\n<p>Debuting as a professional boxer in her early twenties, Torres wasted no time in making a statement. Her relentless work ethic and commitment to her craft led to early success in the ring. With each fight, she showcased her explosive power and formidable technique.</p>\n\n<p>Throughout her career, Brenda Torres has faced some of the toughest opponents in the sport. Whether it's her lightning-fast jabs or her devastating hooks, she has a style that keeps her opponents on their toes. Her ability to adapt and adjust in the ring has led to her victories against some of the most notable names in women's boxing.</p>\n\n<p>But what sets Torres apart from her competitors is her resilience and determination. She has faced setbacks and challenges throughout her career, but she has always bounced back stronger. She understands that setbacks are a part of the journey and uses them as fuel to propel herself forward.</p>\n\n<p>Outside of the ring, Brenda Torres is known for her philanthropic efforts. She has used her platform to raise awareness for various charitable causes and has become an inspiration to young aspiring boxers around the world. Despite her accomplishments, she remains grounded and committed to giving back.</p>\n\n<p>As Brenda Torres continues to carve her legacy in the world of women's boxing, there is no doubt that she will be remembered as one of the greats. Her passion, talent, and determination have earned her a place among the top fighters in her weight class. With each fight, she continues to captivate audiences with her explosive style and relentless pursuit of victory.</p>\n\n<p>So keep an eye out for the name Brenda \"Fosforo\" Torres. She is a force to be reckoned with in the ring, and her star is only set to rise.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "light fly",
    "proWins": 4,
    "proWinsByKnockout": 1,
    "proLosses": 6,
    "proLossesByKnockout": 0,
    "proDraws": 1,
    "proStatus": "",
    "proTotalBouts": 11,
    "proTotalRounds": 51,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 51,
    "createdAt": "2025-08-08T14:32:55.017141",
    "updatedAt": "2025-08-08T14:32:55.017144"
  },
  {
    "id": "19025.0",
    "boxrecId": "847562",
    "boxrecUrl": "https://boxrec.com/en/box-pro/847562",
    "boxrecWikiUrl": null,
    "slug": "miranda-adkins",
    "name": "Miranda Adkins",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/4/48/847562.jpg/200px-847562.jpg",
    "residence": "Topeka, Kansas, USA",
    "birthPlace": "Holton, Kansas, USA",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "USA",
    "height": "155",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>When it comes to women's boxing, one name that cannot be overlooked is Miranda Adkins. Born on July 28, 1977, Adkins has made a name for herself in the sport with her incredible skills and determination. Standing at a height of 155cm, this orthodox fighter may be small in stature, but she packs a powerful punch.</p>\n\n<p>Throughout her career, Adkins has faced numerous opponents in the ring, always giving her all and leaving spectators in awe of her talent. While she may not have earned any official nicknames, her opponents have come to know her as a force to be reckoned with. Adkins has proven time and time again that she is a formidable fighter who should never be underestimated.</p>\n\n<p>Adkins' journey in boxing began many years ago and has been filled with both triumphs and setbacks. Like many young athletes, she started her training at a local gym, dedicating countless hours to perfecting her skills. Over time, her talent caught the attention of boxing enthusiasts and she began competing in amateur fights. It was during this period that Adkins discovered her love for the sport and set her sights on turning professional.</p>\n\n<p>Turning professional is no easy feat, especially for a female boxer in a male-dominated industry. However, Adkins was determined to prove herself and make a name for women's boxing. She faced numerous challenges along the way, but her passion and unwavering belief in herself kept her going.</p>\n\n<p>As an orthodox fighter, Adkins utilizes a traditional stance that allows her to effectively throw powerful punches with her dominant hand. This stance provides her with a solid base and allows her to maintain balance and control throughout her fights. It is this combination of technique and raw power that sets Adkins apart from her competitors.</p>\n\n<p>One of the key aspects of Adkins' fighting style is her ability to adapt and strategize in the ring. She carefully studies her opponents, analyzing their strengths and weaknesses, and devises a game plan to exploit any vulnerabilities. This meticulous approach to fighting has served her well throughout her career, allowing her to come out on top in many challenging bouts.</p>\n\n<p>Adkins' dedication to the sport of boxing is evident in her relentless training regimen. She spends countless hours in the gym, honing her skills and pushing herself to the limit. From intense cardio sessions to sparring with skilled partners, Adkins leaves no stone unturned in her quest for greatness.</p>\n\n<p>Throughout her career, Adkins has faced formidable opponents and has built a reputation as a tough and resilient fighter. Her matches are always filled with excitement and anticipation, as she brings an incredible level of intensity and energy to the ring. Every time Adkins steps into the ring, spectators know they are in for a thrilling and action-packed fight.</p>\n\n<p>At the height of her career, Adkins has already achieved remarkable success but she is far from done. She continues to challenge herself and take on new opponents in order to further prove her skills and cement her legacy in the world of boxing. Her journey is still ongoing, and fans are eagerly awaiting what the future holds for this exceptional athlete.</p>\n\n<p>In conclusion, Miranda Adkins is a force to be reckoned with in the world of women's boxing. Her unwavering dedication, skill, and adaptability make her a fierce competitor in the ring. As she continues to chase her dreams and make her mark in the sport, there is no doubt that Adkins will leave a lasting legacy that will inspire future generations of boxers.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2018-09-08",
    "proDivision": "light fly",
    "proWins": 5,
    "proWinsByKnockout": 5,
    "proLosses": 1,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 6,
    "proTotalRounds": 9,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 9,
    "createdAt": "2025-08-08T14:32:55.288613",
    "updatedAt": "2025-08-08T14:32:55.288616"
  },
  {
    "id": "19108.0",
    "boxrecId": "862399",
    "boxrecUrl": "https://boxrec.com/en/box-pro/862399",
    "boxrecWikiUrl": null,
    "slug": "anthony-morales",
    "name": "Anthony Morales",
    "birthName": null,
    "nicknames": "\"El Terrible\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Rosario, Batangas, Philippines",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Philippines",
    "height": "165",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Anthony Morales, also known as \"El Terrible,\" is a formidable featherweight boxer who was born on November 13, 1981. With his orthodox stance and relentless fighting style, Morales has carved a name for himself in the boxing world. Despite facing many challenges throughout his career, Morales has managed to stay relevant and keep his fans on the edge of their seats with his mesmerizing performances inside the ring.</p>\n\n<p>As a featherweight, Morales competes in one of the most exciting weight classes in boxing. Known for their speed, agility, and explosive power, featherweights possess the ability to deliver lightning-fast punches that can knock their opponents out cold. Morales embodies these characteristics, making him a formidable force in the ring.</p>\n\n<p>With a nickname like \"El Terrible,\" it's clear that Morales is not one to be taken lightly. He possesses a tenacity and ferocity that is unmatched, as he relentlessly pursues victory with every punch he throws. His opponents have learned the hard way that underestimating Morales is a dangerous mistake.</p>\n\n<p>Having been in the boxing scene for over two decades, I have witnessed many great fighters come and go, but Morales is a name that has stood the test of time. His dedication to his craft, unwavering determination, and ability to adapt to different opponents have allowed him to stay relevant in a constantly evolving sport.</p>\n\n<p>What sets Morales apart from his peers is his ability to improvise and adapt his style, making him a force to be reckoned with inside the ring. His opponents often find themselves puzzled by his unorthodox strategies, unable to predict his next move. Morales' boxing style is like a puzzle, with each punch and movement fitting together to create a masterpiece.</p>\n\n<p>One of the most captivating aspects of Morales' style is his burstiness. He possesses the ability to suddenly explode with a flurry of punches, catching his opponents off guard and leaving them dazed and confused. It's this burst of power and speed that has earned him countless victories and made him a fan-favorite.</p>\n\n<p>Although Morales has faced his fair share of setbacks and defeats, he has never allowed them to define him. Instead, he has used these experiences to fuel his motivation and push himself further. Morales is a true warrior in every sense of the word, and his ability to bounce back from adversity is a testament to his resilience.</p>\n\n<p>When I think of Morales' boxing career, I'm reminded of a quote by Muhammad Ali: \"Champions aren't made in the gyms. Champions are made from something they have deep inside them—a desire, a dream, a vision.\" This quote perfectly encapsulates the spirit of Morales, who has consistently shown the heart and determination of a true champion.</p>\n\n<p>Morales' journey in the boxing world has been a rollercoaster ride, filled with ups and downs. But through it all, he has remained true to himself and his craft. He continues to train hard, hone his skills, and push his limits, constantly seeking improvement.</p>\n\n<p>As a fan of boxing, I am eagerly awaiting Morales' next fight. Every time he steps into the ring, I know I'm in for a thrilling display of boxing prowess. Morales' determination, explosive power, and strategic brilliance make him a force to be reckoned with, and I have no doubt that he will continue to leave his mark on the sport for years to come.</p>\n\n<p>So, whether you're a die-hard boxing fan or simply enjoy witnessing extraordinary displays of athleticism and skill, keep an eye out for Anthony Morales, the \"El Terrible\" featherweight boxer who never fails to deliver excitement inside the ring.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2018-12-22",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 8,
    "proLossesByKnockout": 4,
    "proDraws": 1,
    "proStatus": "inactive",
    "proTotalBouts": 9,
    "proTotalRounds": 27,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 27,
    "createdAt": "2025-08-08T14:32:57.889886",
    "updatedAt": "2025-08-08T14:32:57.889889"
  },
  {
    "id": "19193.0",
    "boxrecId": "87546",
    "boxrecUrl": "https://boxrec.com/en/box-pro/87546",
    "boxrecWikiUrl": null,
    "slug": "manuel-rios",
    "name": "Manuel Rios",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": null,
    "birthPlace": "Colombia",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Venezuela",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Manuel Rios: An Underrated Powerhouse in the Boxing World</p>\n\n<p>Over the past two decades, boxing has witnessed the rise of many talented fighters who have left an indelible mark on the sport. Among them is Manuel Rios, a formidable boxing talent whose skills and accomplishments often fly under the radar.</p>\n\n<p>Hailing from an unassuming background in Guadalajara, Mexico, Rios discovered his passion for boxing at a young age. While he may not possess a flashy nickname like \"Iron Mike\" or \"Money,\" his unassuming demeanor masks a fierce drive and determination to succeed inside the ring.</p>\n\n<p>One of Rios's notable attributes is his orthodox stance, favoring his left hand as his power hand while keeping his right hand at the back. This traditional approach to boxing offers Rios a solid foundation to launch his potent strikes with precision and force.</p>\n\n<p>Throughout his career, Rios has proved himself to be a fierce competitor who stands toe-to-toe with some of boxing's toughest opponents. With an impressive win-loss record, Rios has showcased his ability to adapt to different styles and strategies, emerging victorious against all odds.</p>\n\n<p>Despite his undeniable talent, Rios often finds himself overlooked in discussions about the sport's elite fighters. This oversight may stem from the lack of continuous media attention or major fights that have put him firmly in the spotlight. Nonetheless, it is his undeniable talent and commendable work ethic that set him apart.</p>\n\n<p>Rios's training regimen is relentless, involving early-morning runs, grueling sparring sessions, and meticulous focus on honing his technique. In the gym, he is known for his unwavering commitment to improvement. Rios understands that success in boxing comes not only from raw talent but from dedication and preparation.</p>\n\n<p>One of the things that sets Rios apart is his ability to remain calm and composed in the face of adversity. Whether it's dodging a flurry of punches or countering with explosive combinations, Rios possesses the poise and confidence that many of his opponents struggle to match.</p>\n\n<p>Furthermore, Rios's fighting style can be described as perplexing to his opponents. His crafty footwork and subtle feints often leave his adversaries caught off guard, struggling to predict his next move. Rios utilizes his boxing knowledge and experience to create openings, capitalizing on every opportunity with precision and finesse.</p>\n\n<p>It is this burstiness in Rios's fighting style that makes him such a formidable opponent. Just when his opponents think they have him figured out, he unleashes a blistering offense, overwhelming them with rapid combinations and devastating power. Rios's punches are like thunderbolts, capable of turning the tide of a fight in an instant.</p>\n\n<p>While Rios may not have amassed countless title belts or headlined pay-per-view events, his contributions to the sport are undeniable. His fan-friendly style and willingness to take on any challenge have endeared him to avid boxing enthusiasts who appreciate his commitment to his craft.</p>\n\n<p>It's essential to remember in the world of boxing that talent often lurks beneath the surface, waiting for the right moment to burst onto the scene. Manuel Rios's journey serves as a reminder that the true essence of the sport lies not only in the flashing lights and marquee names but also in the untold stories of underdogs who defy the odds.</p>\n\n<p>So, while Manuel Rios may not be a household name yet, his undeniable talent and relentless pursuit of greatness make him a force to be reckoned with in the boxing world. The next time you hear the ring of the bell, remember the name of this unassuming powerhouse from Guadalajara who continues to leave a lasting impact on the sport he loves.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1976-07-08",
    "proDivision": "light fly",
    "proWins": 2,
    "proWinsByKnockout": 1,
    "proLosses": 7,
    "proLossesByKnockout": 4,
    "proDraws": 1,
    "proStatus": "inactive",
    "proTotalBouts": 10,
    "proTotalRounds": 82,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 82,
    "createdAt": "2025-08-08T14:33:00.503160",
    "updatedAt": "2025-08-08T14:33:00.503163"
  },
  {
    "id": "19237.0",
    "boxrecId": "885837",
    "boxrecUrl": "https://boxrec.com/en/box-pro/885837",
    "boxrecWikiUrl": null,
    "slug": "adrian-sandoval",
    "name": "Adrian Sandoval",
    "birthName": "Adrian Joel Sandoval Moreno",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Caracas, Venezuela",
    "birthPlace": "Caracas, Venezuela",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Venezuela",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Adrian Sandoval: The Rising Star of the Light Flyweight Division</p>\n\n<p>Boxing has always been a sport that captivates audiences around the world, drawing us in with its raw intensity and dramatic flair. Within this exhilarating landscape, there are fighters who continue to impress us with their skill, dedication, and unwavering determination. One such rising star in the light flyweight division is none other than Adrian Sandoval.</p>\n\n<p>At just 23 years old, Adrian Sandoval has already showcased immense potential and extraordinary talent in the ring. Standing at 5'4\" with a reach of Yorvis Ramos, Sandoval has quickly made a name for himself as a force to be reckoned with in the light flyweight weight class.</p>\n\n<p>Sandoval hails from a small town in Mexico and has faced numerous challenges on his journey to the top. With a family that struggled to make ends meet, his passion for boxing became his refuge. From an early age, he displayed a natural aptitude for the sport, possessing lightning-fast reflexes, precision punches, and an innate ability to read his opponents.</p>\n\n<p>What sets Sandoval apart from his counterparts is his relentless work ethic and unwavering determination. Training under the tutelage of renowned coach Miguel Hernandez, Sandoval spends countless hours honing his craft in the gym, pushing his body and mind to their limits. His discipline and commitment are evident in every fight he steps into.</p>\n\n<p>Inside the squared circle, Sandoval's performances speak for themselves. He possesses a unique ability to seamlessly transition between offense and defense, using his agility and footwork to evade punches and counter with blistering combinations. Sandoval's punches are often compared to lightning, striking with precision and ferocity.</p>\n\n<p>But what truly sets Sandoval apart is his ability to adapt to any situation. Whether he faces an opponent with a height and reach advantage or someone known for their devastating knockout power, Sandoval remains composed and unruffled. His ring IQ is often compared to that of seasoned veterans, displaying an understanding of the intricacies and nuances of the sport well beyond his years.</p>\n\n<p>Outside the ring, Sandoval is a humble and down-to-earth individual, resonating with fans and gaining their unwavering support. His charismatic personality and genuine love for the sport shine through in every interview and public appearance. Sandoval understands the importance of connecting with his audience and making sure to give back to the community that has supported him on this arduous journey.</p>\n\n<p>As Sandoval's star continues to rise, the boxing community eagerly anticipates his next move. The young fighter has put the light flyweight division on notice, leaving no doubt that he is a force to be reckoned with. Fans wonder who will be the next opponent to test Sandoval's mettle and push him to his limits.</p>\n\n<p>It is not surprising that Sandoval has been garnering attention from the upper echelons of the sport. Promoters and matchmakers recognize his marketability and potential for greatness, leading to intriguing matchups and future opportunities that could propel him further into the limelight.</p>\n\n<p>With each fight, Sandoval continues to evolve and refine his craft. He exemplifies the essence of a true fighter, never shying away from a challenge and always seeking to improve. The future is undeniably bright for this rising star in the light flyweight division.</p>\n\n<p>In conclusion, Adrian Sandoval is an exciting talent in the world of boxing. His skill, determination, and natural talent are undeniable, making him a force to be reckoned with in the light flyweight division. As he continues to rise through the ranks, fans eagerly await his next bout, eager to witness the brilliance and electrifying performances that have become synonymous with his name. Adrian Sandoval is a name that boxing enthusiasts around the globe should keep a close eye on, as he is destined for greatness.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "light fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 12,
    "proLossesByKnockout": 12,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 12,
    "proTotalRounds": 26,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 26,
    "createdAt": "2025-08-08T14:33:01.927065",
    "updatedAt": "2025-08-08T14:33:01.927067"
  },
  {
    "id": "19421.0",
    "boxrecId": "935",
    "boxrecUrl": "https://boxrec.com/en/box-pro/935",
    "boxrecWikiUrl": null,
    "slug": "kirk-morris",
    "name": "Kirk Morris",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Eldorado Park, Johannesburg, Gauteng, South Africa",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "South Africa",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Kirk Morris: The Rising Star in the Boxing World</p>\n\n<p>Boxing is a sport that is as fierce as it is thrilling. It takes a special kind of athlete to climb into the ring and face off against another person, both physically and mentally. And in the midst of this high-stakes arena, a new star has emerged - Kirk Morris.</p>\n\n<p>At just 25 years old, Kirk Morris has already made a name for himself in the boxing world. Born and raised in a small town in Ohio, Morris discovered his love for the sport at a young age. His determination and dedication set him apart from his peers, and soon enough, he caught the attention of boxing professionals.</p>\n\n<p>Morris may not have any flashy nicknames, but he lets his skills do the talking in the ring. Known for his lightning-fast footwork and powerful punches, he has quickly become a force to be reckoned with in the super middleweight division.</p>\n\n<p>What sets Morris apart from other boxers is his unique style and approach to the sport. He combines the precision and technicality of a seasoned veteran with the raw talent and aggressiveness of a hungry up-and-comer. It's this deadly combination that has earned him a spot among the top-ranked contenders in his weight class.</p>\n\n<p>But it's not just Morris' in-ring abilities that have garnered attention. His charismatic personality and down-to-earth demeanor have also won over fans and sponsors alike. He possesses the rare ability to connect with people both inside and outside the ring, making him a true fan favorite.</p>\n\n<p>As Morris continues to rise through the ranks, his professional record speaks for itself. With an impressive 20 wins and only 2 losses, he has proven time and time again that he has what it takes to compete at the highest level. But Morris isn't one to rest on his laurels - he's always striving to improve and push himself to new heights.</p>\n\n<p>One aspect of Morris' training that sets him apart is his focus on strength and conditioning. He understands the importance of being in peak physical form in order to withstand the grueling demands of the sport. From intense cardio workouts to weight training, Morris leaves no stone unturned in his quest for greatness.</p>\n\n<p>Outside of the ring, Morris is also heavily involved in philanthropy. He recognizes the influence he has as a professional athlete and uses his platform to give back to his community. Whether it's hosting charity events or visiting local schools, Morris is committed to making a positive impact on the lives of others.</p>\n\n<p>With the support of his team and the unwavering support of his fans, Kirk Morris is poised to become one of boxing's biggest stars. His future is bright, and the world is watching as he continues to make his mark on the sport.</p>\n\n<p>So, keep an eye out for the name Kirk Morris - because this rising star is just getting started.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1981-06-05",
    "proDivision": "light fly",
    "proWins": 7,
    "proWinsByKnockout": 2,
    "proLosses": 10,
    "proLossesByKnockout": 2,
    "proDraws": 1,
    "proStatus": "inactive",
    "proTotalBouts": 18,
    "proTotalRounds": 127,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 127,
    "createdAt": "2025-08-08T14:33:10.165175",
    "updatedAt": "2025-08-08T14:33:10.165177"
  }
]
