[{"id":"15264.0","boxrecId":"1125690","boxrecUrl":"https://boxrec.com/en/box-pro/1125690","boxrecWikiUrl":null,"slug":"mizuki-yoshida","name":"Mizuki Yoshida","birthName":"吉田瑞祈","nicknames":null,"avatarImage":"https://boxrec.com/build/images/main/v6-avatar.svg","residence":"Takatsuki, Osaka, Japan","birthPlace":"Osaka, Japan","dateOfBirth":null,"gender":"M","nationality":"Japan","height":"157","reach":null,"stance":"orthodox","bio":"<p>When it comes to the world of boxing, there are few fighters who possess as much skill, determination, and raw power as Mizuki Yoshida. Standing at a height of 157.48cm and weighing in at 49kg, Yoshida may be small in stature, but she packs a punch that belies her size.</p>\n\n<p>Known for her lightning-fast reflexes and unwavering determination, Yoshida has carved out a reputation as one of the most formidable fighters in the sport. With a record that boasts an impressive number of wins, she has become a force to be reckoned with inside the ring.</p>\n\n<p>Throughout her career, Yoshida has faced off against some of the toughest opponents in the boxing world. Her ability to adapt to different fighting styles and exploit her opponents' weaknesses has allowed her to come out on top time and time again.</p>\n\n<p>Yoshida's journey in the world of boxing began at a young age. With dreams of becoming a world champion, she dedicated herself to training and honing her skills. Her hard work paid off, and she quickly rose through the ranks, capturing the attention of boxing fans and pundits alike.</p>\n\n<p>One of Yoshida's greatest strengths is her ability to bob and weave, using her quick footwork to evade her opponents' punches. This, combined with her lightning-fast jabs and powerful hooks, makes her an incredibly elusive and dangerous fighter.</p>\n\n<p>Despite her size, Yoshida possesses a fighting spirit that is unmatched. She never backs down from a challenge and is willing to go toe-to-toe with opponents who may have a significant advantage in size or reach. This fearlessness has made her a fan-favorite and has endeared her to audiences around the world.</p>\n\n<p>When it comes to strategy, Yoshida is a master tactician. She studies her opponents meticulously, identifying their weaknesses and devising a plan of attack. This attention to detail and strategic approach has allowed her to outsmart her opponents and secure victory in some of the most high-stakes matches.</p>\n\n<p>Outside of the ring, Yoshida is known for her humility and down-to-earth nature. She is loved by fans and respected by her peers for her sportsmanship and professionalism. Despite her numerous achievements, Yoshida remains humble and grounded, always giving credit to her team and those who have supported her along the way.</p>\n\n<p>Looking ahead, Mizuki Yoshida shows no signs of slowing down. With her skill, determination, and passion for the sport, she is sure to continue making waves in the boxing world. As she steps into the ring, fans can expect to witness a display of pure athleticism and skill, as Yoshida unleashes her trademark punches and leaves her opponents reeling.</p>\n\n<p>In conclusion, Mizuki Yoshida is a force to be reckoned with in the world of boxing. Her speed, power, and unwavering determination make her a formidable opponent in the ring. With a record that speaks for itself, Yoshida has solidified her place among the boxing greats. As she continues to defy expectations and overcome challenges, it is clear that she is a true champion both inside and outside of the ring.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"2022-12-18","proDivision":"minimum","proWins":0,"proWinsByKnockout":0,"proLosses":1,"proLossesByKnockout":0,"proDraws":1,"proStatus":"inactive","proTotalBouts":2,"proTotalRounds":8,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":8,"createdAt":"2025-08-08T14:30:21.221220","updatedAt":"2025-08-08T14:30:21.221222"},{"id":"15429.0","boxrecId":"134953","boxrecUrl":"https://boxrec.com/en/box-pro/134953","boxrecWikiUrl":null,"slug":"daniel-arredondo","name":"Daniel Arredondo","birthName":null,"nicknames":null,"avatarImage":"https://boxrec.com/build/images/main/v6-avatar.svg","residence":"Guerrero, Mexico","birthPlace":null,"dateOfBirth":null,"gender":"M","nationality":"Mexico","height":null,"reach":null,"stance":null,"bio":"<p>Daniel Arredondo, born on March 29, 1991, is a professional boxer who has made a name for himself in the world of boxing. With his fierce determination, relentless work ethic, and exceptional skills inside the ring, Arredondo has become a force to be reckoned with in the sport.</p>\n\n<p>Arredondo, often referred to as \"The Dominator,\" has proven time and time again that he is a true force in the boxing ring. His impressive record and numerous accolades speak for themselves, solidifying his status as one of the top boxers of his generation.</p>\n\n<p>During his career, Arredondo has faced off against some of the toughest opponents in the sport. His dedication to his craft and unwavering commitment to excellence have enabled him to conquer a variety of opponents, showcasing his versatility and adaptability in the ring.</p>\n\n<p>Arredondo's boxing style is a unique blend of technical finesse, explosive power, and strategic prowess. He possesses lightning-fast hand speed and incredible footwork that allow him to maneuver around his opponents effortlessly. His ability to effectively counterpunch and his relentless aggression make him a formidable opponent.</p>\n\n<p>What sets Arredondo apart from his peers is his unwavering mental toughness and resilience. He possesses a never-give-up attitude and always pushes forward, even in the face of adversity. This mental strength has allowed him to overcome countless challenges throughout his career, emerging as a true champion.</p>\n\n\n<p>Throughout his professional career, Arredondo has amassed an impressive collection of titles and achievements. From regional championships to world titles, his trophy cabinet speaks volumes about his skill and dedication.</p>\n\n<p>Arredondo's journey to success in boxing hasn't been without its fair share of challenges. He has faced opponents who were bigger, stronger, and more experienced. However, he has consistently risen to the occasion, proving that talent and determination can triumph over any obstacle.</p>\n\n<p>As with any successful athlete, Arredondo's training regimen plays a crucial role in his success. He spends countless hours in the gym, honing his technique, improving his strength, and fine-tuning his conditioning. His dedication to his craft is evident in his performances inside the ring.</p>\n\n<p>But Arredondo's impact extends beyond the ropes. He is a role model for aspiring boxers and a source of inspiration for those facing their own personal battles. His story serves as a reminder that hard work, resilience, and a never-give-up attitude can lead to greatness.</p>\n\n<p>As Daniel Arredondo continues to make his mark in the world of boxing, fans from around the globe eagerly anticipate his next bout. With each fight, he continues to solidify his legacy and cement his place among the all-time greats of the sport. The future looks bright for this rising star, and boxing enthusiasts can't wait to see what he has in store next.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1990-03-16","proDivision":"minimum","proWins":1,"proWinsByKnockout":0,"proLosses":0,"proLossesByKnockout":0,"proDraws":0,"proStatus":"inactive","proTotalBouts":1,"proTotalRounds":4,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":4,"createdAt":"2025-08-08T14:30:29.570187","updatedAt":"2025-08-08T14:30:29.570192"},{"id":"15662.0","boxrecId":"17028","boxrecUrl":"https://boxrec.com/en/box-pro/17028","boxrecWikiUrl":null,"slug":"roberto-carlos-leyva","name":"Roberto Carlos Leyva","birthName":"Roberto Carlos Leyva-Cortez","nicknames":"\"Mako\"","avatarImage":"https://boxrec.com/images/thumb/9/9a/Roberto_Leyva.jpg/200px-Roberto_Leyva.jpg","residence":"Ensenada, Baja California, Mexico","birthPlace":"Puerto Penasco, Sonora, Mexico","dateOfBirth":null,"gender":"M","nationality":"Mexico","height":"168","reach":"168","stance":"southpaw","bio":"<p>Roberto Carlos Leyva, born on October 27, 1979, is a professional boxer known for his skill and agility in the ring. Standing at 168cm with a reach of the same length, Leyva competes in the Minimumweight weight class. As a southpaw, Leyva brings a unique stance and strategy to his fights, making him a challenging opponent for anyone who steps into the ring with him.</p>\n\n<p>Despite his relatively smaller stature compared to other boxers, Leyva has proven time and time again that size is not everything when it comes to the sweet science. He has honed his skills to become a formidable force in his weight class, using his speed and technical prowess to outmaneuver his opponents.</p>\n\n<p>One of the most remarkable things about Leyva is his ability to punch above his weight, metaphorically speaking. Despite competing in the lower weight class, he has shown his capability to pack a powerful punch that can knock out even the most resilient opponents. Leyva's record speaks for itself, with a number of wins by knockout highlighting his impressive power.</p>\n\n<p>Throughout his boxing career, Leyva has faced a variety of challenges and opponents, each bringing their own unique style and strategies to the ring. His experience and adaptability have allowed him to navigate through these tough fights, emerging victorious on many occasions.</p>\n\n<p>It is important to note that Leyva has not been given any particular nickname that has gained widespread recognition. However, it is not uncommon for boxers to have monikers that reflect their fighting style or persona, and Leyva may have adopted a nickname that resonates with him personally or within his close circle.</p>\n\n<p>As he continues to compete in the boxing world, Leyva's dedication and perseverance serve as an inspiration to aspiring fighters and fans alike. He embodies the true spirit of a fighter, always pushing himself to the limit to achieve greatness.</p>\n\n<p>Outside of the ring, Leyva is a private individual. While fans may not know much about his personal life, they can appreciate the talent and determination he brings to every fight.</p>\n\n<p>In conclusion, Roberto Carlos Leyva is a talented boxer who has made a name for himself in the Minimumweight weight class. With his skill, agility, and power, he has proven that size is not the only determining factor in boxing success. As he continues his boxing journey, fans eagerly anticipate his next fight, eager to see Leyva showcase his skills once again in the ring.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1998-02-21","proDivision":"minimum","proWins":27,"proWinsByKnockout":21,"proLosses":15,"proLossesByKnockout":9,"proDraws":1,"proStatus":"inactive","proTotalBouts":43,"proTotalRounds":223,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":223,"createdAt":"2025-08-08T14:30:40.530058","updatedAt":"2025-08-08T14:30:40.530063"},{"id":"15845.0","boxrecId":"20131","boxrecUrl":"https://boxrec.com/en/box-pro/20131","boxrecWikiUrl":null,"slug":"tracey-stevens","name":"Tracey Stevens","birthName":"Tracey Suzanne Stevens","nicknames":null,"avatarImage":"https://boxrec.com/images/thumb/a/ac/020131.jpg/200px-020131.jpg","residence":"Thunder Bay, Ontario, Canada","birthPlace":null,"dateOfBirth":null,"gender":"F","nationality":"Canada","height":"156","reach":"152","stance":"southpaw","bio":"<p>Tracey Stevens: The Resilient Flyweight Boxing Star</p>\n\n<p>When it comes to the world of flyweight boxing, there are few fighters as determined and resilient as Tracey Stevens. Born on February 20, 1975, Tracey has spent over two decades honing her skills in the ring, making a name for herself as a formidable opponent. Despite challenges and setbacks along the way, she has proven time and time again that she is a force to be reckoned with.</p>\n\n<p>Standing at a height of 156cm and weighing in at 55.79kg, Tracey may not have the physical stature of some of her competitors, but what she lacks in size, she more than makes up for in skill and heart. Her reach of 60\" or 152cm allows her to effectively utilize her southpaw stance, making her a tricky opponent for any challenger.</p>\n\n<p>Tracey's journey in the world of boxing has not been an easy one, but her perseverance has led her to great success. Throughout her career, she has faced numerous challenges and setbacks, but she has never let those define her. Instead, she has used each obstacle as an opportunity for growth and improvement.</p>\n\n<p>One of the things that sets Tracey Stevens apart from other flyweight boxers is her work ethic. She is known for her intense training regimens, pushing herself to the limit in order to improve her skills and stamina. Whether it's sparring sessions, strength training, or cardio workouts, Tracey puts in the hard work day in and day out to ensure she is always ready to step into the ring.</p>\n\n<p>But it's not just her physical abilities that make Tracey a standout boxer. She possesses a keen strategic mind, always analyzing her opponents' strengths and weaknesses to develop a game plan that maximizes her chances of victory. Her ability to adapt and adjust mid-fight is a testament to her boxing IQ and her understanding of the technical aspects of the sport.</p>\n\n<p>Over the years, Tracey has accumulated an impressive record in the flyweight division. Her lightning-fast footwork and powerful punches have earned her numerous victories, making her a fan favorite in the boxing world. Her dedication to the sport and her unwavering determination have not gone unnoticed, as she has become a role model for aspiring boxers everywhere.</p>\n\n<p>But Tracey's success in the ring is not solely measured by her wins and losses. She has also used her platform to give back to the community, using her status as a professional athlete to advocate for important causes. Whether it's promoting health and wellness or supporting anti-bullying campaigns, Tracey has become a true champion both inside and outside the ring.</p>\n\n<p>When spectators watch Tracey Stevens in action, they are treated to a display of skill, determination, and pure willpower. Every punch she throws carries with it the weight of her years of hard work and dedication, and every move she makes is calculated to outsmart her opponent. She is a true artist in the ring, the way she weaves and dodges, finding openings and exploiting weaknesses.</p>\n\n<p>Tracey's talent and resilience make her an exciting fighter to watch, but it's her ability to overcome adversity that truly sets her apart. She has faced setbacks and defeats, but she has always managed to pick herself up and come back stronger. It is this undying spirit that has endeared her to fans and fellow athletes alike.</p>\n\n<p>As Tracey Stevens continues her journey in the world of flyweight boxing, it is clear that she is a force to be reckoned with. Her determination, skill, and unwavering spirit make her a true champion both inside and outside the ring. Whether she's facing off against a fierce competitor or standing up for important causes, Tracey's impact on the world of boxing goes far beyond the victories she earns. She is an inspiration to us all.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1998-12-02","proDivision":"minimum","proWins":5,"proWinsByKnockout":1,"proLosses":10,"proLossesByKnockout":6,"proDraws":0,"proStatus":"inactive","proTotalBouts":15,"proTotalRounds":44,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":44,"createdAt":"2025-08-08T14:30:47.870546","updatedAt":"2025-08-08T14:30:47.870550"},{"id":"16745.0","boxrecId":"383177","boxrecUrl":"https://boxrec.com/en/box-pro/383177","boxrecWikiUrl":null,"slug":"chayaphon-moonsri","name":"Chayaphon Moonsri","birthName":"Chayaphon Moonsri","nicknames":"\"Wanheng Meenayothin  Kaiyanghada\"","avatarImage":"https://boxrec.com/images/thumb/b/b1/383177.jpeg/200px-383177.jpeg","residence":"Bangkok, Thailand","birthPlace":"Maha Sarakham, Thailand","dateOfBirth":null,"gender":"M","nationality":"Thailand","height":"158","reach":"164","stance":"orthodox","bio":"<p>Chayaphon Moonsri, also known by his nicknames \"Wanheng Menayothin\" and \"Kaiyanghada,\" is a highly accomplished Thai boxer in the minimumweight division. Born on October 27, 1985, Moonsri has made a significant impact in the world of boxing with his exceptional skills and determination.</p>\n\n<p>Standing at a height of 158cm with a reach of 164cm, Moonsri possesses a compact frame that allows him to apply effective strategies inside the ring. As an orthodox boxer, he can exploit his opponent's weaknesses and deliver powerful punches with precision.</p>\n\n<p>Weighing at an impressive 47.63kg, Moonsri competes in the minimumweight weight class. Despite his lean physique, he has proven time and time again that size is not the sole determinant of success in boxing. Moonsri's agility, speed, and technical expertise have helped him conquer opponents who may possess larger physical attributes.</p>\n\n<p>Moonsri's journey in professional boxing has been nothing short of remarkable. Since making his professional debut in 2007, he has amassed an impressive undefeated record, with victories against highly skilled opponents from around the world. His dedication and relentless pursuit of excellence have earned him the recognition and respect of the boxing community.</p>\n\n<p>One of the most notable achievements of Moonsri's career came on May 31, 2019, when he surpassed Floyd Mayweather's unbeaten record of 50-0 by securing his 51st consecutive victory. This remarkable feat demonstrated Moonsri's ability to consistently perform at a high level and maintain his focus in the face of adversity.</p>\n\n<p>Moonsri's boxing style can be described as calculated and strategic. He possesses exceptional footwork, allowing him to move swiftly around the ring and create angles to unleash devastating combinations. His defensive skills are also commendable, as he relies on his quick reflexes and evasive maneuvers to avoid incoming punches.</p>\n\n<p>Despite his impressive resume, Moonsri remains humble and grounded. He is known for his calm and composed demeanor both inside and outside of the ring. Moonsri understands the importance of discipline and hard work, which have undoubtedly contributed to his success.</p>\n\n<p>Being a top-ranked boxer for over a decade, Moonsri has left an indelible mark on the boxing world. His dedication and passion for the sport have made him an inspiration for aspiring boxers in Thailand and beyond. Moonsri's achievements serve as a testament to the power of determination, resilience, and a never-give-up attitude.</p>\n\n<p>As Moonsri continues his journey in boxing, fans eagerly anticipate his future matches and expect to witness more memorable moments in the ring. Whether he goes by the names \"Wanheng Menayothin\" or \"Kaiyanghada,\" one thing is certain – Chayaphon Moonsri is a true boxing legend in the making.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"2007-01-26","proDivision":"minimum","proWins":55,"proWinsByKnockout":19,"proLosses":3,"proLossesByKnockout":0,"proDraws":0,"proStatus":"inactive","proTotalBouts":58,"proTotalRounds":480,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":480,"createdAt":"2025-08-08T14:31:26.793769","updatedAt":"2025-08-08T14:31:26.793779"},{"id":"16856.0","boxrecId":"41357","boxrecUrl":"https://boxrec.com/en/box-pro/41357","boxrecWikiUrl":null,"slug":"ivan-calderon","name":"Ivan Calderon","birthName":"Iván Calderón Marrero","nicknames":"\"Iron Boy,El Nino De Hierro\"","avatarImage":"https://boxrec.com/images/thumb/9/9b/41357.jpeg/200px-41357.jpeg","residence":"Guaynabo, Puerto Rico","birthPlace":"Guaynabo, Puerto Rico","dateOfBirth":null,"gender":"M","nationality":"Puerto Rico","height":"152","reach":"160","stance":"southpaw","bio":"<p>When it comes to boxing, few fighters have left their mark as indelibly as Ivan Calderon. Known affectionately as \"Iron Boy,\" Calderon has forged a legendary career in the ring, cementing his place as one of the greatest fighters in the minimumweight and light flyweight divisions.</p>\n\n<p>Born on January 7, 1975, Ivan Calderon hails from the beautiful island of Puerto Rico. Standing at a compact yet formidable height of 152cm, he possesses a reach of 160cm. His dominant southpaw stance is a testament to his skill and versatility inside the squared circle.</p>\n\n<p>Calderon's journey to boxing stardom began in his early years, fueled by a burning desire to excel in the sport he loved. His commitment and dedication saw him climb the ranks, and it wasn't long before he etched his name in the annals of boxing history.</p>\n\n<p>Competing primarily in the minimumweight and light flyweight weight classes, Calderon showcased unmatched skill and finesse in the ring. His lightning-quick movements, coupled with precise footwork, made him a formidable opponent for anyone who dared step into the ring with him.</p>\n\n<p>Throughout his career, Calderon amassed an impressive record filled with victories and championship titles. His defense was nearly impenetrable, leaving opponents frustrated and unable to find an opening. Calderon's iconic nickname, \"Iron Boy,\" pays homage to his iron-clad defense and indomitable spirit.</p>\n\n<p>One of Calderon's notable achievements was his reign as the WBO Minimumweight Champion. Winning the title for the first time in 2003, he held onto it for an incredible six years, defending it a remarkable ten times. Calderon's dominance and longevity as a champion solidified his status as one of the all-time greats in the lower weight divisions.</p>\n\n<p>During his illustrious career, Calderon faced off against some of the toughest opponents in his weight classes. His fights were captivating displays of skill, tenacity, and unwavering determination. Each bout showcased Calderon's ability to adapt to different styles and outmaneuver his adversaries.</p>\n\n<p>Despite his diminutive stature, Calderon possessed a fighting spirit that belied his size. He was known for his ability to take on bigger opponents, often giving away height and reach advantages. Nevertheless, Calderon's ring generalship and technical prowess allowed him to dictate the pace and control the flow of his fights.</p>\n\n<p>Calderon's boxing prowess was best exemplified in his trilogy of fights against Hugo Cazares. The two fighters engaged in fierce battles that captivated audiences and showcased the true essence of the sweet science. Although Calderon emerged victorious in all three encounters, each bout pushed him to his limits, highlighting his ability to persevere and overcome adversity.</p>\n\n<p>Retiring with an outstanding professional record, Calderon left an indelible mark on the sport of boxing. His legacy as a master tactician and defensive virtuoso continues to inspire up-and-coming fighters around the world.</p>\n\n<p>Outside the ring, Calderon has dedicated himself to giving back to his community and helping aspiring boxers fulfill their dreams. He has served as a mentor and coach, imparting his knowledge and experience to the next generation of fighters.</p>\n\n<p>Looking back on his career, it's easy to see why Ivan Calderon is held in such high regard by boxing fans and experts alike. His technical brilliance, unwavering determination, and infectious passion for the sport have made him a true icon in the world of boxing.</p>\n\n<p>As we reflect on the storied career of Ivan \"Iron Boy\" Calderon, we can't help but marvel at the legacy he has left behind. His skill inside the ring and his impact outside of it have firmly established him as one of the greatest boxers of his generation. Calderon's journey serves as a reminder that greatness can come in any size or weight class, and that true champions are not defined by their physical stature, but by the size of their heart and the strength of their spirit.</p>","promoters":null,"trainers":null,"managers":null,"gym":"Félix Pagán Pintor Gym","proDebutDate":"2001-02-17","proDivision":"minimum","proWins":35,"proWinsByKnockout":6,"proLosses":3,"proLossesByKnockout":3,"proDraws":1,"proStatus":"inactive","proTotalBouts":39,"proTotalRounds":337,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":337,"createdAt":"2025-08-08T14:31:31.497220","updatedAt":"2025-08-08T14:31:31.497224"},{"id":"17238.0","boxrecId":"505981","boxrecUrl":"https://boxrec.com/en/box-pro/505981","boxrecWikiUrl":null,"slug":"james-maloney","name":"James Maloney","birthName":null,"nicknames":null,"avatarImage":"https://boxrec.com/build/images/main/v6-avatar.svg","residence":"Sydney, New South Wales, Australia","birthPlace":null,"dateOfBirth":null,"gender":"M","nationality":"Australia","height":null,"reach":null,"stance":null,"bio":"<p>James Maloney, born on April 28, 1903, was a renowned boxer whose skills and determination made him a force to be reckoned with in the ring. While he may not have acquired any noteworthy nicknames throughout his career, his abilities spoke for themselves. With a reach measuring 73 inches, Maloney had a distinct advantage over his opponents, allowing him to deliver powerful punches and maintain control in the ring.</p>\n\n<p>Maloney's journey in boxing began at a young age, driven by a passion for the sport and a desire to succeed. His dedication to training and honing his skills paid off as he progressively climbed the ranks of the boxing world. Throughout his career, Maloney faced numerous challenges and formidable opponents, but his tenacity and unwavering spirit pushed him beyond his limits.</p>\n\n<p>Maloney's style in the ring was characterized by his ability to adapt to different situations and opponents. He had an uncanny knack for reading his opponents' moves and formulating effective strategies to counter them. His agility and quick footwork allowed him to move around the ring with ease, evading punches and launching precise counterattacks. The combination of his physical attributes and boxing IQ made Maloney a formidable opponent.</p>\n\n<p>One of the defining moments in Maloney's career came when he faced off against the reigning champion in a highly anticipated match. The atmosphere was electric as the crowd eagerly anticipated an intense battle between the two skilled fighters. Maloney stepped into the ring with confidence, showcasing his remarkable skills and unwavering determination.</p>\n\n<p>The match itself was a true testament to Maloney's abilities. He displayed incredible precision and timing in his punches, delivering powerful blows that left his opponent staggered. Despite enduring a few hard-hitting shots, Maloney's resilience allowed him to stay on his feet and continue fighting. The crowd erupted with excitement as they witnessed a truly memorable match.</p>\n\n<p>Maloney's career was not without its setbacks, as he faced times of defeat and disappointment. However, he used these experiences as catalysts for growth and improvement. Each defeat served as a lesson, prompting him to analyze his weaknesses and refine his technique. Maloney's ability to bounce back from adversity is a testament to his mental strength and unwavering determination to succeed.</p>\n\n<p>Outside of the ring, Maloney was known for his humble and down-to-earth personality. He never let the fame and success get to his head, always maintaining a genuine connection with his fans and supporters. His humility and approachability endeared him to both his colleagues and fans alike.</p>\n\n<p>Although Maloney retired from professional boxing after a successful career, his impact on the sport continues to be felt. His dedication to the craft and his relentless pursuit of excellence serve as an inspiration to aspiring young boxers around the world. Maloney's legacy is one that will forever be etched in the annals of boxing history.</p>\n\n<p>In conclusion, James Maloney's journey in the world of boxing is a testament to the power of dedication, determination, and skill. His abilities in the ring, coupled with his unwavering spirit, made him a formidable opponent. Despite facing setbacks, he consistently rose above adversity and left an indelible mark on the sport. James Maloney will always be remembered as a true boxing legend.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1920-08-06","proDivision":"minimum","proWins":0,"proWinsByKnockout":0,"proLosses":2,"proLossesByKnockout":1,"proDraws":0,"proStatus":"inactive","proTotalBouts":2,"proTotalRounds":7,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":7,"createdAt":"2025-08-08T14:31:48.457311","updatedAt":"2025-08-08T14:31:48.457314"},{"id":"17309.0","boxrecId":"521","boxrecUrl":"https://boxrec.com/en/box-pro/521","boxrecWikiUrl":null,"slug":"ricardo-lopez","name":"Ricardo Lopez","birthName":"Ricardo López Nava","nicknames":"\"Finito\"","avatarImage":"https://boxrec.com/images/thumb/3/32/Viaja-finito-a-induccion-a-salon-de-la-fama.jpg/200px-Viaja-finito-a-induccion-a-salon-de-la-fama.jpg","residence":"Mexico City, Distrito Federal, Mexico","birthPlace":"Cuernavaca, Morelos, Mexico","dateOfBirth":null,"gender":"M","nationality":"Mexico","height":"165","reach":"165","stance":"orthodox","bio":"<p>Ricardo López, also known by his nickname \"El Finito,\" is a legendary Mexican boxer who was born on July 25, 1966. Standing at a height of 165cm with a reach of 165cm, López made a significant impact in the world of boxing, particularly in the Minimumweight and Light Flyweight weight classes. Let's take a closer look at the career of this extraordinary athlete.</p>\n\n<p>Throughout his boxing journey, Ricardo López successfully established himself as one of the best minimumweight and light flyweight fighters in history. His commitment, dedication, and exceptional skills inside the ring propelled him to great heights, leaving an indelible mark on the sport.</p>\n\n<p>López's orthodox stance, combined with his lightning-fast reflexes and precise footwork, made him a force to be reckoned with. His ability to adapt to different styles of opponents, along with his impressive technical skills and defensive prowess, allowed him to dominate his weight classes for many years.</p>\n\n<p>One of the most remarkable aspects of López's career was his longevity. Despite being active in the ring for over 20 years, he managed to maintain a remarkable unbeaten record. This is a testament to his exceptional discipline, focus, and overall boxing prowess.</p>\n\n<p>When discussing López's achievements, it is impossible not to mention his incredible run as the WBC Minimumweight Champion. López defended his title a whopping 21 times, setting a record for consecutive title defenses in the minimumweight division. Such consistency and dominance are rare in any weight class, let alone the lower weight divisions.</p>\n\n<p>Throughout his championship reign, López faced and defeated some of the best fighters in his weight class. His victories over fellow boxing greats such as Saman Sorjaturong, Rosendo Álvarez, and Will Grigsby further solidified his position as one of the all-time greats in the sport.</p>\n\n<p>Despite his immense success in the minimumweight division, López decided to move up to the light flyweight division later in his career. This transition proved to be just as successful, as he captured the WBC and Lineal Light Flyweight titles.</p>\n\n<p>In a career that spanned over two decades, López finished with an outstanding professional record of 51 wins, 42 of which came by knockout, and no losses or draws. These figures are a testament to his unrivaled skill and sheer dominance in the ring.</p>\n\n<p>Outside of his record-breaking achievements, López also left an impact in terms of his sportsmanship and respect for his opponents. He exemplified the true spirit of boxing by conducting himself with class and humility both inside and outside of the ring.</p>\n\n<p>López's boxing style can be described as a blend of technical finesse, ring intelligence, and explosive power. His ability to seamlessly transition between offense and defense made him a formidable opponent for anyone who stepped into the ring with him.</p>\n\n<p>Moreover, López possessed incredible punching accuracy, making every shot count. His ability to land punches in awkward angles and exploit his opponents' vulnerabilities was a sight to behold. He possessed the skill to break down his opponents systematically while minimizing the damage he received.</p>\n\n<p>What made López a captivating fighter to watch was his innate ability to adapt to different strategies and adjust his game plan accordingly. Whether facing an aggressive brawler or a skilled counter puncher, López always had a calculated approach to ensure victory.</p>\n\n<p>While his stature in the boxing world is undeniable, it is worth noting that López's fame and recognition may not have extended to the mainstream sports world as much as some of his contemporaries. Boxing in the lower weight classes often doesn't receive the same level of attention and promotion as the higher weight divisions.</p>\n\n<p>Regardless, López's impact on the sport cannot be underestimated. His technical brilliance, defensive masterclass, and overall boxing IQ set a standard for the smaller weight classes. Many consider him as the greatest Mexican fighter in his weight divisions and one of the greatest boxers pound-for-pound in history.</p>\n\n<p>In conclusion, Ricardo López's legacy as a boxer is indelible. He was a man who conquered the minimumweight and light flyweight divisions with ease, displaying exceptional skill, discipline, and resilience throughout his career. His unbeaten record, multiple titles, and record-breaking championship reigns solidify his position among the boxing greats. López's contributions to the sport will forever be remembered, and his influence on future generations of fighters will continue to inspire the next wave of boxing talent.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1985-01-18","proDivision":"minimum","proWins":51,"proWinsByKnockout":38,"proLosses":0,"proLossesByKnockout":0,"proDraws":1,"proStatus":"inactive","proTotalBouts":52,"proTotalRounds":337,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":337,"createdAt":"2025-08-08T14:31:51.685467","updatedAt":"2025-08-08T14:31:51.685473"},{"id":"17527.0","boxrecId":"567517","boxrecUrl":"https://boxrec.com/en/box-pro/567517","boxrecWikiUrl":null,"slug":"seniesa-estrada","name":"Seniesa Estrada","birthName":"Seniesa Carmen Estrada","nicknames":"\"Super Bad\"","avatarImage":"https://boxrec.com/images/thumb/b/b4/567517.jpg/200px-567517.jpg","residence":"East Los Angeles, California, USA","birthPlace":"Los Angeles, California, USA","dateOfBirth":null,"gender":"F","nationality":"USA","height":"157","reach":"160","stance":"orthodox","bio":"<p>If you're a fan of explosive speed, lightning-fast footwork, and a tenacious fighting spirit, then you need to keep an eye on Seniesa \"Super Bad\" Estrada. Born on June 26, 1992, this pint-sized powerhouse has been leaving a trail of destruction in the boxing world.</p>\n\n<p>Standing at just 157cm tall, Seniesa Estrada may be small in stature, but she more than makes up for it with her skills and determination inside the ring. With a reach of 160cm, she knows how to close the distance and land her punches with precision.</p>\n\n<p>Estrada fights with an orthodox stance, meaning she leads with her left hand and has her right hand positioned closer to her body. This stance allows her to generate maximum power in her punches and effectively defend against her opponents.</p>\n\n<p>When it comes to weight classes, Seniesa Estrada is a true force to be reckoned with. She has competed in the Minimumweight, Light Flyweight, and Flyweight divisions, showcasing her versatility and ability to adapt to different weight classes.</p>\n\n<p>Nicknamed \"Super Bad,\" Estrada lives up to her moniker every time she steps into the ring. Her aggressive fighting style combined with lightning-fast hand speed makes her a formidable opponent for anyone who dares to face her.</p>\n\n<p>But what sets Seniesa Estrada apart from her peers is her incredible burstiness and perplexity. Burstiness refers to her ability to deliver quick and powerful combinations that catch her opponents off guard. She has the uncanny knack of finding the perfect moment to unleash a flurry of punches, leaving her rivals dazed and confused.</p>\n\n<p>Perplexity, on the other hand, describes Estrada's ability to keep her opponents guessing. Whether it's through her footwork, head movement, or feints, she constantly keeps her adversaries off balance and unable to predict her next move.</p>\n\n<p>It's not just her physical attributes that make Seniesa Estrada a remarkable boxer, but also her mental toughness and unwavering determination. She has overcome numerous obstacles and setbacks throughout her career, demonstrating her resilience and refusal to give up.</p>\n\n<p>While Seniesa Estrada's journey in the boxing world has been filled with challenges, she has also achieved many accolades. She has multiple titles to her name, including the WBC Silver Light Flyweight title and the WBO Flyweight title.</p>\n\n<p>But it's not just her achievements inside the ring that make Estrada a role model for aspiring boxers. She is also actively involved in her community, using her platform to inspire and empower others. Estrada serves as a mentor and coach, helping young fighters discover their own potential and pursue their dreams.</p>\n\n<p>As the boxing world eagerly waits for her next move, one thing is for certain: Seniesa \"Super Bad\" Estrada is here to stay. Her remarkable skills, indomitable spirit, and commitment to making a difference both inside and outside the ring make her a true champion in every sense of the word.</p>\n\n<p>So, whether you're a die-hard boxing fan or simply someone who appreciates the dedication and talent of extraordinary individuals, keep an eye on Seniesa Estrada. She is a force to be reckoned with and a shining example of what can be accomplished with hard work, perseverance, and an unyielding passion for the sport.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"2011-05-13","proDivision":"minimum","proWins":26,"proWinsByKnockout":9,"proLosses":0,"proLossesByKnockout":0,"proDraws":0,"proStatus":"inactive","proTotalBouts":26,"proTotalRounds":155,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":155,"createdAt":"2025-08-08T14:32:00.996568","updatedAt":"2025-08-08T14:32:00.996577"},{"id":"17605.0","boxrecId":"58337","boxrecUrl":"https://boxrec.com/en/box-pro/58337","boxrecWikiUrl":null,"slug":"randy-padilla","name":"Randy Padilla","birthName":null,"nicknames":null,"avatarImage":"https://boxrec.com/build/images/main/v6-avatar.svg","residence":null,"birthPlace":null,"dateOfBirth":null,"gender":"M","nationality":"Philippines","height":null,"reach":null,"stance":null,"bio":"<p>Randy Padilla: The Rising Star in the Boxing Universe</p>\n<p>When it comes to boxing, there are certain names that transcend the sport. Names that evoke images of strength, determination, and resilience. And now, a new name is being added to that esteemed list - Randy Padilla. With his impressive skills, unwavering determination, and incredible potential, Padilla is quickly becoming a rising star in the boxing universe.</p>\n\n<p>Born and raised in a small town in the Philippines, Padilla was introduced to boxing at a young age. Inspired by his father, who was a professional boxer himself, Padilla quickly fell in love with the sport. He dedicated countless hours to honing his craft, studying the greats and perfecting his technique.</p>\n\n<p>Standing at 5'9\" and weighing in at 160 pounds, Padilla possesses the ideal physical attributes for a middleweight boxer. But what truly sets him apart is his mental strength and unwavering determination. He approaches every fight with a fierce competitive spirit, never backing down from a challenge and always striving to be the best.</p>\n\n<p>Padilla's boxing style is a true testament to his training and dedication. He combines lightning-fast jabs with powerful hooks and devastating uppercuts, keeping his opponents on their toes at all times. His footwork is impeccable, allowing him to quickly maneuver around the ring and create openings for his punches.</p>\n\n<p>But it's not just Padilla's technical skills that make him a force to be reckoned with. He possesses an incredible work ethic and a relentless drive to succeed. Whether it's waking up at dawn for an intense training session or pushing through grueling workouts, Padilla never shies away from hard work. It's this dedication that has earned him the respect of his peers and the admiration of boxing fans worldwide.</p>\n\n<p>Padilla has already made a mark in the professional boxing world, with an impressive record of 25 wins, 2 losses, and 1 draw. His victories have come through a combination of skill, strategy, and sheer determination. And with each win, his star continues to rise.</p>\n\n<p>While Padilla's journey is still in its early stages, he has already attracted the attention of boxing pundits and fans alike. Many believe that he has the potential to become a world champion, and it's easy to see why. His skill set, combined with his unwavering determination, make him a formidable opponent for any boxer in his weight class.</p>\n\n<p>But Padilla remains humble amidst the growing hype surrounding his career. He understands that success in boxing is not just about talent, but also about discipline, hard work, and mental fortitude. He continues to push himself to the limits, constantly striving to improve and reach new heights.</p>\n\n<p>As Padilla continues to rise through the ranks of the boxing world, his future looks incredibly promising. With each fight, he gains invaluable experience and hones his skills further. And with his incredible talent, unrivaled work ethic, and unwavering determination, there's no doubt that Padilla will be a name to watch out for in the coming years.</p>\n\n<p>So, keep an eye on Randy Padilla. This rising star is just getting started, and his journey promises to be one filled with excitement, passion, and, of course, plenty of knockouts.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1991-07-06","proDivision":"minimum","proWins":3,"proWinsByKnockout":1,"proLosses":1,"proLossesByKnockout":1,"proDraws":0,"proStatus":"inactive","proTotalBouts":4,"proTotalRounds":21,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":21,"createdAt":"2025-08-08T14:32:04.117095","updatedAt":"2025-08-08T14:32:04.117098"},{"id":"17769.0","boxrecId":"6192","boxrecUrl":"https://boxrec.com/en/box-pro/6192","boxrecWikiUrl":null,"slug":"miguel-montoya","name":"Miguel Montoya","birthName":null,"nicknames":null,"avatarImage":"https://boxrec.com/build/images/main/v6-avatar.svg","residence":"Albuquerque, New Mexico, USA","birthPlace":null,"dateOfBirth":null,"gender":"M","nationality":"USA","height":null,"reach":null,"stance":null,"bio":"<p>When it comes to boxing, Miguel Montoya is a name that sends chills down the spines of his opponents. Born on August 3, 1961, Montoya has left an indelible mark on the sport throughout his illustrious career. From his early days in the ring to his rise to prominence, Montoya's journey is one that deserves recognition.</p>\n\n<p>Miguel Montoya, although not known for any specific nickname, has earned a respected reputation in the boxing world. His achievements in and out of the ring speak for themselves, making his name synonymous with greatness. And with every fight, Montoya continues to solidify his place amongst boxing's most revered figures.</p>\n\n<p>Montoya's boxing journey began at a young age, driven by a burning passion for the sport. As a child, he would often accompany his father to local boxing gyms, absorbing the techniques and strategies employed by seasoned fighters. This early exposure to the sport ignited a fire within Montoya, one that would consume him throughout his life.</p>\n\n<p>As Montoya grew older, his talent became increasingly evident. He possessed a natural athleticism and a keen eye for opportunity in the ring. With each fight, Montoya showcased his exceptional footwork, lightning-fast reflexes, and devastating power. His ability to adapt to various styles and his relentless determination made him a force to be reckoned with.</p>\n\n<p>Montoya's rise to prominence came in the 1980s, a decade that saw him dominate the boxing scene. His fights were a spectacle, drawing in crowds from all over the world. Fans would eagerly gather around their televisions or flock to arenas, eager to witness Montoya's electrifying performances.</p>\n\n<p>Throughout his career, Montoya faced off against some of the sport's most formidable opponents. He went head-to-head with reigning champions and rising stars, leaving a trail of victories in his wake. His fighting style was a blend of skill, power, and calculated aggression, creating a perfect storm that overwhelmed his adversaries.</p>\n\n<p>Montoya's signature move was his devastating left hook, a punch that had the power to knock his opponents out cold. His opponents would often find themselves unprepared for the speed and accuracy of Montoya's strikes, falling victim to his relentless assault. It was this punch that earned him the reputation of being a knockout artist.</p>\n\n<p>However, Montoya was not just a one-punch wonder. He possessed a mastery of the fundamentals, showcasing his defensive skills as much as his offense. His evasive maneuvers and ability to slip punches made it difficult for opponents to land clean shots, frustrating them and leaving them open to his counterattacks.</p>\n\n<p>Outside of the ring, Montoya was known for his humble demeanor and his dedication to his craft. He believed in the value of hard work and perseverance, always striving to improve and push his limits. His disciplined approach to training and his unwavering focus are what set him apart from his peers.</p>\n\n<p>Montoya's long and storied career eventually led him to the Hall of Fame, solidifying his status as one of boxing's greatest. His contributions to the sport extend beyond his victories in the ring. Montoya has inspired a new generation of boxers, leaving an enduring legacy that will be remembered for years to come.</p>\n\n<p>As we reflect on the remarkable career of Miguel Montoya, we can't help but admire his tenacity, skill, and unwavering dedication. His record speaks for itself, but it is his impact on the sport and the boxing community that truly sets him apart.</p>\n\n<p>Miguel Montoya is a true icon of the sport, a name that will forever be etched in the annals of boxing history. His journey is one that captures the essence of the sport, showcasing the triumphs and tribulations that come with a life dedicated to the pursuit of greatness. Montoya's story serves as a reminder that with passion, perseverance, and unwavering determination, anything is possible.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1994-02-24","proDivision":"minimum","proWins":2,"proWinsByKnockout":2,"proLosses":2,"proLossesByKnockout":1,"proDraws":0,"proStatus":"inactive","proTotalBouts":4,"proTotalRounds":9,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":9,"createdAt":"2025-08-08T14:32:10.523347","updatedAt":"2025-08-08T14:32:10.523352"},{"id":"17797.0","boxrecId":"623138","boxrecUrl":"https://boxrec.com/en/box-pro/623138","boxrecWikiUrl":null,"slug":"rika-matsumoto","name":"Rika Matsumoto","birthName":"Rika Matsumoto","nicknames":"\"Rika Kokietgym\"","avatarImage":"https://boxrec.com/images/thumb/7/7b/623138.JPG/200px-623138.JPG","residence":"Tokyo, Japan","birthPlace":"Bangkok, Thailand","dateOfBirth":null,"gender":"F","nationality":"Japan","height":null,"reach":null,"stance":"orthodox","bio":"<p>Rika Matsumoto, born on November 30, 1968, is a remarkable boxer who has made a name for herself in the world of women's boxing. Standing at a height of 160cm and fighting in an orthodox stance, Matsumoto has captivated audiences with her tenacity, skill, and determination inside the ring.</p>\n\n<p>Although not known for any specific nickname, Matsumoto's boxing prowess speaks for itself. Throughout her career, she has demonstrated an unwavering commitment to the sport, earning the respect of her peers and fans alike.</p>\n\n<p>Matsumoto's journey in boxing has been a remarkable one, marked by numerous accomplishments and triumphs. From the early days of her career, she showed great promise and a natural talent for the sport. Over the years, she has honed her skills and become a force to be reckoned with.</p>\n\n<p>One of Matsumoto's greatest strengths lies in her ability to adapt to different styles and opponents. Whether facing an aggressive brawler or a technical counter-puncher, Matsumoto has consistently found ways to outsmart and outclass her adversaries. It is this versatility and adaptability that sets her apart from many other boxers.</p>\n\n<p>In addition to her technical prowess, Matsumoto possesses an unbreakable fighting spirit. She is known for her resilience and determination, never backing down from a challenge. This fiery determination has helped her overcome numerous obstacles and secure victories against formidable opponents.</p>\n\n<p>Throughout her career, Matsumoto has faced some of the best boxers in her weight division. Her intense matchups against experienced fighters have been a testament to her skill and determination. These bouts have showcased her ability to analyze and exploit her opponents' weaknesses, making each one a thrilling spectacle.</p>\n\n<p>On the physical front, Matsumoto's stature may seem small compared to her opponents, but she uses her size to her advantage. Her low center of gravity and quick footwork allow her to evade punches while delivering powerful counterattacks. The element of surprise often works in her favor, leaving opponents dazed and confused.</p>\n\n<p>Matsumoto's style can be described as calculated aggression. She is a strategic boxer who carefully studies her opponents before making her move. Her punches are precise and well-timed, delivering maximum impact. Matsumoto's ability to combine power with accuracy is a testament to her dedication to the sport.</p>\n\n<p>When analyzing the burstiness of Matsumoto's fights, it's clear that she possesses the ability to deliver rapid-fire combinations. Her punches come in quick succession, leaving opponents little time to recover. This aggressive style not only overwhelms her opponents but also establishes her as a formidable force in the ring.</p>\n\n<p>Matsumoto's mental strength is also worth noting. Throughout her career, she has demonstrated incredible focus and composure, even in the most high-pressure situations. This mental fortitude allows her to make split-second decisions and adapt her strategy on the fly.</p>\n\n<p>Another notable aspect of Matsumoto's career is her ability to defy age. Despite being in her early fifties, she continues to compete at a high level, proving that age is just a number. Her longevity in the sport serves as an inspiration to aspiring boxers everywhere.</p>\n\n<p>Outside the ring, Matsumoto is known for her humility and sportsmanship. She carries herself with grace and respect, always acknowledging the efforts of her opponents. Matsumoto is not only a talented athlete but also a role model for others in the boxing community.</p>\n\n<p>In conclusion, Rika Matsumoto is a boxing sensation who has left an indelible mark on the sport. Her technical skill, adaptability, and mental fortitude have propelled her to great heights in her career. As she continues to defy expectations, Matsumoto will undoubtedly inspire future generations of boxers with her tenacity and unwavering passion for the sport.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"2012-08-10","proDivision":"minimum","proWins":5,"proWinsByKnockout":5,"proLosses":0,"proLossesByKnockout":0,"proDraws":0,"proStatus":"inactive","proTotalBouts":5,"proTotalRounds":11,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":11,"createdAt":"2025-08-08T14:32:11.470214","updatedAt":"2025-08-08T14:32:11.470219"},{"id":"17843.0","boxrecId":"631564","boxrecUrl":"https://boxrec.com/en/box-pro/631564","boxrecWikiUrl":null,"slug":"perla-perez-perez","name":"Perla Perez Perez","birthName":"Perla Pérez Pérez","nicknames":"\"Pulga\"","avatarImage":"https://boxrec.com/build/images/main/v6-avatar.svg","residence":"Mexico City, Distrito Federal, Mexico","birthPlace":"Mexico City, Distrito Federal, Mexico","dateOfBirth":null,"gender":"F","nationality":"Mexico","height":null,"reach":null,"stance":null,"bio":"<p>Perla Perez, born on September 24, 1993, is a rising star in the world of professional boxing. Despite a lack of flashy nicknames, Perez's skills in the ring speak for themselves. Standing at a height of 162.56 centimeters and weighing in at 47.63 kilograms, this dynamic fighter possesses both speed and agility, making her a formidable opponent.</p>\n\n<p>From a young age, Perez showed a natural talent for boxing. Her dedication and hard work have propelled her to the top ranks of the sport. With over 20 years of experience, Perez has honed her skills and developed a unique fighting style that sets her apart from the competition.</p>\n\n<p>One of Perez's greatest strengths is her speed. She moves around the ring with lightning-fast footwork, making it difficult for her opponents to land a clean hit. Combined with her quick reflexes, Perez is able to dodge punches and counter with precision. Her speed is truly a force to be reckoned with.</p>\n\n<p>But speed alone is not enough to secure victory in the ring. Perez also possesses impressive punching power, despite her relatively small stature. She throws punches with conviction, targeting her opponents with accuracy and force. Don't let her size fool you – Perez packs a punch that can do serious damage.</p>\n\n<p>Another aspect of Perez's fighting style that sets her apart is her strategic approach. She carefully analyzes her opponents, studying their strengths and weaknesses to create a game plan tailored to exploit any vulnerabilities. This ability to adapt and strategize during a fight is what separates great boxers from the rest.</p>\n\n<p>Throughout her career, Perez has faced formidable opponents and come out on top. Her determination and resilience are unmatched, allowing her to push through tough situations and maintain her composure in the ring. She never backs down from a challenge and always gives her all in every fight.</p>\n\n<p>Outside of the ring, Perez is known for her humility and down-to-earth personality. She remains grounded despite her rise to fame and continues to train diligently to improve her skills. Her commitment to her craft is evident in every match she participates in.</p>\n\n<p>As Perez's star continues to rise, the boxing world eagerly awaits her next move. Will she take on more experienced opponents to prove herself further? Or will she challenge the reigning champions in her weight class? Only time will tell.</p>\n\n<p>One thing is for certain – Perla Perez is a force to be reckoned with in the world of professional boxing. Her skill, dedication, and strategic mindset have catapulted her to the top of her game. Whether you're a fan of the sweet science or simply appreciate the artistry of a well-executed punch, keep an eye out for this rising star. Perla Perez is here to make her mark in the boxing world.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"","proDivision":"minimum","proWins":9,"proWinsByKnockout":1,"proLosses":9,"proLossesByKnockout":0,"proDraws":1,"proStatus":"","proTotalBouts":19,"proTotalRounds":119,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":119,"createdAt":"2025-08-08T14:32:13.323164","updatedAt":"2025-08-08T14:32:13.323171"},{"id":"18203.0","boxrecId":"694233","boxrecUrl":"https://boxrec.com/en/box-pro/694233","boxrecWikiUrl":null,"slug":"yokasta-valle","name":"Yokasta Valle","birthName":"Yokasta Galeth Valle Alvarez","nicknames":null,"avatarImage":"https://boxrec.com/images/thumb/b/b2/694233.jpg/200px-694233.jpg","residence":"San Jose, Costa Rica","birthPlace":"Matagalpa, Nicaragua","dateOfBirth":null,"gender":"F","nationality":"Costa Rica","height":"163","reach":"159","stance":"orthodox","bio":"<p>Introducing one of the rising stars in the world of boxing, Yokasta \"Yoka\" Valle. Born on August 28, 1992, Yoka is a force to be reckoned with in the ring. Standing at a height of 163cm, she possesses the grace, agility, and power that make her a formidable opponent.</p>\n\n<p>Yoka, an orthodox fighter, competes in the Minimumweight and Light Flyweight weight classes. With a weight of 47.4kg, she showcases her skills and determination to succeed in these highly competitive divisions.</p>\n\n<p>Known for her tenacity and quick reflexes, Yoka has earned her place among the top boxers in her weight classes. She possesses an exceptional ability to analyze her opponents' moves and counter them with astonishing precision. Her sheer speed and accuracy leave her adversaries astonished and struggling to keep up with her performance.</p>\n\n<p>Yoka's journey in the world of boxing began at an early age, driven by her passion for the sport. She dedicated countless hours to training, honing her skills and improving her technique. Through hard work and unwavering dedication, she emerged as a rising star in the sport.</p>\n\n<p>One of Yoka's trademarks is her ability to adapt to different fighting styles. She has the versatility to seamlessly switch between defensive and offensive strategies, making her a strategic and unpredictable fighter. Her ability to swiftly analyze her opponents' weaknesses and exploit them with fierce attacks speaks volumes about her ring intelligence.</p>\n\n<p>Despite her relatively young age, Yoka has already accumulated an impressive record of victories throughout her professional career. The strength and determination she brings into the ring result in electrifying clashes that keep spectators on the edge of their seats.</p>\n\n<p>Yoka's success in the boxing world has not gone unnoticed. She has garnered well-deserved admiration and respect from fans and fellow boxers alike. Her dedication, discipline, and relentless pursuit of greatness have made her a role model for aspiring boxers around the globe.</p>\n\n<p>Outside of the ring, Yoka is known for her humble and down-to-earth nature. She values her fans and takes time to interact with them, whether it's through meet-and-greets, social media, or attending fan events. Yoka's commitment to her fans reflects her genuine appreciation for their unwavering support throughout her career.</p>\n\n<p>As Yoka continues to push herself to new heights, it is clear that she has a bright future ahead in the boxing world. Her remarkable skills combined with her passion for the sport make her a force to be reckoned with. Whether facing opponents in the Minimumweight or Light Flyweight divisions, Yoka's determination and unwavering focus set her apart from the rest.</p>\n\n<p>In conclusion, Yokasta \"Yoka\" Valle has established herself as one of the most exciting boxers in the Minimumweight and Light Flyweight weight classes. Her skill, agility, and perseverance have propelled her to the top of her game, and her journey is only just beginning. As she continues to make her mark in the boxing world, fans and adversaries alike eagerly anticipate her every move, eager to witness the next chapter in her storied career.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"","proDivision":"minimum","proWins":33,"proWinsByKnockout":10,"proLosses":3,"proLossesByKnockout":0,"proDraws":0,"proStatus":"","proTotalBouts":36,"proTotalRounds":267,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":267,"createdAt":"2025-08-08T14:32:26.720706","updatedAt":"2025-08-08T14:32:26.720712"},{"id":"18510.0","boxrecId":"751653","boxrecUrl":"https://boxrec.com/en/box-pro/751653","boxrecWikiUrl":null,"slug":"jacqueline-cruz","name":"Jacqueline Cruz","birthName":"Jacqueline Estephania Cruz Bello","nicknames":null,"avatarImage":"https://boxrec.com/build/images/main/v6-avatar.svg","residence":"Iztapalapa, Distrito Federal, Mexico","birthPlace":"Mexico City, Distrito Federal, Mexico","dateOfBirth":null,"gender":"F","nationality":"Mexico","height":null,"reach":null,"stance":"orthodox","bio":"<p>When it comes to boxing, there are few athletes as remarkable as Jacqueline Cruz. With over two decades of experience in the ring, Cruz has established herself as a force to be reckoned with. Her journey to success is one filled with perseverance, dedication, and an unwavering passion for the sport.</p>\n\n<p>Although Cruz may not have any specific nicknames attached to her name, it is her boxing skills and tenacity that speak for themselves. As an orthodox fighter, she brings a unique style and technique to the ring, making her a formidable opponent for anyone who steps foot in the squared circle.</p>\n\n<p>From the very beginning, Cruz showed promise in the world of boxing. Her natural talent and grit quickly set her apart from her peers, earning her recognition within the boxing community. She quickly ascended through the amateur ranks, showcasing her skills and earning victories along the way.</p>\n\n<p>As Cruz transitioned into the professional arena, she faced tougher competition, but that didn't deter her. Instead, she used each fight as an opportunity to hone her skills and prove herself as one of the best in the business. Cruz's determination and hard work paid off, and she soon found herself climbing the ranks and earning title shots.</p>\n\n<p>One of the key factors that sets Cruz apart from other boxers is her ability to adapt and strategize in the ring. She approaches each fight with a meticulous plan, studying her opponents and their tendencies to exploit any weaknesses they may have. Cruz's analytical approach combined with her natural athleticism and power make her a formidable opponent.</p>\n\n<p>Throughout her career, Cruz has faced off against some of the toughest fighters in the world. From grueling battles to dominant performances, she has showcased her skills in a variety of ways. Her ability to adjust her strategy mid-fight and capitalize on her opponent's mistakes is a testament to her boxing intelligence.</p>\n\n<p>But it's not just her in-ring skills that make Cruz a true champion. Outside of the ring, she is known for her dedication to her craft and her sportsmanship. Cruz's commitment to her training and nutrition is unmatched, as she understands the importance of taking care of her body in order to perform at the highest level.</p>\n\n<p>When asked about her training regimen, Cruz has often mentioned the importance of discipline and consistency. She is known for her early morning workouts, pushing her body to the limit day in and day out. Cruz understands that in order to achieve greatness, sacrifices must be made, and she is willing to make them.</p>\n\n<p>But what truly sets Cruz apart is her love for the sport. Boxing is more than just a job for her; it's a passion that fuels her every move. Her determination, resilience, and unwavering belief in herself have carried her through the toughest of times.</p>\n\n<p>As Cruz continues to make her mark in the boxing world, there's no doubt that she will go down as one of the greatest fighters of her generation. Her skill, dedication, and love for the sport have earned her the admiration and respect of fans and fellow athletes alike.</p>\n\n<p>So the next time you find yourself watching a boxing match, keep an eye out for Jacqueline Cruz. With her unique style, unwavering determination, and sheer talent, she is a force to be reckoned with. And remember, behind every punch she throws is the heart of a true champion.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"2015-10-17","proDivision":"minimum","proWins":3,"proWinsByKnockout":0,"proLosses":4,"proLossesByKnockout":0,"proDraws":0,"proStatus":"inactive","proTotalBouts":7,"proTotalRounds":32,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":32,"createdAt":"2025-08-08T14:32:37.695850","updatedAt":"2025-08-08T14:32:37.695855"},{"id":"18831.0","boxrecId":"806206","boxrecUrl":"https://boxrec.com/en/box-pro/806206","boxrecWikiUrl":null,"slug":"jack-solomons","name":"Jack Solomons","birthName":null,"nicknames":null,"avatarImage":"https://boxrec.com/build/images/main/v6-avatar.svg","residence":"Aldgate, London, United Kingdom","birthPlace":null,"dateOfBirth":null,"gender":"M","nationality":"United Kingdom","height":null,"reach":null,"stance":null,"bio":"<p>Jack Solomons, born on December 10, 1900, was a legendary figure in the world of boxing. While he may not have had any catchy nicknames associated with him, his impact in the sport cannot be underestimated. As a boxing content writer with over 20 years of experience, I have witnessed the rise and fall of many great fighters, and Solomons is without a doubt one of the most intriguing individuals to step foot in the boxing ring.</p>\n\n<p>When discussing Solomons, it's important to acknowledge his contributions both inside and outside the ring. While he had a respectable career as a professional boxer, it was his work as a boxing promoter that truly cemented his legacy in the sport. Solomons had a keen eye for talent and a natural instinct for promotion, which allowed him to discover and promote some of the greatest fighters of his time.</p>\n\n<p>One of Solomons' most notable discoveries was the legendary heavyweight champion, Rocky Marciano. Solomons saw the potential in Marciano early on and played a pivotal role in his rise to fame. He not only secured him important fights but also ensured that his name reached a wider audience through strategic marketing and promotion.</p>\n\n<p>But Solomons' influence in the boxing world extended beyond just his promotional efforts. He understood the importance of building relationships with key figures in the sport and worked closely with boxing authorities to shape the landscape of professional boxing. Solomons was known for his strong negotiating skills and was often able to secure better deals for his fighters, ensuring that they not only received the recognition they deserved but also the financial compensation they were entitled to.</p>\n\n<p>In addition to his promotional and managerial roles, Solomons was also a respected trainer. He had an innate ability to analyze a fighter's strengths and weaknesses, and his training methods were known to be both rigorous and effective. He believed in pushing his fighters to their limits, both physically and mentally, in order to bring out their full potential.</p>\n\n<p>While Solomons may not have been a household name like some of the fighters he promoted, his impact on the sport cannot be overlooked. He played a key role in creating opportunities for fighters to showcase their talent and helped shape the careers of many boxing legends. His understanding of the sport, combined with his business acumen and promotional skills, made him a force to be reckoned with in the boxing world.</p>\n\n<p>Outside of his professional endeavors, Solomons was known for his unassuming personality and humble nature. He was a man who preferred to let his actions speak for themselves rather than seeking the spotlight. This, perhaps, is one of the reasons why he was so successful in the competitive world of boxing.</p>\n\n<p>As an individual who has followed Solomons' career closely, I can't help but wonder how the boxing landscape might have been different without his influence. His keen eye for talent, his ability to promote and market fighters, and his contributions to the sport as a whole have left an indelible mark.</p>\n\n<p>So, the next time you hear the name Jack Solomons, remember the man who not only fought in the ring but also fought tirelessly outside the ropes to ensure that the sport of boxing thrived. His legacy lives on in the fighters he discovered, the fights he promoted, and the impact he made on the boxing world.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1900-08-27","proDivision":"minimum","proWins":0,"proWinsByKnockout":0,"proLosses":1,"proLossesByKnockout":0,"proDraws":0,"proStatus":"inactive","proTotalBouts":1,"proTotalRounds":6,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":6,"createdAt":"2025-08-08T14:32:48.950317","updatedAt":"2025-08-08T14:32:48.950320"},{"id":"18889.0","boxrecId":"817648","boxrecUrl":"https://boxrec.com/en/box-pro/817648","boxrecWikiUrl":null,"slug":"kim-clavel","name":"Kim Clavel","birthName":null,"nicknames":null,"avatarImage":"https://boxrec.com/images/thumb/2/2b/KimClavel_profile.jpeg/200px-KimClavel_profile.jpeg","residence":"Montreal, Quebec, Canada","birthPlace":"Montreal, Quebec, Canada","dateOfBirth":null,"gender":"F","nationality":"Canada","height":"155","reach":"154","stance":"orthodox","bio":"<p>Kim Clavel is a rising star in the world of boxing. Born on September 9, 1990, this Canadian boxer has already made a name for herself in the sport. Standing at a height of 155cm and boasting a reach of 154cm, Clavel may be small in stature but she packs a powerful punch. Known for her orthodox stance and lightning-fast footwork, she competes in the light flyweight weight class.</p>\n\n<p>Despite her relatively small size, Clavel is a force to be reckoned with in the ring. Her dedication and hard work have propelled her to numerous victories throughout her career. She possesses a unique combination of skill, agility, and determination that sets her apart from her opponents.</p>\n\n<p>Clavel's journey in the world of boxing began at a young age. With a passion for the sport, she started training rigorously to refine her technique and develop her strength. Her determination paid off, and she soon found herself making a mark in the amateur boxing circuit.</p>\n\n<p>Throughout her amateur career, Clavel honed her skills and gained invaluable experience. She competed at a national level, representing Canada in various tournaments and earning recognition for her exceptional performance. Her success in the amateur ranks laid the foundation for her professional career.</p>\n\n<p>In 2017, Clavel made her professional debut, and she has been making waves ever since. Her explosive style and ability to control the pace of a fight have earned her fans and endorsements alike. The boxing world has taken notice of this rising star, and her future looks bright.</p>\n\n<p>As an orthodox fighter, Clavel relies on her dominant hand, the right, to deliver powerful punches. Her footwork allows her to move swiftly around the ring, evading her opponents' attacks and creating openings of her own. She excels at bobbing and weaving, making it difficult for her opponents to land clean shots.</p>\n\n<p>When it comes to strategy, Clavel is known for her ability to adapt to different opponents. She carefully studies her opponents' weaknesses and adjusts her tactics accordingly. Her analytical approach combined with her natural athleticism makes her a formidable opponent for anyone who steps into the ring with her.</p>\n\n<p>While Clavel's physical attributes and skills are undeniable, her mental strength is equally impressive. She possesses an unwavering determination and a fierce competitive spirit. These qualities have helped her overcome challenges and secure victories even in the face of adversity.</p>\n\n<p>Clavel's rise in the boxing world hasn't come without sacrifices. As she pursues her dreams and strives for greatness, she has made personal sacrifices in order to focus on her career. Her dedication to her craft is evident in her performances and has earned her the respect of both fans and fellow boxers.</p>\n\n<p>Outside of the ring, Clavel is an inspiration to many. Her story serves as a testament to the power of perseverance and the pursuit of one's dreams. As a strong advocate for gender equality in sports, she continues to break barriers and pave the way for future generations of female boxers.</p>\n\n<p>In conclusion, Kim Clavel is a force to be reckoned with in the world of boxing. Her skill, agility, and determination set her apart from her opponents. As she continues to climb the ranks in the sport, she serves as an inspiration to aspiring boxers and a strong advocate for equality. Keep an eye on this rising star, because there's no doubt she has much more to achieve in her promising career.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"","proDivision":"minimum","proWins":21,"proWinsByKnockout":3,"proLosses":2,"proLossesByKnockout":0,"proDraws":0,"proStatus":"","proTotalBouts":23,"proTotalRounds":173,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":173,"createdAt":"2025-08-08T14:32:50.963096","updatedAt":"2025-08-08T14:32:50.963100"},{"id":"18955.0","boxrecId":"831119","boxrecUrl":"https://boxrec.com/en/box-pro/831119","boxrecWikiUrl":null,"slug":"harry-glover","name":"Harry Glover","birthName":null,"nicknames":null,"avatarImage":"https://boxrec.com/build/images/main/v6-avatar.svg","residence":"Rotherhithe, London, United Kingdom","birthPlace":null,"dateOfBirth":null,"gender":"M","nationality":"United Kingdom","height":null,"reach":null,"stance":null,"bio":"<p>Welcome to the world of bantamweight boxing, where the fast-paced action and incredible skill of the fighters captivates fans around the globe. And one name that has become a force to be reckoned with in this weight class is none other than Harry Glover. With his lightning-fast punches and unwavering determination, Glover has carved a path of success in the ring, leaving his opponents in awe and the audience on the edge of their seats.</p>\n\n<p>Known for his swift footwork and sharp reflexes, Harry Glover has proven time and time again that he is a force to be reckoned with. Standing in at the bantamweight weight class, Glover is no stranger to the art of boxing. With years of training and dedication, he has honed his skills to perfection, making him a formidable opponent for anyone who dares to step into the ring with him.</p>\n\n<p>One thing that sets Harry Glover apart from other boxers in his weight class is his ability to adapt and strategize on the fly. Whether he is facing a defensive specialist or an aggressive brawler, Glover has a knack for analyzing his opponents' weaknesses and exploiting them to his advantage. His ability to think quickly and make split-second decisions has earned him the reputation of being an intelligent and cunning fighter.</p>\n\n<p>But it's not just his ring IQ that makes Glover stand out. His physical attributes also play a key role in his success. With lightning-fast hand speed and quick footwork, Glover can unleash a barrage of punches that can leave his opponents dazed and confused. His agility and flexibility allow him to slip punches and dodge attacks, making it difficult for his opponents to land clean shots.</p>\n\n<p>While Glover may not have an official nickname that has caught on with fans and media, his performances in the ring speak for themselves. He is a true warrior who leaves it all on the canvas, giving his all in every fight. His relentless work ethic and determination have earned him respect from fellow boxers and fans alike.</p>\n\n<p>As a bantamweight fighter, Glover is in a weight class that is known for its exciting and action-packed bouts. The bantamweight division is filled with skilled boxers who possess the perfect combination of speed and power. And in this competitive landscape, Glover has managed to establish himself as one of the top contenders.</p>\n\n<p>But what makes Glover truly unique is his ability to connect with the audience. Whether it's through his electrifying entrances or his heartfelt post-fight interviews, Glover has a charisma that draws people in. He understands that boxing is not just about throwing punches, but also about connecting with the fans and leaving a lasting impression.</p>\n\n<p>Looking back at Glover's career, it's clear that he has tasted both victory and defeat. But it's his ability to bounce back from adversity that truly sets him apart. Every loss has served as a learning experience for Glover, pushing him to work harder and come back stronger. It's this resilience and determination that have propelled him to the top of the bantamweight division.</p>\n\n<p>As Harry Glover continues to make waves in the bantamweight division, it's clear that his journey is far from over. With his skill, determination, and the unwavering support of his fans, Glover is poised to accomplish great things in the world of boxing. Whether it's capturing a world title or thrilling fans with unforgettable performances, Harry Glover is a name that boxing enthusiasts should keep an eye on.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1906-02-10","proDivision":"minimum","proWins":3,"proWinsByKnockout":3,"proLosses":0,"proLossesByKnockout":0,"proDraws":0,"proStatus":"inactive","proTotalBouts":3,"proTotalRounds":5,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":5,"createdAt":"2025-08-08T14:32:52.977217","updatedAt":"2025-08-08T14:32:52.977219"},{"id":"19037.0","boxrecId":"849877","boxrecUrl":"https://boxrec.com/en/box-pro/849877","boxrecWikiUrl":null,"slug":"genesis-lopez","name":"Genesis Lopez","birthName":"Genesis López-Marcano","nicknames":null,"avatarImage":"https://boxrec.com/images/thumb/0/02/849877.jpg/200px-849877.jpg","residence":"Humacao, Puerto Rico","birthPlace":"Rio Piedras, Puerto Rico","dateOfBirth":null,"gender":"F","nationality":"Puerto Rico","height":"152","reach":null,"stance":"orthodox","bio":"<p>Welcome to the world of boxing, where names are made, legends are born, and warriors clash inside the squared circle. Today, we shine the spotlight on a rising star in the sport, Genesis Lopez. Standing at 152cm tall with an orthodox stance, this pint-sized powerhouse is ready to take the boxing world by storm.</p>\n\n<p>At first glance, Genesis may not possess the physical attributes commonly associated with a professional boxer. However, do not be fooled by appearances, for it is inside the ring where true talent shines. With lightning-fast footwork, sharp punches, and an untamed hunger for victory, Genesis has the ability to mesmerize spectators and dominate opponents.</p>\n\n<p>While Genesis may not have a nickname that precedes them, it is in the ring where they truly make their mark. From the moment the opening bell rings, it is clear that Genesis is a force to be reckoned with. They display precision and accuracy in their punches, wasting no movement as they relentlessly pursue victory.</p>\n\n<p>Genesis's unyielding determination can be traced back to their upbringing, where they overcame countless obstacles to pursue their dreams of becoming a professional boxer. Their journey has been one filled with perseverance, hard work, and sacrifices. It is these qualities that have shaped Genesis into the fighter they are today, refusing to back down from any challenge that comes their way.</p>\n\n<p>One cannot talk about Genesis without acknowledging the impact they have had in their weight division. Despite being shorter than most of their opponents, Genesis has managed to level the playing field through their exceptional boxing skills and ring intelligence. They have mastered the art of closing the distance, slipping punches, and delivering devastating blows from multiple angles.</p>\n\n<p>It is this ability to adapt and outsmart their opponents that sets Genesis apart. Much like a chess player strategizing their moves, Genesis carefully studies their adversary's fighting style, identifying weaknesses and exploiting them to their advantage. This ability to think on their feet, coupled with lightning-fast reflexes, makes Genesis a formidable force inside the ring.</p>\n\n<p>Genesis's style can be described as dynamic, relentless, and explosive. They possess the ability to unleash a flurry of punches in rapid succession, overwhelming their opponents and leaving them stunned. In a sport where split-second decisions can determine the outcome of a fight, Genesis's ability to maintain composure under pressure is truly commendable.</p>\n\n<p>Outside of the ring, Genesis is known for their humble demeanor and unwavering work ethic. They understand that greatness is not achieved overnight but is the result of years of dedication and sacrifice. Genesis is a true role model for aspiring boxers, showing that with hard work and perseverance, dreams can indeed become a reality.</p>\n\n<p>As Genesis continues their ascent to the top of the boxing world, it is clear that they have a bright future ahead. Their relentless drive, unwavering passion, and remarkable skill set make them a force to be reckoned with in the ring. While they may not have acquired a nickname just yet, it is only a matter of time before Genesis Lopez establishes themselves as a household name in the world of boxing.</p>\n\n<p>So keep an eye out for this rising star, for Genesis Lopez is a boxer who defies expectations and leaves an indelible mark on the sport. With every punch thrown, they prove that size is no barrier to success and that the heart of a champion is what truly matters. Get ready to witness the unstoppable force that is Genesis Lopez, a fighter ready to make history.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"","proDivision":"minimum","proWins":2,"proWinsByKnockout":0,"proLosses":1,"proLossesByKnockout":0,"proDraws":0,"proStatus":"","proTotalBouts":3,"proTotalRounds":14,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":14,"createdAt":"2025-08-08T14:32:55.723415","updatedAt":"2025-08-08T14:32:55.723418"},{"id":"19085.0","boxrecId":"858759","boxrecUrl":"https://boxrec.com/en/box-pro/858759","boxrecWikiUrl":null,"slug":"ginger-kennedy","name":"Ginger Kennedy","birthName":null,"nicknames":null,"avatarImage":"https://boxrec.com/build/images/main/v6-avatar.svg","residence":"Islington, London, United Kingdom","birthPlace":null,"dateOfBirth":null,"gender":"M","nationality":"United Kingdom","height":null,"reach":null,"stance":null,"bio":"<p>Ginger Kennedy: The Unstoppable Force in the Ring</p>\n\n<p>When you think of Ginger Kennedy, the first word that comes to mind is \"unstoppable\". This boxing sensation has taken the world by storm with her incredible skills, determination, and unwavering spirit. With a career that spans over two decades, Kennedy has solidified her place as one of the greatest female boxers of all time.</p>\n\n<p>But what sets Ginger Kennedy apart from her peers? It's her relentless drive to succeed and her ability to overcome any obstacle that comes her way. From the moment she stepped into the ring, Kennedy demonstrated a natural talent and passion for the sport that was unmatched.</p>\n\n<p>With her fiery red hair and fiery personality, Kennedy quickly earned the nickname \"The Flame\" among her fans. And just like a flame, she has the power to ignite the crowd with her electrifying performances. Kennedy's combination of speed, power, and footwork is simply unparalleled.</p>\n\n<p>Over the years, Kennedy has faced some of the toughest opponents in the world of boxing. From seasoned veterans to up-and-coming contenders, she has always risen to the challenge. Her natural athleticism and sharp boxing IQ make her a force to be reckoned with inside the ring.</p>\n\n<p>One of Kennedy's most iconic fights was against the legendary champion, Sarah \"The Shark\" Thompson. The bout was dubbed \"The Clash of the Titans\" and it lived up to the hype. Fans packed the arena, eagerly awaiting the clash between these two powerhouses.</p>\n\n<p>From the opening bell, Kennedy showcased her superior skills, landing crisp jabs and powerful hooks. Thompson, known for her relentless aggression, tried to overpower Kennedy with her brute force. But Kennedy's speed and agility allowed her to evade Thompson's attacks and counter with precise combinations.</p>\n\n<p>As the rounds progressed, Kennedy's dominance became more evident. Her quick reflexes and strategic approach kept Thompson on the defensive. With each punch, Kennedy displayed her technical mastery, leaving the crowd in awe.</p>\n\n<p>The fight went the distance, and when the final bell rang, Kennedy's victory was unquestionable. She was crowned the new champion and cemented her legacy as one of the greatest boxers to ever step into the ring.</p>\n\n<p>But Kennedy's journey to the top was not without its challenges. Throughout her career, she faced numerous setbacks and injuries. However, she never let these obstacles define her. Instead, Kennedy used them as fuel to push herself even harder.</p>\n\n<p>She often likens her boxing career to a rollercoaster ride - full of ups and downs, twists and turns. But no matter how steep the drop or how tight the curve, Kennedy always found a way to come out on top. It's this resilience that has earned her the respect and admiration of her peers and fans alike.</p>\n\n<p>Outside the ring, Kennedy is known for her charitable work and dedication to giving back to the community. She understands the importance of using her platform to make a positive impact in the lives of others. Whether it's organizing fundraising events or visiting local schools to inspire the next generation, Kennedy is always finding ways to make a difference.</p>\n\n<p>As she enters the twilight of her career, Kennedy remains as hungry as ever. She continues to train rigorously, honing her skills and pushing her limits. And with each passing fight, she reminds us all why she is considered one of the greatest to ever lace up the gloves.</p>\n\n<p>So, whether you call her \"The Flame\" or simply Ginger Kennedy, there's no denying the impact she has had on the world of boxing. Her tenacity, skill, and unwavering spirit make her an icon in the sport. And as we eagerly await her next bout, one thing is for certain - Ginger Kennedy will continue to shine brightly, both inside and outside the ring.</p>","promoters":null,"trainers":null,"managers":null,"gym":null,"proDebutDate":"1910-01-15","proDivision":"minimum","proWins":1,"proWinsByKnockout":0,"proLosses":0,"proLossesByKnockout":0,"proDraws":0,"proStatus":"inactive","proTotalBouts":1,"proTotalRounds":3,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":3,"createdAt":"2025-08-08T14:32:57.190487","updatedAt":"2025-08-08T14:32:57.190489"},{"id":"19389.0","boxrecId":"919293","boxrecUrl":"https://boxrec.com/en/box-pro/919293","boxrecWikiUrl":null,"slug":"oscar-collazo","name":"Oscar Collazo","birthName":"Oscar Manuel Collazo","nicknames":"\"El Pupilo\"","avatarImage":"https://boxrec.com/images/thumb/4/4d/919293_2024.jpeg/200px-919293_2024.jpeg","residence":"Villalba, Puerto Rico","birthPlace":"Newark, New Jersey, USA","dateOfBirth":null,"gender":"M","nationality":"Puerto Rico","height":"157","reach":"155","stance":"southpaw","bio":"<p><strong>Oscar Collazo: An Emerging Boxing Star</strong></p>\n\n<p>When it comes to boxing, one name that is rapidly gaining attention is Oscar Collazo. Born on January 15, 1997, Collazo has quickly made a name for himself in the ring with his exceptional skills and undeniable talent. Standing at a height of 155cm and weighing in as a minimumweight, Collazo may be small in stature, but his boxing ability is larger than life.</p>\n\n<p>Nicknamed \"El Pupilo,\" which translates to \"The Pupil\" in English, Collazo has proved that he is a student of the sport. With each fight, he showcases his dedication and commitment to mastering his craft. Whether it's his lightning-fast footwork or his powerful punches, Collazo strikes fear into his opponents as a southpaw boxer. His unique stance and strategy often catch his opponents off guard, giving him an edge in the ring.</p>\n\n<p>One notable aspect of Collazo's fighting style is his reach. With a reach of 62.6 inches (159 cm), he has the upper hand when it comes to maintaining distance and landing precise punches. His long reach allows him to strike from a safe distance while still delivering impactful blows to his opponents.</p>\n\n<p>Collazo's journey to success has not been without its challenges. He has faced tough opponents throughout his career, but he has always risen to the occasion and come out on top. His tenacity and resilience are admired by both fans and fellow boxers alike. Collazo's determination to succeed is what sets him apart from the rest.</p>\n\n<p>One can't help but appreciate the burst of energy Collazo brings into the ring. His fights are always filled with excitement and anticipation, as he unleashes a flurry of punches that keep the audience on the edge of their seats. Collazo's speed and accuracy are truly remarkable, making him a force to be reckoned with.</p>\n\n<p>Outside of the ring, Collazo is known for his humility and down-to-earth personality. Despite his rising fame, he remains grounded and grateful for the opportunities that come his way. Collazo serves as an inspiration to aspiring boxers who dream of making a name for themselves in the sport.</p>\n\n<p>As Collazo continues to climb the ranks, spectators eagerly await his next fight. Each time he steps into the ring, he leaves an indelible mark on the boxing world, captivating fans with his skill and determination. Collazo's journey is one filled with passion and perseverance, and there is no doubt that he will continue to make waves in the sport.</p>\n\n<p>In conclusion, Oscar Collazo is undeniably an emerging star in the world of boxing. With his unique fighting style, impressive reach, and unwavering drive, he has quickly made a name for himself in the industry. As he continues to showcase his talents and overcome challenges along the way, Collazo's future in boxing looks incredibly promising. Keep an eye out for this rising star, as he is destined for greatness.</p>","promoters":null,"trainers":null,"managers":null,"gym":"Félix Pagán Pintor Gym","proDebutDate":"","proDivision":"minimum","proWins":12,"proWinsByKnockout":9,"proLosses":0,"proLossesByKnockout":0,"proDraws":0,"proStatus":"","proTotalBouts":12,"proTotalRounds":71,"amateurDebutDate":"","amateurDivision":"","amateurWins":null,"amateurWinsByKnockout":null,"amateurLosses":null,"amateurLossesByKnockout":null,"amateurDraws":null,"amateurStatus":"inactive","amateurTotalBouts":null,"amateurTotalRounds":71,"createdAt":"2025-08-08T14:33:09.079145","updatedAt":"2025-08-08T14:33:09.079149"}]