{
  "id": "15420.0",
  "boxrecId": "134484",
  "boxrecUrl": "https://boxrec.com/en/box-pro/134484",
  "boxrecWikiUrl": null,
  "slug": "sergio-martinez",
  "name": "Sergio Martinez",
  "birthName": null,
  "nicknames": null,
  "avatarImage": "/boxing/images/boxers/sergio-martinez.jpg",
  "residence": null,
  "birthPlace": null,
  "dateOfBirth": null,
  "gender": "M",
  "nationality": "Mexico",
  "height": null,
  "reach": null,
  "stance": null,
  "bio": "<p>Sergio Martinez, also known as \"Maravilla,\" is a boxing sensation hailing from Argentina. While many great boxers have emerged from Mexico, Sergio's talent lies in the middleweight division, making him a formidable opponent in the ring.</p>\n\n<p>Although Sergio Martinez does not possess a nickname, it is important to note that he is not from Mexico but rather from Argentina. His Argentinian heritage adds a unique flavor to his style, setting him apart from other fighters in his weight class.</p>\n\n<p>In the middleweight division, where fighters must weigh between 154 and 160 pounds, Sergio Martinez has proven to be a force to be reckoned with. This weight class showcases some of the most skilled boxers in the world, making competition fierce and exhilarating for both fighters and fans alike.</p>\n\n<p>What sets Sergio Martinez apart from his competitors is his exceptional speed and footwork. Known for his elusiveness and slick defensive maneuvers, he often frustrates his opponents by evading their punches with ease. This cat-like agility allows him to deliver lightning-fast counterattacks, catching his opponents off guard and leaving them vulnerable.</p>\n\n<p>But Sergio Martinez isn't just a defensive genius; he also possesses knockout power that is truly awe-inspiring. His punches are known to be lightning bolts, capable of striking with precision and immense force. When Martinez connects, his opponents can feel the full impact, often receiving a one-way ticket to the canvas.</p>\n\n<p>One of Sergio Martinez's most impressive attributes is his ability to adapt to any situation in the ring. Whether facing an aggressive brawler or a technical mastermind, he has the intelligence and skill set to adjust his strategy accordingly. This adaptability allows him to exploit his opponents' weaknesses and capitalize on their mistakes, ultimately leading to victory.</p>\n\n<p>Throughout his illustrious career, Sergio Martinez has faced some of the toughest fighters in the middleweight division. From Kelly Pavlik to Paul Williams, he has gone toe-to-toe with boxing's elite, proving himself time and time again.</p>\n\n<p>One of Martinez's most memorable fights came against the formidable Julio Cesar Chavez Jr. In a thrilling battle, Sergio showcased his superior skills, dominating Chavez Jr. for the majority of the fight. Despite suffering a late knockdown, Martinez emerged victorious, solidifying his place as one of the best middleweights of his time.</p>\n\n<p>But it wasn't just his in-ring abilities that endeared Sergio Martinez to his fans. His charismatic personality and humble demeanor have made him a beloved figure in the world of boxing. Martinez's genuine love for the sport and his unwavering dedication to his craft have earned the respect of both fans and fellow boxers.</p>\n\n<p>Unfortunately, Sergio Martinez's career was marred by injuries, forcing him to take a prolonged break from the sport. However, his indomitable spirit and relentless determination saw him make a remarkable comeback in 2020.</p>\n\n<p>At the age of 45, Sergio Martinez defied the odds and stepped back into the ring, demonstrating that age is just a number. While time may have taken a toll on his physical abilities, his boxing IQ and experience remain unparalleled.</p>\n\n<p>As Sergio Martinez continues his boxing journey, fans can expect nothing but heart-stopping action and mesmerizing displays of skill. His story serves as a reminder that passion and perseverance can conquer any obstacle, inspiring aspiring fighters around the globe.</p>\n\n<p>Sergio \"Maravilla\" Martinez, the Argentine marvel, is a testament to the beauty and brutality of boxing. With his lightning speed and knockout power, he has left an indelible mark on the middleweight division. Whether it's his dazzling footwork or his ability to adapt, Martinez embodies what it means to be a true boxing champion.</p>",
  "promoters": null,
  "trainers": null,
  "managers": null,
  "gym": null,
  "proDebutDate": "1996-04-12",
  "proDivision": "light",
  "proWins": 0,
  "proWinsByKnockout": 0,
  "proLosses": 2,
  "proLossesByKnockout": 2,
  "proDraws": 0,
  "proStatus": "inactive",
  "proTotalBouts": 2,
  "proTotalRounds": 3,
  "amateurDebutDate": "",
  "amateurDivision": "",
  "amateurWins": null,
  "amateurWinsByKnockout": null,
  "amateurLosses": null,
  "amateurLossesByKnockout": null,
  "amateurDraws": null,
  "amateurStatus": "inactive",
  "amateurTotalBouts": null,
  "amateurTotalRounds": 3,
  "createdAt": "2025-08-08T14:30:29.282176",
  "updatedAt": "2025-08-08T14:30:29.282179",
  "bouts": "[{\"boxerId\": \"134484\", \"boxrecId\": \"1053278\", \"boutDate\": \"Mar 98\", \"opponentName\": \"Alejandro Ramirez\", \"opponentWeight\": null, \"opponentRecord\": null, \"eventName\": \"\", \"refereeName\": null, \"judge1Name\": null, \"judge1Score\": null, \"judge2Name\": null, \"judge2Score\": null, \"judge3Name\": null, \"judge3Score\": null, \"numRoundsScheduled\": null, \"result\": \"loss\", \"resultMethod\": null, \"resultRound\": null, \"eventPageLink\": null, \"boutPageLink\": \"https://boxrec.com/en/event/208784/1053278\", \"scorecardsPageLink\": null, \"titleFight\": false}, {\"boxerId\": \"134484\", \"boxrecId\": \"76527\", \"boutDate\": \"Apr 96\", \"opponentName\": \"Efren Hinojosa\", \"opponentWeight\": null, \"opponentRecord\": null, \"eventName\": \"Mexico City\", \"refereeName\": null, \"judge1Name\": null, \"judge1Score\": null, \"judge2Name\": null, \"judge2Score\": null, \"judge3Name\": null, \"judge3Score\": null, \"numRoundsScheduled\": null, \"result\": \"loss\", \"resultMethod\": null, \"resultRound\": null, \"eventPageLink\": null, \"boutPageLink\": \"https://boxrec.com/en/event/48671/76527\", \"scorecardsPageLink\": null, \"titleFight\": false}]"
}
