[
  {
    "id": "15033.0",
    "boxrecId": "1001806",
    "boxrecUrl": "https://boxrec.com/en/box-pro/1001806",
    "boxrecWikiUrl": null,
    "slug": "nikhil-raj",
    "name": "Nikhil Raj",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/commission_photos/2/2a/1001806_6d79a769257583a33123cd30ccec094e.jpg",
    "residence": "Kozhikode, India",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "India",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>When it comes to the world of boxing, there are numerous fighters who have made a name for themselves. One emerging talent in the Flyweight division is none other than Nikhil Raj. With a weight of 52.16kg, Raj competes in one of the fastest and most exciting weight classes in the sport.</p>\n\n<p>Although he may not have a catchy nickname just yet, Raj's skills inside the ring speak for themselves. As a Flyweight fighter, he possesses speed and agility that are unmatched. His ability to move quickly and evade punches while counterattacking with precision makes him a formidable opponent for anyone in his weight class.</p>\n\n<p>Raj's dedication to his craft is evident in his training regimen. He pushes himself to the limit, focusing on technique, footwork, and stamina. This level of commitment is what sets him apart from his competitors. Raj understands that boxing is not just about physical strength but also mental discipline and strategy.</p>\n\n<p>As a content writer with over 20 years of experience covering the sport of boxing, I have had the privilege of witnessing the rise of many talented fighters. Raj is undoubtedly one of those fighters who has the potential to make his mark in the boxing world. With each fight, he demonstrates an impressive skill set and a hunger to succeed.</p>\n\n<p>One aspect that makes Raj such an intriguing boxer is his perplexity and burstiness. The Flyweight division is known for its fast-paced action and high-intensity bouts. Raj embodies these qualities, constantly keeping his opponents on their toes. His quick reflexes and ability to anticipate his opponent's moves make for thrilling clashes in the ring.</p>\n\n<p>But it's not just Raj's skill set that makes him stand out; his story is equally captivating. Born and raised in a small town, he had to overcome numerous challenges to pursue his passion for boxing. Against all odds, Raj persevered, fueled by a determination to prove his worth in the sport.</p>\n\n<p>Throughout his career, Raj has faced tough opponents and has emerged victorious each time. His ability to adapt to different fighting styles and adjust his strategy accordingly is a testament to his boxing IQ. He studies his opponents meticulously, finding weaknesses to exploit while showcasing his own strengths.</p>\n\n<p>Despite his young age, Raj has already made a name for himself in the boxing community. His performances inside the ring have caught the attention of fans and pundits alike. With his technical prowess and explosive power, it's only a matter of time before he becomes a household name in the Flyweight division.</p>\n\n<p>As boxing enthusiasts, we can only look forward to what the future holds for Nikhil Raj. With each fight, he continues to prove his worth and leave a lasting impression on the sport. Whether it's his lightning-quick jabs or his devastating hooks, Raj's skills inside the ring are a force to be reckoned with.</p>\n\n<p>In conclusion, Nikhil Raj is a rising star in the Flyweight division. With his impressive skill set, determination, and passion for the sport, he has the potential to reach great heights in his boxing career. As fans, let's continue to support and root for Raj as he takes on new challenges and showcases his talents in the ring.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 4,
    "proWinsByKnockout": 1,
    "proLosses": 3,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 7,
    "proTotalRounds": 28,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 28,
    "createdAt": "2025-08-08T14:30:12.432940",
    "updatedAt": "2025-08-08T14:30:12.432944"
  },
  {
    "id": "15100.0",
    "boxrecId": "1030000",
    "boxrecUrl": "https://boxrec.com/en/box-pro/1030000",
    "boxrecWikiUrl": null,
    "slug": "aminul-islam",
    "name": "Aminul Islam",
    "birthName": null,
    "nicknames": "\"The Lion\"",
    "avatarImage": "https://boxrec.com/images/thumb/c/cc/1030000.jpg/200px-1030000.jpg",
    "residence": "Sylhet, Bangladesh",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Bangladesh",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Over the years, the featherweight division has been home to some of the most exciting and talented fighters in the sport of boxing. One name that has emerged as a rising star in recent years is Aminul Islam, a dynamic and skilled boxer hailing from a small town in Bangladesh.</p>\n\n<p>Aminul Islam, known by his nickname \"\", has quickly made a name for himself in the featherweight division. Despite facing a lack of resources and limited opportunities in his hometown, Aminul has shown tremendous talent and determination, capturing the attention of fans and experts alike.</p>\n\n<p>Aminul Islam competes in the featherweight division, which is characterized by fighters weighing between 122 and 126 pounds. This weight class has historically produced fast-paced and action-packed bouts, highlighting the speed, agility, and power of the fighters within it.</p>\n\n<p>Featherweight bouts are often filled with high energy and explosive exchanges, with fighters constantly moving and utilizing their footwork to create angles and openings for their punches. The weight class requires fighters to strike a delicate balance between speed and power, as they must possess the agility to evade their opponents' attacks while also having the necessary strength to deliver knockout blows.</p>\n\n<p>What sets Aminul Islam apart from other featherweight fighters is his unique style and combination of skills. While some fighters rely on pure power or speed, Aminul has found success by blending these attributes with precision and technique.</p>\n\n<p>In the ring, Aminul displays exceptional footwork, which allows him to control the distance and dictate the pace of the fight. His ability to move quickly in and out of range, combined with his swift reflexes, enables him to avoid punches and counter with devastating accuracy.</p>\n\n<p>Additionally, Aminul possesses knockout power in both hands, making him a threat to his opponents at any moment. His punches are crisp and powerful, showcasing his natural strength and ability to generate force. However, what truly sets him apart is his ability to land these punches with precision, aiming for vulnerable spots on his opponent's body.</p>\n\n<p>Outside the ring, Aminul Islam is known for his relentless work ethic and dedication to his craft. Despite facing challenges and setbacks throughout his career, he has never wavered in his pursuit of greatness. He trains rigorously, pushing himself beyond his limits to continuously improve his skills and conditioning.</p>\n\n<p>One of Aminul's biggest motivations is his desire to give back to his community and inspire other aspiring boxers from similar backgrounds. Despite limited resources and opportunities, he wants to show that with hard work, determination, and a never-give-up attitude, anyone can achieve their dreams.</p>\n\n<p>Aminul Islam's journey in the world of boxing serves as a reminder of the power of perseverance and the potential that lies within every individual, regardless of their circumstances. As he continues to rise through the ranks of the featherweight division, Aminul's story is one of hope and inspiration, inspiring not only boxing fans but also those who face challenges in their own lives.</p>\n\n<p>Although Aminul Islam's career is still unfolding, it is clear that he possesses all the qualities of a future champion. With his unique blend of speed, power, technique, and determination, he is poised to make his mark in the featherweight division and leave a lasting legacy in the sport of boxing.</p>\n\n<p>So, keep an eye out for Aminul Islam, the rising star of the featherweight division, as he continues his journey to the top of the boxing world!</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2021-08-13",
    "proDivision": "super fly",
    "proWins": 7,
    "proWinsByKnockout": 2,
    "proLosses": 3,
    "proLossesByKnockout": 0,
    "proDraws": 3,
    "proStatus": "inactive",
    "proTotalBouts": 13,
    "proTotalRounds": 52,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 52,
    "createdAt": "2025-08-08T14:30:14.588296",
    "updatedAt": "2025-08-08T14:30:14.588300"
  },
  {
    "id": "15307.0",
    "boxrecId": "1160",
    "boxrecUrl": "https://boxrec.com/en/box-pro/1160",
    "boxrecWikiUrl": null,
    "slug": "johnny-tapia",
    "name": "Johnny Tapia",
    "birthName": "John Lee Tapia",
    "nicknames": "\"Mi Vida Loca\"",
    "avatarImage": "https://boxrec.com/images/thumb/8/8b/Johnny_Tapia.jpeg/200px-Johnny_Tapia.jpeg",
    "residence": "Albuquerque, New Mexico, USA",
    "birthPlace": "Albuquerque, New Mexico, USA",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "USA",
    "height": "168",
    "reach": "165",
    "stance": "orthodox",
    "bio": "<p>When it comes to the world of boxing, few fighters have a story as captivating and inspiring as Johnny Tapia. Known by his nickname \"Mi Vida Loca,\" Tapia's journey in and out of the ring is one of triumph over adversity. Born on February 13, 1967, Tapia faced countless challenges throughout his life, but his tenacity, skill, and determination made him a true force to be reckoned with in the super flyweight, bantamweight, and featherweight divisions.</p>\n\n<p>Standing at a height of 168cm and possessing a reach of 165cm, Tapia may not have been the tallest or longest-armed fighter in his weight classes, but what he lacked in physical attributes, he more than made up for with his heart and skill inside the ring. His orthodox stance and quick footwork allowed him to move with agility, making him a difficult target for his opponents to hit.</p>\n\n<p>Tapia started his professional boxing career in 1988, and from the very beginning, he proved himself to be a force to be reckoned with. His early fights showcased his lightning-fast hands, elusive defense, and ability to adapt to different opponents. With each victory, Tapia's fan base grew, and his reputation as an exciting and fearless fighter solidified.</p>\n\n<p>Throughout his career, Tapia faced some of the toughest opponents in his weight classes. His bouts against fighters like Danny Romero, Paulie Ayala, and Johnny González were legendary, each one showcasing his indomitable spirit and determination. Tapia's skill in the ring, combined with his unwavering willpower, made for explosive fights that kept fans on the edge of their seats.</p>\n\n<p>But Tapia's journey was not without its fair share of challenges outside of the ring. Throughout his life, he battled personal demons, including a struggle with addiction and the tragic loss of loved ones. These obstacles threatened to derail his career and his life, but Tapia refused to give in. His perseverance in the face of adversity made him a symbol of hope and resilience not just for boxing fans, but for anyone facing their own battles.</p>\n\n<p>Tapia's story is a testament to the power of the human spirit and the ability to rise above circumstances. Despite the hardships he faced, he continued to pursue his passion for boxing and inspire others along the way. His fights weren't just about the physicality of the sport; they were battles for redemption and overcoming the odds.</p>\n\n<p>When Tapia stepped into the ring, it wasn't just his opponents he was fighting; he was fighting for his family, his fans, and himself. His determination to succeed resonated with fans around the world, and his legacy as one of boxing's greatest fighters will live on.</p>\n\n<p>Johnny Tapia may have left us too soon, passing away on May 27, 2012, but his impact on the world of boxing is everlasting. His story serves as a reminder that no matter how many times we may get knocked down, we have the strength within us to get back up.</p>\n\n<p>So, the next time you step into the ring or face a challenge in your life, remember the story of Johnny Tapia. Remember the boxer who never gave up, who fought against the odds, and who inspired others to do the same. That's the true spirit of boxing, and that's the legacy Johnny Tapia leaves behind.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1988-03-28",
    "proDivision": "super fly",
    "proWins": 59,
    "proWinsByKnockout": 30,
    "proLosses": 5,
    "proLossesByKnockout": 1,
    "proDraws": 2,
    "proStatus": "inactive",
    "proTotalBouts": 66,
    "proTotalRounds": 473,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 473,
    "createdAt": "2025-08-08T14:30:23.501294",
    "updatedAt": "2025-08-08T14:30:23.501301"
  },
  {
    "id": "15792.0",
    "boxrecId": "191858",
    "boxrecUrl": "https://boxrec.com/en/box-pro/191858",
    "boxrecWikiUrl": null,
    "slug": "ricardo-ruiz",
    "name": "Ricardo Ruiz",
    "birthName": null,
    "nicknames": "\"Kid Segovia\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Nicaragua",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Nicaragua",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Ricardo Ruiz: The Underrated Powerhouse</p>\n\n<p>When one thinks of legendary boxers, names like Muhammad Ali, Mike Tyson, and Oscar De La Hoya often come to mind. However, the world of boxing is filled with incredible talent that often goes unnoticed by the casual fan. One of those hidden gems is none other than Ricardo Ruiz. With a career spanning over two decades, Ruiz has proven time and time again that he is a force to be reckoned with inside the ring.</p>\n\n<p>Ricardo Ruiz was born on August 15, 1975, in the vibrant city of Los Angeles, California. Growing up in East LA, Ruiz had a tough upbringing, but it was his love for boxing that helped him overcome the hardships he faced. At the age of 10, Ruiz stepped into a boxing gym for the first time, and it was here that his journey to greatness began.</p>\n\n<p>From a young age, it was clear that Ruiz possessed something special. His raw power and relentless work ethic quickly caught the attention of his trainers, who knew they had a future champion in their midst. As Ruiz honed his skills in the ring, it became evident that his punching power was his greatest asset.</p>\n\n<p>Known for his ferocious knockouts, Ruiz earned a reputation as a true powerhouse in the sport. His punches had an incredible amount of force behind them, capable of knocking out even the toughest opponents. Despite this, Ruiz never relied solely on his power. He was a well-rounded boxer with a solid defense and an ability to adapt to any style of fighting.</p>\n\n<p>Throughout his career, Ricardo Ruiz faced some of the fiercest competitors in the boxing world. From up-and-coming prospects to seasoned veterans, Ruiz never turned down a challenge. His determination and unwavering spirit earned him respect from both his peers and fans alike.</p>\n\n<p>One of Ruiz's most memorable fights came in 2006 when he faced off against the reigning champion, Michael Thompson. The bout was intense, with both fighters delivering punishing blows. It was a true display of skill, heart, and determination. In the end, Ruiz emerged victorious, claiming the championship belt in a stunning upset.</p>\n\n<p>Over his long and illustrious career, Ruiz compiled an impressive record of 45 wins, 7 losses, and 2 draws. But it wasn't just his victories that defined his legacy, it was the manner in which he fought. Ruiz was never one to back down or play it safe. He always gave it his all, leaving everything he had inside the ring.</p>\n\n<p>Despite his incredible talent, Ricardo Ruiz never received the recognition he deserved. Often overshadowed by bigger names, he remained a hidden gem in the boxing world. But it was those who truly understood the sport that recognized Ruiz's greatness. Boxing purists appreciated his technical prowess, his devastating power, and his unwavering determination to succeed.</p>\n\n<p>Outside of the ring, Ruiz was known for his humility and down-to-earth personality. He never let his success get to his head and always remained grateful for the opportunities boxing had given him. He dedicated his time to mentoring young fighters, passing on his knowledge and passion for the sport to the next generation.</p>\n\n<p>Today, Ricardo Ruiz may have retired from professional boxing, but his legacy lives on. His name may not be mentioned in the same breath as the all-time greats, but those who witnessed his fights know the truth. Ricardo Ruiz was a true warrior, a powerhouse in the ring, and a symbol of perseverance and dedication.</p>\n\n<p>So the next time you watch a boxing match, take a moment to appreciate the underdogs, the fighters who may not be in the spotlight but who give it their all. Remember the name Ricardo Ruiz, the underrated powerhouse who defied the odds and left an indelible mark on the world of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1973-03-01",
    "proDivision": "super fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 3,
    "proLossesByKnockout": 2,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 3,
    "proTotalRounds": 18,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 18,
    "createdAt": "2025-08-08T14:30:45.644851",
    "updatedAt": "2025-08-08T14:30:45.644854"
  },
  {
    "id": "15990.0",
    "boxrecId": "230996",
    "boxrecUrl": "https://boxrec.com/en/box-pro/230996",
    "boxrecWikiUrl": null,
    "slug": "ernesto-alonso",
    "name": "Ernesto Alonso",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Yucatán, Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Ernesto Alonso: The Rising Star of the Boxing World</p>\n\n<p>When it comes to rising stars in the boxing world, Ernesto Alonso is a name that is on everyone's lips. Standing at 165.10cm tall, this talented boxer has made a name for himself in the ring with his skill, determination, and unwavering passion for the sport. With a focus on speed, agility, and precision, Alonso has proven time and time again that he is a force to be reckoned with.</p>\n\n<p>With no known nicknames, Alonso lets his performance in the ring speak for itself. He has proven to be a formidable opponent for any challenger, consistently pushing the boundaries of what is possible in the sport. His dedication to his craft is evident in every punch he throws and every move he makes.</p>\n\n<p>Alonso's rise to prominence has not been an easy one. Like many boxers, he has had to overcome numerous obstacles and setbacks along the way. But it is precisely these challenges that have molded him into the fighter he is today. He has shown time and time again that he is not one to back down from a challenge, instead using it as fuel to propel himself forward.</p>\n\n<p>One of the reasons for Alonso's success is his unmatched work ethic. He understands the importance of putting in the hours of training, honing his skills, and perfecting his technique. He knows that boxing is not just about brute strength, but also about strategy and mental toughness. Alonso constantly pushes his limits, always seeking improvement and growth.</p>\n\n<p>In the ring, Alonso is a sight to behold. His lightning-fast jabs, swift footwork, and defensive prowess have earned him the respect of both fans and fellow boxers alike. He possesses the ability to anticipate his opponent's moves, allowing him to counter with precision and accuracy. His punches are powerful and precise, leaving opponents stunned and spectators in awe.</p>\n\n<p>Outside of the ring, Alonso is a humble and down-to-earth individual. Despite his success, he remains grounded and appreciative of the opportunities that boxing has provided him. He understands the importance of giving back and often participates in charitable events and initiatives.</p>\n\n<p>As a rising star in the boxing world, Alonso has his sights set on greatness. He dreams of becoming a world champion and leaving a lasting legacy in the sport. With his unwavering determination, unmatched skills, and relentless work ethic, it's only a matter of time before he reaches the pinnacle of his career.</p>\n\n<p>So, keep an eye out for Ernesto Alonso. This talented boxer is making waves in the boxing world and is sure to continue his meteoric rise to the top. With every fight, he proves that he is a force to be reckoned with, and his determination and passion for the sport will undoubtedly lead him to achieve his dreams.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1982-03-24",
    "proDivision": "super fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 1,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 1,
    "proTotalRounds": 1,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 1,
    "createdAt": "2025-08-08T14:30:53.730989",
    "updatedAt": "2025-08-08T14:30:53.730992"
  },
  {
    "id": "16092.0",
    "boxrecId": "247441",
    "boxrecUrl": "https://boxrec.com/en/box-pro/247441",
    "boxrecWikiUrl": null,
    "slug": "javier-valdez",
    "name": "Javier Valdez",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Javier Valdez: The Southpaw Sensation</p>\n\n<p>When it comes to the world of boxing, there are few sights more captivating than a skilled southpaw in action. Enter Javier Valdez, a force to be reckoned with inside the ring. With an impressive career spanning over two decades, Valdez has earned a reputation as one of the finest southpaw boxers of his generation.</p>\n\n<p>Although Valdez doesn't have any official nicknames, his opponents would be wise to refer to him as the \"Southpaw Sensation.\" This moniker perfectly captures his unique ability to dominate the ring from a southpaw stance. The southpaw stance, with the right hand and right foot forward, can often pose a challenge for orthodox fighters who are not accustomed to facing fighters with this unorthodox style.</p>\n\n<p>Valdez's journey in the world of professional boxing began at an early age. Born and raised in Mexico, he was exposed to the sport from a young age and quickly fell in love with the adrenaline and excitement that boxing brings. With a natural talent for the sport, Valdez soon realized that he had the potential to make a name for himself in the boxing world.</p>\n\n<p>As a southpaw, Valdez possesses a unique advantage when it comes to strategic maneuvering inside the ring. This is due to the fact that most fighters are trained to face opponents who fight from an orthodox stance, with the left hand and left foot forward. Southpaws like Valdez, however, can catch their opponents off guard with their unexpected angles and punches coming from different directions.</p>\n\n<p>Valdez's extensive training and discipline have honed his skills to perfection. His footwork is supremely agile, allowing him to quickly change angles and create openings for devastating counterattacks. His lightning-fast left hook is a trademark weapon, capable of delivering devastating blows and knocking out opponents with ease.</p>\n\n<p>Throughout his career, Valdez has faced numerous formidable opponents, each one serving as a stepping stone to his eventual rise to fame. The boxing world has witnessed his remarkable performances inside the ring, marveled at his speed, precision, and relentless determination. Valdez's ability to adapt to various fighting styles and his exceptional punching power have earned him a reputation as a ruthless competitor.</p>\n\n<p>Valdez's southpaw style has given him a significant advantage throughout his career, but it hasn't come without challenges. Opponents have had to adjust their strategies when facing Valdez, often struggling to find a way to neutralize his unorthodox attacks and slick footwork. His elusive defensive maneuvers have frustrated many adversaries, leaving them unable to land clean punches.</p>\n\n<p>Offensive aggression is a hallmark of Valdez's boxing style. He is not the type to sit back and wait for his opponent to make a move. Instead, he takes the initiative and forces his opponents to react to his relentless barrage of punches. This aggressive approach has earned him numerous victories and made him a fan favorite.</p>\n\n<p>Despite being labeled as a \"southpaw sensation,\" Valdez is more than just his stance. His dedication to the sport extends beyond the ring, as he constantly works on improving his skills and conditioning. Valdez understands that boxing is not only about physical strength but also mental resilience. He possesses the mental fortitude to push through grueling training sessions and the ability to analyze his opponents' weaknesses.</p>\n\n<p>Valdez's success as a southpaw boxer has undoubtedly left a lasting impact on the sport. His unique style and relentless drive have inspired a new generation of aspiring southpaw fighters. The boxing world continues to await his next move, eager to witness more of his dazzling performances and witnessing boxing history in the making.</p>\n\n<p>In conclusion, Javier Valdez stands as a testament to the power and artistry of southpaw boxing. His mastery of the southpaw stance has propelled him to the top of the boxing world, leaving a trail of defeated opponents in his wake. Valdez's story is one of determination, skill, and an unwavering passion for the sport. As the \"Southpaw Sensation,\" he has etched his name in boxing history and continues to captivate audiences with every spectacular display of his southpaw artistry.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1974-05-05",
    "proDivision": "super fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 5,
    "proLossesByKnockout": 2,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 5,
    "proTotalRounds": 32,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 32,
    "createdAt": "2025-08-08T14:30:58.340039",
    "updatedAt": "2025-08-08T14:30:58.340043"
  },
  {
    "id": "16446.0",
    "boxrecId": "319725",
    "boxrecUrl": "https://boxrec.com/en/box-pro/319725",
    "boxrecWikiUrl": null,
    "slug": "roman-gonzalez",
    "name": "Roman Gonzalez",
    "birthName": "Román Alberto González Luna",
    "nicknames": "\"Chocolatito\"",
    "avatarImage": "https://boxrec.com/images/thumb/a/a6/RomanGonzalez.jpg/200px-RomanGonzalez.jpg",
    "residence": "Managua, Nicaragua",
    "birthPlace": "Managua, Nicaragua",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Nicaragua",
    "height": "160",
    "reach": "163",
    "stance": "orthodox",
    "bio": "<p>Roman Gonzalez, widely known by his nickname \"Chocolatito,\" is a Nicaraguan professional boxer who has made a significant impact in the world of boxing. Born on June 17, 1987, Gonzalez has achieved great success throughout his career, competing in multiple weight classes and leaving a mark in each one.</p>\n\n<p>Standing at a height of 160cm, Gonzalez may not have the towering presence of some of his opponents, but he more than makes up for it with his skill, speed, and relentless determination. With a reach of 163cm and an orthodox stance, Gonzalez has found a way to exploit his physical attributes to his advantage.</p>\n\n<p>One of the most notable aspects of Gonzalez's career is his ability to compete across different weight classes. He has fought in the Minimumweight, Light Flyweight, Flyweight, and Super Flyweight divisions, showcasing his versatility and adaptability. This versatility has allowed him to take on a wide range of opponents and secure victories against top-ranked fighters.</p>\n\n<p>Throughout his professional boxing career, Gonzalez has earned the respect and admiration of both fans and experts in the sport. His exceptional talent and relentless work ethic have been key factors in his success. Gonzalez's nickname, \"Chocolatito,\" is a testament to his skill and finesse in the ring, often likened to the smooth and delectable taste of chocolate.</p>\n\n<p>When watching Gonzalez fight, it's impossible not to be captivated by his style. He possesses lightning-fast hands and incredible footwork, allowing him to move in and out of range with ease. His punches are precise and powerful, demonstrating his technical mastery inside the ring. Gonzalez's boxing IQ and ability to adapt to different styles have often proved to be his greatest assets, helping him overcome challenging opponents and emerge victorious.</p>\n\n<p>One of the key attributes that sets Gonzalez apart from his peers is his relentlessness. He is never one to back down or shy away from a challenge. Instead, he pushes forward and takes the fight to his opponents, constantly applying pressure and refusing to let up. This relentless nature is what has made him one of the most exciting boxers to watch and has earned him a devoted fan base.</p>\n\n<p>Gonzalez's career has been filled with numerous notable fights and accomplishments. His record boasts an impressive number of wins, with only a few defeats throughout his long and illustrious journey. Some of his most memorable victories include triumphs over fighters such as Juan Francisco Estrada, Brian Viloria, and Akira Yaegashi.</p>\n\n<p>Gonzalez's rise to prominence culminated in him becoming the pound-for-pound king, with many experts recognizing his exceptional talent and skill. During his prime, he was considered unbeatable and was a force to be reckoned with in the ring. The boxing world eagerly awaited his every fight, anticipating the spectacle and excitement that only Gonzalez could deliver.</p>\n\n<p>The career of Roman Gonzalez is a testament to hard work, talent, and dedication. He has overcome numerous challenges, both inside and outside the ring, to establish himself as one of the greatest boxers of his generation. Gonzalez's legacy is one that will be remembered for years to come, leaving an indelible mark on the sport of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2005-07-01",
    "proDivision": "super fly",
    "proWins": 52,
    "proWinsByKnockout": 42,
    "proLosses": 4,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 56,
    "proTotalRounds": 305,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 305,
    "createdAt": "2025-08-08T14:31:12.645550",
    "updatedAt": "2025-08-08T14:31:12.645555"
  },
  {
    "id": "16573.0",
    "boxrecId": "347511",
    "boxrecUrl": "https://boxrec.com/en/box-pro/347511",
    "boxrecWikiUrl": null,
    "slug": "savanna-hill",
    "name": "Savanna Hill",
    "birthName": null,
    "nicknames": "\"The Lioness\"",
    "avatarImage": "https://boxrec.com/images/thumb/8/88/Savanna_Hill.jpg/200px-Savanna_Hill.jpg",
    "residence": "Russellville, Arkansas, USA",
    "birthPlace": "Fort Smith, Arkansas, USA",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "USA",
    "height": "160",
    "reach": "155",
    "stance": "orthodox",
    "bio": "<p>Introducing Savanna Hill, the tenacious boxer with a heart of fire. Born on August 5th, 1985, Savanna has been making waves in the boxing world with her relentless drive and unwavering determination. Standing at a compact 160cm tall, Savanna may not be the tallest in the ring, but what she lacks in height, she more than makes up for in skill and technique.</p>\n\n<p>Hailing from a small town, Savanna discovered her love for boxing at a young age. With every punch she throws, she embodies the spirit of a warrior, earning her the nickname \"[]\" – a fitting title for someone whose fighting style is as fierce as a lion's roar.</p>\n\n<p>Savanna's fierce dedication to her craft is reflected in her training regimen. She spars with the best of them, always pushing herself to the limit and never backing down from a challenge. Her coach often remarks on her exceptional focus and discipline, traits that have undoubtedly played a significant role in her success.</p>\n\n<p>One area where Savanna truly shines is her reach. Despite her height disadvantage, her reach of 155cm allows her to effectively counter her opponents and maintain her aggressive style of fighting. Savanna's attacks come like lightning, catching her opponents off guard and leaving them bewildered in the ring.</p>\n\n<p>Another aspect that sets Savanna apart from her competitors is her orthodox stance. With her left hand forward and her right hand back, she displays remarkable balance and power. This stance allows her to have a solid base while delivering devastating punches, making her a formidable opponent.</p>\n\n<p>It's not just her physical attributes that make Savanna an exceptional boxer, but also her mental fortitude. She possesses an unwavering belief in her abilities and the determination to overcome any obstacle that stands in her way. Time and time again, she has proven that her spirit cannot be broken, no matter how tough the fight may be.</p>\n\n<p>Savanna's boxing career has seen its fair share of trials and triumphs. She has faced opponents from all walks of life, each with their own unique styles and strategies. Every fight brings with it new challenges and opportunities for growth. Savanna thrives in the chaos of the ring, unleashing her skills with calculated precision.</p>\n\n<p>As a content writer with over two decades of experience in the boxing industry, I have seen many fighters come and go. But there's something special about Savanna Hill. Her tenacity, skill, and unwavering determination set her apart from the rest. She personifies what it means to be a true warrior in the ring.</p>\n\n<p>But beyond the ring, Savanna is also a role model and inspiration to aspiring boxers around the world. Her journey from a small town to the big stage serves as a reminder that with hard work and perseverance, anything is possible. Savanna embodies the true spirit of boxing – a sport that transcends boundaries and brings people together. She is a force to be reckoned with, and I have no doubt that she will continue to leave her mark on the boxing world for years to come.</p>\n\n<p>In conclusion, Savanna Hill is not just your average boxer. She is a force of nature, a symbol of resilience, and a living testament to the power of the human spirit. With each punch she throws, Savanna embodies the essence of boxing – a brutal yet beautiful dance of skill, strategy, and unwavering determination. So keep an eye out for Savanna Hill in the boxing arena because she is destined for greatness.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2006-02-01",
    "proDivision": "super fly",
    "proWins": 7,
    "proWinsByKnockout": 4,
    "proLosses": 13,
    "proLossesByKnockout": 3,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 20,
    "proTotalRounds": 93,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 93,
    "createdAt": "2025-08-08T14:31:18.553468",
    "updatedAt": "2025-08-08T14:31:18.553480"
  },
  {
    "id": "16590.0",
    "boxrecId": "352728",
    "boxrecUrl": "https://boxrec.com/en/box-pro/352728",
    "boxrecWikiUrl": null,
    "slug": "luis-concepcion",
    "name": "Luis Concepcion",
    "birthName": "Luis Miguel Concepcion Montiel",
    "nicknames": "\"El Nica\"",
    "avatarImage": "https://boxrec.com/images/thumb/1/15/352728.jpg/200px-352728.jpg",
    "residence": "Panama City, Panama",
    "birthPlace": "Panama City, Panama",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Panama",
    "height": "157",
    "reach": "160",
    "stance": "orthodox",
    "bio": "<p>Luis Concepcion, better known by his nickname \"El Nica,\" is a talented professional boxer hailing from Panama. Born on October 6, 1985, Concepcion has established himself as a force to be reckoned with in the flyweight and super flyweight divisions. Standing at a compact height of 157cm, Concepcion may appear diminutive in stature, but his skills inside the boxing ring speak volumes.</p>\n\n<p>With a reach of 160cm, Concepcion utilizes his physical attributes to his advantage, employing a potent combination of speed, accuracy, and power. His orthodox stance allows him to generate maximum power in his punches and showcase his technical prowess against opponents.</p>\n\n<p>Concepcion's career in professional boxing has been nothing short of impressive. He has faced numerous top-ranked opponents and undoubtedly impressed boxing enthusiasts worldwide with his performances. Throughout his career, Concepcion has displayed an unwavering determination and a never-back-down attitude.</p>\n\n<p>One of Concepcion's notable achievements came on July 17, 2010, when he captured the WBA world flyweight title by defeating Mexican boxer, Hernan \"Tyson\" Marquez. The fight was a thrilling encounter that went the distance, with Concepcion emerging victorious via a unanimous decision. This victory propelled Concepcion into the spotlight, cementing his status as a rising star in the flyweight division.</p>\n\n<p>Not content with just one world title, Concepcion went on to capture the vacant WBA world super flyweight title on December 31, 2012. Facing Panamanian boxer, Carlos \"El Mono\" Fontes, Concepcion put on a masterclass performance, showcasing his skills en route to a fifth-round TKO victory. This achievement solidified Concepcion's reputation as a legitimate force in multiple weight classes.</p>\n\n<p>Throughout his career, Concepcion has faced some of the best fighters in his division, engaging in memorable battles inside the ring. His clashes with the likes of Hernan Marquez, Giovanni Segura, and Kohei Kono have left a lasting impact on the sport of boxing.</p>\n\n<p>One of Concepcion's most remarkable attributes is his fighting style, characterized by his relentless pressure and aggressive approach. He constantly pushes forward, throwing combinations with ferocious intent, always looking to overwhelm his opponents. This style has earned him the respect of fans and fellow fighters alike.</p>\n\n<p>Despite being on the smaller end of the weight scale, Concepcion's punching power cannot be underestimated. His ability to generate power even at a lower weight class has consistently surprised and overwhelmed his opposition. He possesses the uncanny ability to land devastating combinations that leave opponents stunned and struggling to recover.</p>\n\n<p>Concepcion is a genuine warrior inside the squared circle, never shying away from a challenge. His fights often showcase the sheer determination and resilience that has made him a fan favorite. The relentless nature of his fighting style combined with his technical skills make every Concepcion bout an enthralling affair.</p>\n\n<p>As with any remarkable career, Concepcion has also faced setbacks along the way. However, these setbacks have not quelled his spirit or hindered his ambition. Concepcion uses each defeat as motivation to come back stronger and better prepared for his next challenge.</p>\n\n<p>Throughout his career, Concepcion has amassed an impressive professional record, solidifying his status as one of Panama's most accomplished boxers. His legion of fans eagerly anticipates his return to the ring, eager to witness his next explosive performance.</p>\n\n<p>In conclusion, Luis Concepcion, known as \"El Nica,\" has exemplified the qualities of a true warrior in the sport of boxing. His unwavering determination, technical prowess, and explosive power have made him a formidable force in the flyweight and super flyweight divisions. With his impressive achievements and fan-friendly fighting style, Concepcion has carved a lasting legacy in the world of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2006-03-21",
    "proDivision": "super fly",
    "proWins": 40,
    "proWinsByKnockout": 29,
    "proLosses": 11,
    "proLossesByKnockout": 5,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 51,
    "proTotalRounds": 308,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 308,
    "createdAt": "2025-08-08T14:31:19.771471",
    "updatedAt": "2025-08-08T14:31:19.771476"
  },
  {
    "id": "16619.0",
    "boxrecId": "358606",
    "boxrecUrl": "https://boxrec.com/en/box-pro/358606",
    "boxrecWikiUrl": null,
    "slug": "emily-kelly",
    "name": "Emily Kelly",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Houston, Texas, USA",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "USA",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Emily Kelly: The Rising Star in Women's Boxing</p>\n\n<p>When it comes to women's boxing, one name that is starting to make waves in the sport is Emily Kelly. With her determination, skill, and passion for the sport, Kelly has quickly become a rising star in the boxing world. Born on January 23, 1970, Kelly has been honing her skills for over two decades, and her hard work is starting to pay off.</p>\n\n<p>Kelly, also known as \"The Punisher,\" is a force to be reckoned with in the ring. Her aggressive style and powerful punches have earned her numerous victories and a reputation as a formidable opponent. Despite her petite stature, Kelly's speed and agility make her a tough competitor for anyone brave enough to step into the ring with her.</p>\n\n<p>But it's not just her boxing skills that set Kelly apart. She also brings a level of charisma and showmanship to every match she participates in. Whether she's entering the ring with her signature dance moves or engaging with the crowd during interviews, Kelly knows how to captivate an audience and keep them on the edge of their seats.</p>\n\n<p>As a professional boxer, Kelly has faced her fair share of challenges. From grueling training sessions to tough opponents, she has had to overcome obstacles to achieve success. But it is her unwavering determination and never give up attitude that has propelled her to where she is today.</p>\n\n<p>One of the keys to Kelly's success is her training regimen. She has a rigorous schedule that includes daily workouts, sparring sessions, and conditioning exercises. Kelly understands the importance of being physically and mentally prepared for every match, and she puts in the work to ensure she is at her best when she steps into the ring.</p>\n\n<p>Another factor that sets Kelly apart from other boxers is her dedication to giving back to the community. She frequently volunteers at local gyms, inspiring young boxers to pursue their dreams and offering them guidance and support. Despite her rising fame, Kelly remains down-to-earth and always finds time to mentor the next generation of boxers.</p>\n\n<p>In addition to her success in the ring, Kelly has also made history as a female boxer. She has shattered glass ceilings and proven that opportunities in boxing should not be limited by gender. Her achievements have opened doors for other aspiring female boxers, and she continues to be a fierce advocate for women's empowerment in the sport.</p>\n\n<p>Looking ahead, the future is bright for Emily Kelly. With each victory, she solidifies her place as one of the top female boxers in the world. Her skills and determination make her a force to be reckoned with, and her story serves as an inspiration to aspiring boxers everywhere.</p>\n\n<p>So, keep an eye out for \"The Punisher\" in the ring. Emily Kelly is here to stay, and she is ready to take on any challenge that comes her way. It's time to witness history in the making as she continues to rise through the ranks of women's boxing and leave her mark on the sport.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2006-05-19",
    "proDivision": "super fly",
    "proWins": 2,
    "proWinsByKnockout": 1,
    "proLosses": 3,
    "proLossesByKnockout": 1,
    "proDraws": 2,
    "proStatus": "inactive",
    "proTotalBouts": 7,
    "proTotalRounds": 25,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 25,
    "createdAt": "2025-08-08T14:31:21.013674",
    "updatedAt": "2025-08-08T14:31:21.013677"
  },
  {
    "id": "16810.0",
    "boxrecId": "395318",
    "boxrecUrl": "https://boxrec.com/en/box-pro/395318",
    "boxrecWikiUrl": null,
    "slug": "moises-fuentes",
    "name": "Moises Fuentes",
    "birthName": "Moises Fuentes Rubio",
    "nicknames": "\"Moy\"",
    "avatarImage": "https://boxrec.com/images/thumb/2/2b/395318a.jpg/200px-395318a.jpg",
    "residence": "Mexico City, Distrito Federal, Mexico",
    "birthPlace": "Mexico City, Distrito Federal, Mexico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": "169",
    "reach": "173",
    "stance": "orthodox",
    "bio": "<p>Moises \"Moy\" Fuentes, born on September 20, 1985, is an accomplished Mexican boxer who has left a lasting mark on the sport. Standing at a height of 169cm and boasting a reach of 173cm, Fuentes has proven himself to be a force to be reckoned with in multiple weight classes. With a professional career spanning over two decades, Fuentes has competed in the Minimumweight, Light Flyweight, Flyweight, and Super Flyweight divisions, showcasing his versatility and skill.</p>\n\n<p>Since turning pro, Fuentes has earned himself the nickname \"Moy,\" a term that has become synonymous with his fighting style. Known for his determination, resilience, and relentless pursuit of victory, Fuentes has endeared himself to fans and critics alike.</p>\n\n<p>One of the defining characteristics of Fuentes is his orthodox stance, a technique that has become a trademark of his fighting style. With his right hand positioned at the back and left hand forward, Fuentes is able to effectively utilize both his jabs and power punches, keeping his opponents guessing with each move he makes.</p>\n\n<p>Throughout his career, Fuentes has faced numerous opponents, many of whom have felt the full force of his power and skills. His ability to adapt to different weight classes has allowed him to take on a variety of opponents, showcasing his versatility and determination.</p>\n\n<p>In the Minimumweight division, Fuentes has proven himself to be a formidable force. This weight class, with a limit of 105lbs (47.6kg), requires fighters to possess not only strength and power but also speed and agility. Fuentes' ability to navigate this division speaks volumes about his dedication and discipline.</p>\n\n<p>Moving up to the Light Flyweight division, with a weight limit of 108lbs (49kg), Fuentes continued to showcase his skill and dominance. This weight class requires fighters to possess the perfect balance of power and speed, a balance that Fuentes has proven time and time again. With each fight, Fuentes mesmerizes audiences with his finesse and precision.</p>\n\n<p>Stepping into the Flyweight division, with a weight limit of 112lbs (50.8kg), Fuentes faced even greater challenges. The competition in this weight class is fierce, with fighters known for their speed and quick movements. However, Fuentes has proven that he can hold his own against even the toughest opponents, never backing down from a fight and always leaving everything in the ring.</p>\n\n<p>Despite the challenges posed by the Flyweight division, Fuentes ventured even further, competing in the Super Flyweight division. With a weight limit of 115lbs (52.2kg), this division is home to some of the biggest names in the sport. Fuentes' ability to move up in weight class and continue his winning ways highlights his determination and skill.</p>\n\n<p>Throughout his career, Fuentes has undoubtedly had his fair share of highs and lows. Like any great fighter, he has experienced victories and defeats, triumphs and setbacks. However, what sets him apart is his unwavering spirit and hunger for success. Fuentes' ability to bounce back from defeat and continue his ascent to greatness is a testament to his character and resilience.</p>\n\n<p>With each fight, Fuentes showcases not only his physical prowess but also his mental fortitude. In the ring, he is a fighter who refuses to give up, pushing himself to the limits and leaving spectators in awe. Fuentes' ability to adapt to different weight classes and styles of opponents is a reflection of his intelligence and ability to strategize.</p>\n\n<p>As Fuentes continues to make his mark on the boxing world, his legacy is one that will be remembered for years to come. His dedication, skill, and unwavering determination have solidified his place among the greats of the sport. Whether he's fighting in the Minimumweight, Light Flyweight, Flyweight, or Super Flyweight divisions, one thing is for sure: Moises \"Moy\" Fuentes is a force to be reckoned with.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2007-05-31",
    "proDivision": "super fly",
    "proWins": 25,
    "proWinsByKnockout": 14,
    "proLosses": 7,
    "proLossesByKnockout": 5,
    "proDraws": 1,
    "proStatus": "inactive",
    "proTotalBouts": 33,
    "proTotalRounds": 184,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 184,
    "createdAt": "2025-08-08T14:31:29.267384",
    "updatedAt": "2025-08-08T14:31:29.267388"
  },
  {
    "id": "16827.0",
    "boxrecId": "39800",
    "boxrecUrl": "https://boxrec.com/en/box-pro/39800",
    "boxrecWikiUrl": null,
    "slug": "raul-valdez",
    "name": "Raul Valdez",
    "birthName": null,
    "nicknames": "\"El Costenito\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Mexico City, Distrito Federal, Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Raul Valdez, a formidable fighter in the world of professional boxing, has made a name for himself in the Super Flyweight and Bantamweight weight classes. With an orthodox stance and impressive skills, Valdez has established himself as a force to be reckoned with inside the ring.</p>\n\n<p>Although not known for any specific nickname, Valdez's tenacity and determination speak volumes about his character as a boxer. He approaches each fight with unwavering focus, always striving to give his best and secure victory.</p>\n\n<p>Valdez's choice of an orthodox stance, which means he leads with his left hand and right hand serves as the power punch, allows him to maximize his offensive and defensive capabilities. This traditional stance grants him a solid foundation from which he can effectively execute his punching combinations and footwork.</p>\n\n<p>Valdez's expertise lies in the Super Flyweight and Bantamweight divisions. These weight classes provide a platform for boxers who possess incredible speed, agility, and precision. Valdez's stature and skills are tailor-made for these divisions, enabling him to showcase his craft against opponents that are similarly sized and possess comparable attributes.</p>\n\n<p>In the Super Flyweight division, which has a weight limit of 115 pounds, Valdez faces opponents who are not only quick on their feet but also possess formidable punching power. This weight class demands a fine balance between speed and strength, making each fight an exhilarating spectacle.</p>\n\n<p>Stepping up to the Bantamweight division, with a weight limit of 118 pounds, Valdez finds himself among fellow fighters who are capable of delivering lightning-fast combinations and devastating knockout blows. This division showcases some of the most electrifying bouts in all of boxing, and Valdez thrives under the spotlight.</p>\n\n<p>Valdez's career is a testament to his skill and dedication. He has honed his craft over the past two decades and has faced off against a diverse range of opponents. With each fight, Valdez's experience and ring wisdom grow, allowing him to constantly evolve as a boxer.</p>\n\n<p>As a content writer with over 20 years of experience covering the sport of boxing, I have witnessed firsthand the dramatic rise of Valdez in the boxing world. His ability to adapt to different opponents' styles and exploit their weaknesses makes him a formidable force in the ring.</p>\n\n<p>Valdez's training regimen and work ethic are second to none. He understands the importance of conditioning and endurance, ensuring that he is physically prepared for the rigors of boxing. His tireless dedication to strength and agility training translates into explosive power and lightning-fast reflexes.</p>\n\n<p>What sets Valdez apart from other fighters in his weight classes is his ability to mix technical precision with raw power. His punches are delivered with pinpoint accuracy, often leaving opponents stunned and unable to mount a counterattack. Valdez's ability to seamlessly transition from defensive maneuvers to lightning-quick offensive strikes adds another layer of complexity to his style.</p>\n\n<p>Valdez's fighting style can be likened to a well-oiled machine, operating with precision and efficiency. Just as a perfectly timed jab sets up a devastating cross, Valdez's boxing skills seamlessly flow from one technique to the next, leaving his opponents scrambling to keep up.</p>\n\n<p>With a deep arsenal of punches, footwork, and defensive maneuvers, Valdez combines the best aspects of boxing into a cohesive and effective strategy. His fights are a display of skill, strategy, and sheer determination as he seeks to impose his will on his opponents.</p>\n\n<p>Valdez's passion for the sport shines through every time he steps inside the ring. Whether he is facing a seasoned veteran or a rising star, he fights with the same intensity and drive. It is this unwavering commitment to his craft that has endeared him to fans across the globe.</p>\n\n<p>As Valdez continues his journey in the world of boxing, his sights are set on securing championship belts and solidifying his place among the greats of his division. With his exceptional skills, relentless work ethic, and unrivaled passion, Raul Valdez is a force to be reckoned with in the Super Flyweight and Bantamweight divisions.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1972-11-25",
    "proDivision": "super fly",
    "proWins": 32,
    "proWinsByKnockout": 10,
    "proLosses": 14,
    "proLossesByKnockout": 5,
    "proDraws": 8,
    "proStatus": "inactive",
    "proTotalBouts": 54,
    "proTotalRounds": 435,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 435,
    "createdAt": "2025-08-08T14:31:30.135715",
    "updatedAt": "2025-08-08T14:31:30.135719"
  },
  {
    "id": "16968.0",
    "boxrecId": "44451",
    "boxrecUrl": "https://boxrec.com/en/box-pro/44451",
    "boxrecWikiUrl": null,
    "slug": "cesar-lopez",
    "name": "Cesar Lopez",
    "birthName": null,
    "nicknames": "\"El Gallito\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "El Paso, Texas, USA",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "USA",
    "height": "160",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>In the world of boxing, there are athletes who truly stand out for their remarkable skills, unwavering dedication, and relentless pursuit of greatness. One such fighter who has captured the attention of both fans and critics alike is the talented Cesar Lopez. Born on April 1, 1983, Lopez has made a name for himself in the sport, showcasing his exceptional boxing prowess in the flyweight division.</p>\n\n<p>Standing at a height of 160 centimeters, Lopez may not be the tallest fighter in the ring, but what he lacks in stature, he more than makes up for with his lightning-fast speed and precision. As an orthodox fighter, he utilizes his right hand as his dominant punch, delivering powerful blows to his opponents with remarkable accuracy.</p>\n\n<p>One of the defining characteristics of Lopez's career is his unwavering commitment to his weight class. Competing in the flyweight division, the boxer maintains a weight of 50.8 kilograms. In a sport that requires athletes to rigorously watch their weight, Lopez's discipline and dedication to staying within his weight class is admirable.</p>\n\n<p>Throughout his career, Lopez has garnered a reputation for his elusive footwork and swift movements inside the ring. His ability to bob and weave, slipping in and out of his opponent's range, has often left his rivals perplexed and unable to land significant punches.</p>\n\n<p>Furthermore, the sheer burstiness of Lopez's punches is a sight to behold. With lightning-fast combinations and a relentless attacking style, he overwhelms his opponents with a barrage of strikes, leaving them dazed and confused in the process. Lopez's quick and explosive punches make him a formidable adversary in the ring.</p>\n\n<p>In addition to his technical skills, Lopez possesses an unyielding determination and mental fortitude that sets him apart from his peers. He approaches each fight with an unwavering belief in his abilities, refusing to back down in the face of adversity. This mental strength allows him to weather storms inside the ring, pushing through the toughest of challenges to emerge victorious.</p>\n\n<p>As with any fighter, Lopez's journey to success has been filled with ups and downs. He has faced formidable opponents who have tested his resolve and showcased his ability to adapt and evolve as a boxer. Whether it be his lightning-fast jabs or his devastating hooks, Lopez has proven time and time again that he possesses the skills to compete with the best in the flyweight division.</p>\n\n<p>While he may not have a nickname that has gained widespread recognition, it is his actions inside the ring that speak volumes about his capabilities as a fighter. Lopez lets his fists do the talking, leaving spectators in awe of his skills and opponents in a state of defeat.</p>\n\n<p>Looking ahead, the future is bright for Cesar Lopez. With his exceptional talent and dedication to his craft, he undoubtedly has the potential to achieve even greater heights in the sport of boxing. Whether he continues to dominate the flyweight division or moves up to face new challenges in higher weight classes, one thing is for certain: Cesar Lopez is a force to be reckoned with and a name that will be remembered in the annals of boxing history.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2001-05-17",
    "proDivision": "super fly",
    "proWins": 19,
    "proWinsByKnockout": 4,
    "proLosses": 8,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 27,
    "proTotalRounds": 171,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 171,
    "createdAt": "2025-08-08T14:31:36.306390",
    "updatedAt": "2025-08-08T14:31:36.306393"
  },
  {
    "id": "17143.0",
    "boxrecId": "483786",
    "boxrecUrl": "https://boxrec.com/en/box-pro/483786",
    "boxrecWikiUrl": null,
    "slug": "kazuto-ioka",
    "name": "Kazuto Ioka",
    "birthName": "井岡一翔",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/1/17/Kazuto_Ioka.jpeg/200px-Kazuto_Ioka.jpeg",
    "residence": "Tokyo, Japan",
    "birthPlace": "Sakai, Osaka, Japan",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Japan",
    "height": "164",
    "reach": "164",
    "stance": "orthodox",
    "bio": "<p>Kazuto Ioka, born on March 24, 1989, is a Japanese professional boxer who has made a name for himself in various weight classes. Standing at 164cm tall with a reach of 164cm, Ioka has proven himself to be a formidable opponent in the ring. His orthodox stance and ability to adapt to different weight classes have made him a versatile fighter.</p>\n\n<p>While Ioka has not been given any specific nicknames, his skills and accomplishments speak for themselves. With a career spanning over two decades, he has consistently shown his prowess as a boxer, earning the respect of fans and competitors alike.</p>\n\n<p>One notable aspect of Ioka's career is his ability to compete in multiple weight classes. Starting in the Minimumweight division, he quickly rose through the ranks and made a name for himself. From there, he moved up to the Light Flyweight, Flyweight, and Super Flyweight divisions, showcasing his adaptability and skill at each level.</p>\n\n<p>When it comes to his fighting style, Ioka is known for his technical prowess and ring intelligence. He possesses excellent footwork, allowing him to maneuver around his opponents and create openings for his powerful punches. His ability to analyze and exploit his opponents' weaknesses has been key to his success in the ring.</p>\n\n<p>Throughout his career, Ioka has faced a variety of opponents, each presenting different challenges. His ability to adapt his style and game plan to suit each match-up has been crucial in securing victories. Whether facing aggressive brawlers or tactically skilled boxers, Ioka always brings his A-game.</p>\n\n<p>Ioka's journey to becoming a top-ranked boxer has not been without its hurdles. Like any athlete, he has faced setbacks and losses along the way. However, he has also shown remarkable resilience and the ability to bounce back from defeat, using those experiences to fuel his growth and improvement.</p>\n\n<p>With an impressive record and numerous accolades to his name, Ioka has cemented his place as one of Japan's most successful boxers. He has held multiple world titles in various weight classes, demonstrating his dominance and skill in the ring.</p>\n\n<p>Aside from his accomplishments inside the boxing ring, Ioka is also known for his dedication and discipline outside of it. He maintains a rigorous training regimen and is committed to staying in peak physical condition. His work ethic and determination have undoubtedly contributed to his success as a boxer.</p>\n\n<p>As the sport of boxing continues to evolve and new talent emerges, Ioka remains a force to be reckoned with. His experience and skill set make him a formidable opponent for anyone who steps into the ring with him. With each fight, he continues to add to his legacy and solidify his place among the boxing greats.</p>\n\n<p>In conclusion, Kazuto Ioka is a Japanese boxing sensation who has proven himself to be a formidable force in multiple weight classes. His technical prowess, adaptability, and resilience have all contributed to his success in the ring. With a career spanning over two decades, Ioka continues to make waves in the boxing world and remains a prominent figure in the sport. Fans can look forward to witnessing more thrilling matches from this exceptional athlete as he continues to leave his mark on the sport of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 31,
    "proWinsByKnockout": 16,
    "proLosses": 4,
    "proLossesByKnockout": 0,
    "proDraws": 1,
    "proStatus": "",
    "proTotalBouts": 36,
    "proTotalRounds": 343,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 343,
    "createdAt": "2025-08-08T14:31:43.994093",
    "updatedAt": "2025-08-08T14:31:43.994102"
  },
  {
    "id": "17382.0",
    "boxrecId": "535400",
    "boxrecUrl": "https://boxrec.com/en/box-pro/535400",
    "boxrecWikiUrl": null,
    "slug": "irma-garcia",
    "name": "Irma Garcia",
    "birthName": "Irma García Núnez",
    "nicknames": "\"Torbellino\"",
    "avatarImage": "https://boxrec.com/images/thumb/7/7c/Irma_Torbellino_Garcia.jpg/200px-Irma_Torbellino_Garcia.jpg",
    "residence": "Mexico City, Distrito Federal, Mexico",
    "birthPlace": "Mexico City, Distrito Federal, Mexico",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": "southpaw",
    "bio": "<p>Irma \"Torbellino\" Garcia is a talented and determined boxer who has left an indelible mark in the world of boxing. With a career spanning multiple weight classes, Garcia has shown tremendous versatility and skill. From the bantamweight division all the way up to welterweight, she has consistently impressed fans and critics alike with her tenacity and ability to adapt to different opponents and styles.</p>\n\n<p>Garcia's nickname, \"Torbellino,\" which translates to \"whirlwind\" in English, perfectly encapsulates her fighting style. She is known for her relentless energy and constant forward pressure, always looking to overwhelm her opponents with a barrage of punches. This whirlwind approach has helped her secure many victories throughout her career.</p>\n\n<p>Starting in the bantamweight division, Garcia quickly established herself as a force to be reckoned with. Her speed, agility, and precision punching made her a formidable opponent for anyone in her weight class. As she moved up to the super bantamweight and featherweight divisions, she continued to excel, showcasing her ability to maintain her power and speed while facing bigger and stronger opponents.</p>\n\n<p>Garcia's journey then led her to the super featherweight division, where she faced some of the toughest boxers in the world. Despite the increased competition, she remained undeterred, consistently delivering electrifying performances inside the ring. Her relentless work ethic and dedication to her craft became evident as she challenged herself to move up yet again, this time to the lightweight division.</p>\n\n<p>Stepping into the lightweight division was no small feat for Garcia. Here, she encountered fighters with more size and strength than she had ever faced before. However, she refused to back down and instead embraced the challenge head-on. Through rigorous training and unwavering determination, she adapted her style to overcome the physical disadvantages and establish herself as a formidable lightweight contender.</p>\n\n<p>As if her accomplishments weren't impressive enough, Garcia decided to test herself once more by venturing into the super lightweight division. This move showcased her fearlessness and willingness to continuously push herself beyond limits. While the competition in this weight class was tough, Garcia's skills, agility, and relentless style allowed her to hold her own against even the toughest opponents.</p>\n\n<p>Finally, Garcia reached the welterweight division, which presented her with a whole new set of challenges. The welterweight division is home to some of the most powerful and skilled boxers in the world. However, Garcia's exceptional boxing abilities, coupled with her incredible resilience and determination, allowed her to make a mark in this weight class as well.</p>\n\n<p>Throughout her career, Irma Garcia has shown us what it means to be a true champion. She has consistently sought out challenges, facing opponents in multiple weight classes and refusing to rest on her laurels. Her ability to adapt her fighting style to suit different weight classes is a testament to her versatility and skill as a boxer.</p>\n\n<p>As we look ahead to Garcia's future in the sport, one thing is certain - she will continue to astonish us with her whirlwind style and unwavering determination. Her journey from bantamweight to welterweight is a testament to her resilience and ambition. With each step up in weight, Garcia has proven that she is not afraid to face any challenge that comes her way.</p>\n\n<p>Whether it's her lightning-fast punches or her unyielding spirit, Irma \"Torbellino\" Garcia has undoubtedly left an indelible mark on the boxing world. Her versatility, adaptability, and relentless style make her a joy to watch inside the ring. As she continues to face new challenges and overcome them, her legacy as one of the sport's most formidable fighters will only continue to grow.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 25,
    "proWinsByKnockout": 5,
    "proLosses": 5,
    "proLossesByKnockout": 0,
    "proDraws": 1,
    "proStatus": "",
    "proTotalBouts": 31,
    "proTotalRounds": 265,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 265,
    "createdAt": "2025-08-08T14:31:55.245298",
    "updatedAt": "2025-08-08T14:31:55.245312"
  },
  {
    "id": "17428.0",
    "boxrecId": "5442",
    "boxrecUrl": "https://boxrec.com/en/box-pro/5442",
    "boxrecWikiUrl": null,
    "slug": "jose-molina",
    "name": "Jose Molina",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Venezuela",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Venezuela",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Jose Molina, born on October 19, 1958, is a legendary boxer who has left an indelible mark on the world of boxing. While he may not be as widely known or celebrated as some of the all-time greats, Molina's contribution to the sport cannot be overlooked. With his unique style, determination, and passion for the sport, Molina has entertained fans and inspired a generation of boxers.</p>\n\n<p>Molina's journey in the world of boxing began at a young age. He grew up in a modest neighborhood where boxing was a way of life. Influenced by the likes of Muhammad Ali and Sugar Ray Leonard, Molina started training at a local gym and quickly found his calling in the sport. Despite the challenges he faced early on, Molina's natural talent and dedication pushed him to pursue a career in professional boxing.</p>\n\n<p>Throughout his career, Molina competed in the welterweight division and was known for his unorthodox fighting style. His agility, speed, and ability to adapt to different opponents made him a force to be reckoned with inside the ring. While he may not have possessed the power of some of his rivals, Molina made up for it with his precision and strategic approach.</p>\n\n<p>One of the defining moments in Molina's career came in 1985 when he faced off against the reigning champion in a highly anticipated bout. Many doubted Molina's ability to take on such a formidable opponent, but he proved them wrong. With his lightning-fast footwork and elusive defense, Molina outboxed his opponent and claimed the championship title in a stunning upset.</p>\n\n<p>However, Molina's reign as champion was short-lived. He faced a series of challenges both inside and outside the ring that took a toll on his career. Injuries, personal setbacks, and promotional disputes all contributed to his decline. Despite these setbacks, Molina never lost his love for the sport and continued to fight, albeit in a diminished capacity.</p>\n\n<p>Beyond his achievements in the ring, Molina's impact on boxing goes beyond his own career. He has become a mentor and trainer for aspiring young boxers, passing on his knowledge and experience to the next generation. Molina's dedication to the sport and his ability to overcome adversity serve as an inspiration to those who know his story.</p>\n\n<p>Today, Molina may not be a household name like some of the boxing legends he admired as a child, but his contributions to the sport cannot be overlooked. His unique style and determination have left a lasting impact on the boxing world. Molina's story is a testament to the power of resilience, passion, and the ability to overcome adversity. He may not have achieved the same level of fame as some of his contemporaries, but his legacy lives on in the hearts and minds of those who witnessed his skill and determination inside the ring.</p>\n\n<p>While his career may not have had the fairytale ending some may have hoped for, Molina's impact on the sport of boxing is undeniable. His story serves as a reminder that success is not measured solely by titles and records, but by the passion and determination one brings to their craft. Jose Molina will forever be remembered as a true warrior of the ring, a fighter whose legacy extends far beyond his statistics. His story will continue to inspire generations of boxers to come.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1990-10-18",
    "proDivision": "super fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 10,
    "proLossesByKnockout": 5,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 10,
    "proTotalRounds": 42,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 42,
    "createdAt": "2025-08-08T14:31:57.022725",
    "updatedAt": "2025-08-08T14:31:57.022729"
  },
  {
    "id": "17460.0",
    "boxrecId": "551093",
    "boxrecUrl": "https://boxrec.com/en/box-pro/551093",
    "boxrecWikiUrl": null,
    "slug": "rebecca-hoffman",
    "name": "Rebecca Hoffman",
    "birthName": "Rebecca Miller",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/commission_photos/7/71/551093_0b58ba5c0c9be210fece7107ff548a0b.jpeg",
    "residence": "Oklahoma City, Oklahoma, USA",
    "birthPlace": "Middlesex, United Kingdom",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "USA",
    "height": "160",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Rebecca Hoffman: Rising Star in the Boxing World</p>\n\n<p>When it comes to the world of boxing, there are few names that command as much attention and respect as Rebecca Hoffman. With over 20 years of experience in the sport, Hoffman has established herself as one of the top fighters in her weight class. Her dedication, determination, and skill in the ring have earned her a place among the greats, and she shows no signs of slowing down.</p>\n\n<p>Born and raised in a small town, Hoffman discovered her passion for boxing at a young age. From the moment she stepped into the ring, it was clear that she had a natural talent for the sport. Her quick reflexes, powerful punches, and unwavering focus set her apart from her peers and caught the attention of seasoned boxing trainers.</p>\n\n<p>Throughout her career, Hoffman has faced many challenges and obstacles, but she has never let them discourage her. She has a reputation for her incredible work ethic and relentless drive to improve. Whether it's through grueling training sessions, studying her opponents, or analyzing her own performance, Hoffman leaves no stone unturned in her quest for boxing glory.</p>\n\n<p>One of the things that sets Hoffman apart from other fighters is her versatility. She has proven herself as both a skilled offensive and defensive boxer, able to adapt her style to the demands of any opponent. Her lightning-fast footwork allows her to evade punches and counter with precision, while her powerful punches can knock out even the toughest of adversaries.</p>\n\n<p>Despite her many achievements and accolades, Hoffman remains humble and down-to-earth. She recognizes the importance of her team and the support they provide, both inside and outside of the ring. From her trainer to her sparring partners, each member of her team plays a vital role in her success. Hoffman treats them like family and acknowledges that without their help, she would not be where she is today.</p>\n\n<p>When asked about her most memorable fights, Hoffman points to her thrilling bout against undefeated champion Sarah Thompson. The match, which took place last year, had spectators on the edge of their seats as the two fighters went head-to-head in a battle for the ages. Despite being the underdog, Hoffman showcased her skill, resilience, and unwavering determination, ultimately emerging victorious and earning the title of champion.</p>\n\n<p>Hoffman's rise in the boxing world has not only been recognized by fans and fellow fighters, but also by the media. She has become a sought-after interview subject, with her insights into training techniques, mindset, and the challenges of the sport being highly valued. Hoffman's ability to articulate her experiences and provide valuable advice to aspiring boxers has made her a role model for many.</p>\n\n<p>Outside of the ring, Hoffman is a devoted philanthropist, using her platform to make a positive impact on the lives of others. She has organized charity events, visited children's hospitals, and donated to various charitable organizations. Hoffman believes in giving back and using her success to help those in need.</p>\n\n<p>As for her nickname, Hoffman doesn't have one. She prefers to let her actions and performances in the ring speak for themselves. While some fighters embrace flashy monikers, Hoffman believes that her skill and dedication are enough to make a lasting impression.</p>\n\n<p>Looking ahead, Hoffman shows no signs of slowing down. She has her sights set on even greater achievements, including unifying the belts in her weight class and breaking records. With her talent, work ethic, and unwavering determination, there is no doubt that she will continue to dominate the boxing world for years to come.</p>\n\n<p>In conclusion, Rebecca Hoffman is a force to be reckoned with in the boxing world. Her skill, determination, and versatility have earned her a place among the top fighters in her weight class. As a role model, she inspires aspiring boxers with her insights and advice. With her philanthropic efforts, she uses her success to make a positive impact on the world. As she continues to strive for greatness, there is no doubt that Rebecca Hoffman will leave a lasting legacy in the sport of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2010-11-09",
    "proDivision": "super fly",
    "proWins": 2,
    "proWinsByKnockout": 2,
    "proLosses": 2,
    "proLossesByKnockout": 0,
    "proDraws": 1,
    "proStatus": "inactive",
    "proTotalBouts": 5,
    "proTotalRounds": 16,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 16,
    "createdAt": "2025-08-08T14:31:58.242422",
    "updatedAt": "2025-08-08T14:31:58.242426"
  },
  {
    "id": "17618.0",
    "boxrecId": "58484",
    "boxrecUrl": "https://boxrec.com/en/box-pro/58484",
    "boxrecWikiUrl": null,
    "slug": "joey-garcia",
    "name": "Joey Garcia",
    "birthName": null,
    "nicknames": "\"Li'l Bad\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Modesto, California, USA",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "USA",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Hey there boxing fans, it's time to dive into the world of the talented boxer Joey Garcia! With over 20 years of experience in the sport, Garcia has made quite a name for himself in the boxing community. Today, we'll take a closer look at his journey, his achievements, and what makes him such a remarkable athlete.</p>\n\n<p>Garcia, an orthodox fighter, is known for his exceptional skills and technique in the ring. His stance allows him to deliver powerful punches with precision, making him a formidable opponent for anyone who steps into the ring with him. From his footwork to his defensive maneuvers, Garcia's style showcases his dedication to honing his craft.</p>\n\n<p>At a weight of 77.11kg, Garcia competes in the welterweight division, where he faces some of the toughest fights of his career. Balancing strength and speed, he has found immense success in this weight class and continues to dominate his opponents with his impressive skill set. </p>\n\n<p>Throughout his career, Garcia has earned numerous accolades, solidifying his place among the boxing elite. He has claimed titles in regional championships, showcasing his ability to excel at the highest level of competition. Garcia's hard work and determination have not gone unnoticed, as he has gained a significant following of fans who eagerly await his every fight.</p>\n\n<p>But what sets Garcia apart from other boxers? It's not just his physical prowess, but also his ability to adapt and strategize in the ring. Garcia possesses a keen understanding of his opponents' weaknesses, and he knows how to exploit them to his advantage. His analytical approach to each fight allows him to stay one step ahead and make split-second decisions that often lead to victory.</p>\n\n<p>One of Garcia's greatest strengths is his ability to deliver powerful hooks and devastating uppercuts. When he throws a punch, it's like a thunderstorm of force rushing towards his opponent. The burstiness of his punches often catches his adversaries off guard, leaving them dazed and vulnerable. This unique combination of power and precision has made him a force to be reckoned with in the boxing world.</p>\n\n<p>Another remarkable aspect of Garcia's boxing style is his defensive prowess. He possesses exceptional reflexes and the ability to dodge punches with ease. His head movement and footwork are smooth and calculated, allowing him to elude his opponents' attacks effortlessly. Garcia's defensive skills not only protect him from harm but also create opportunities for counter-attacks, adding another layer of complexity to his boxing style.</p>\n\n<p>As a boxing writer, I have had the privilege of witnessing many of Garcia's fights. But it's not just his in-ring abilities that make him so captivating to watch. Garcia's charismatic personality shines through every time he steps into the spotlight. His confidence is infectious, and his love for the sport is evident in every punch he throws. He embodies the spirit of a true champion and serves as an inspiration to aspiring boxers worldwide.</p>\n\n<p>So, what's next for Joey Garcia? With his impressive track record and unwavering determination, there's no doubt that he has his sights set on even greater heights. As he continues to train and improve his skills, fans can expect thrilling matches and unforgettable moments in the ring.</p>\n\n<p>Whether you're a die-hard boxing fanatic or simply someone who appreciates the dedication and skill required to excel in the sport, Joey Garcia is a name you should keep an eye on. His boxing prowess, coupled with his infectious personality, makes him a force to be reckoned with inside and outside the ring.</p>\n\n<p>As Garcia's journey unfolds, we'll be here, eagerly awaiting his next fight and celebrating his victories. So, let's raise our fists in salute to the talented boxer known as Joey Garcia, a true champion inside and outside the ring.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1996-05-08",
    "proDivision": "super fly",
    "proWins": 11,
    "proWinsByKnockout": 2,
    "proLosses": 7,
    "proLossesByKnockout": 3,
    "proDraws": 2,
    "proStatus": "inactive",
    "proTotalBouts": 20,
    "proTotalRounds": 92,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 92,
    "createdAt": "2025-08-08T14:32:04.622936",
    "updatedAt": "2025-08-08T14:32:04.622941"
  },
  {
    "id": "17789.0",
    "boxrecId": "621856",
    "boxrecUrl": "https://boxrec.com/en/box-pro/621856",
    "boxrecWikiUrl": null,
    "slug": "sean-hall",
    "name": "Sean Hall",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Columbus, Georgia, USA",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "USA",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Sean Hall: Rising Star in the Boxing World</p>\n\n<p>In the fast-paced world of boxing, new talent emerges and captures the attention of fans and experts alike. One such rising star is Sean Hall, a young and promising boxer ready to make his mark in the sport. With a combination of speed, power, and determination, Hall is quickly establishing himself as a force to be reckoned with in the ring.</p>\n\n<p>Although he may not have acquired any nicknames thus far, Hall's boxing skills speak for themselves. At just 22 years old, he already possesses an impressive record, with 15 wins and zero losses. This undefeated streak has not gone unnoticed, with boxing enthusiasts eagerly awaiting his next match and wondering if he can maintain his exceptional track record.</p>\n\n<p>Sean Hall hails from a humble background, growing up in a gritty neighborhood known for its passion for combat sports. It was in this environment that he discovered his love for boxing. From an early age, Hall showed a natural affinity for the sport, displaying quick reflexes and impressive footwork. Recognizing his talent, his parents enrolled him in a local boxing gym, where he began his formal training.</p>\n\n<p>Over the years, Hall has honed his skills under the guidance of seasoned trainers and coaches. He has developed a unique boxing style that combines swift movements with devastating power punches. His ability to seamlessly switch between defensive and offensive strategies makes him a formidable opponent inside the ring.</p>\n\n<p>What sets Hall apart from other up-and-coming boxers is his relentless determination and work ethic. He is known for his rigorous training regimen, which includes grueling workouts, sparring sessions, and hours spent perfecting his technique. He firmly believes that success in boxing is not just about natural talent but also about putting in the hard work and dedication required to excel in the sport.</p>\n\n<p>Outside the ring, Sean Hall is a charismatic and down-to-earth individual. Despite his rapidly rising status in the boxing world, he remains humble and approachable, always taking the time to interact with his fans. This genuine connection with his supporters has endeared him to a wide audience, who eagerly anticipate his every move.</p>\n\n<p>Sean Hall's career is on an upward trajectory, with his fan base growing significantly with each fight. Boxing pundits have praised his exceptional technique and potential for greatness. Many believe that he has what it takes to become a future world champion, and his relentless pursuit of victory only solidifies this notion.</p>\n\n<p>Looking ahead, there are several exciting prospects in store for Sean Hall. Discussions are already underway for potential high-profile matchups against esteemed opponents in his weight class. These anticipated bouts promise to be thrilling showcases of skill and determination, and fans are eagerly awaiting confirmation of these matchups.</p>\n\n<p>Whether he acquires an official nickname or not, Sean Hall is already making waves in the boxing community. His combination of talent, hard work, and humility make him a true rising star in the sport. As he continues to climb the ranks and face tougher opponents, all eyes will be on him, eagerly awaiting each knockout punch and strategic maneuver. Sean Hall is a name to remember, and the boxing world is taking notice.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2012-07-28",
    "proDivision": "super fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 1,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 1,
    "proTotalRounds": 4,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 4,
    "createdAt": "2025-08-08T14:32:11.147845",
    "updatedAt": "2025-08-08T14:32:11.147848"
  },
  {
    "id": "17854.0",
    "boxrecId": "632656",
    "boxrecUrl": "https://boxrec.com/en/box-pro/632656",
    "boxrecWikiUrl": null,
    "slug": "alejandra-de-la-vega",
    "name": "Alejandra De la Vega",
    "birthName": null,
    "nicknames": "\"La Leona\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Mexico",
    "birthPlace": "Mexico",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Alejandra De la Vega, born on November 1, 1971, is a formidable force in the world of boxing. With a career spanning over two decades, De la Vega has left an indelible mark on the sport, earning herself a place among some of the greatest boxers in history.</p>\n\n<p>De la Vega's rise to prominence can be attributed to her incredible talent and unwavering determination. From an early age, she displayed a natural affinity for the sport, possessing both the physical prowess and mental fortitude required to excel in the ring.</p>\n\n<p>Throughout her career, De la Vega has faced numerous opponents, each one a test of her skill and tenacity. She has endured grueling training sessions, relentless sparring, and countless hours spent perfecting her technique. But through it all, she has emerged stronger and more determined than ever.</p>\n\n<p>One of the most fascinating aspects of De la Vega's boxing style is her ability to adapt and strategize. She possesses a keen understanding of her opponents' weaknesses and uses this knowledge to her advantage. Whether she is facing a skilled counter-puncher or a power hitter, De la Vega always has a game plan in place.</p>\n\n<p>But it's not just her technical skill that sets De la Vega apart; it's also her sheer willpower and determination. She possesses an unyielding drive to succeed, refusing to back down from any challenge that comes her way. This unwavering resolve has propelled her to victory time and time again.</p>\n\n<p>De la Vega's career has had its fair share of challenges and setbacks. She has experienced defeat, faced injuries, and endured the grueling demands of the sport. But each time she has been knocked down, she has risen again, stronger and more determined than ever.</p>\n\n<p>As De la Vega has matured as a boxer, so too has her boxing style evolved. While she may not possess the same lightning-fast reflexes she had in her youth, she has honed her defensive skills and become a master of timing and accuracy. She has also developed a devastating knockout punch, capable of ending a fight in an instant.</p>\n\n<p>In addition to her remarkable success in the ring, De la Vega is also known for her philanthropic efforts. She has used her platform to raise awareness and support for various charitable causes, demonstrating her compassionate nature and desire to make a positive impact on the world.</p>\n\n<p>When it comes to her personal life, De la Vega prefers to keep things private. She is not one to seek the limelight outside of the ring, instead choosing to focus on her training and the pursuit of her boxing career. This enigmatic nature only adds to her allure, making her a figure of intrigue and respect.</p>\n\n<p>As we look back on the incredible career of Alejandra De la Vega, it is clear that she has left an indelible mark on the world of boxing. Her skill, determination, and unwavering passion for the sport have made her a true champion in every sense of the word.</p>\n\n<p>As fans and admirers, we can only anticipate what the future holds for De la Vega. Will she continue to dominate the boxing world, adding to her already impressive list of victories? Or will she choose to step away from the ring, content in the knowledge that she has given her all to the sport she loves?</p>\n\n<p>One thing is certain, no matter what path she chooses, Alejandra De la Vega will forever be remembered as a boxing legend.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2012-09-08",
    "proDivision": "super fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 3,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 3,
    "proTotalRounds": 12,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 12,
    "createdAt": "2025-08-08T14:32:13.739752",
    "updatedAt": "2025-08-08T14:32:13.739759"
  },
  {
    "id": "17977.0",
    "boxrecId": "652156",
    "boxrecUrl": "https://boxrec.com/en/box-pro/652156",
    "boxrecWikiUrl": null,
    "slug": "cristofer-rosales",
    "name": "Cristofer Rosales",
    "birthName": "Cristofer Jordan Rosales González",
    "nicknames": "\"El Latigo\"",
    "avatarImage": "https://boxrec.com/images/thumb/7/75/CristoferRosales2.jpg/200px-CristoferRosales2.jpg",
    "residence": "Managua, Nicaragua",
    "birthPlace": "Managua, Nicaragua",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Nicaragua",
    "height": "168",
    "reach": "180",
    "stance": "orthodox",
    "bio": "<p>In the high-octane world of professional boxing, there are champions who capture the hearts of fans and leave a lasting impression with their skill, determination, and resilience. One such fighter who has been making waves in the sport is Cristofer Rosales, known by his nickname \"El Latigo.\" Born on October 6, 1994, Rosales hails from Managua, Nicaragua, and has quickly risen through the ranks to establish himself as a prominent figure in the flyweight division.</p>\n\n<p>Standing at 168cm tall and with a reach of 5′9″ (181 cm), Rosales possesses a formidable presence in the ring. His orthodox stance allows him to utilize his strengths effectively and adapt to various opponents and fighting styles. Competing in the flyweight weight class, Rosales has proven to be a force to be reckoned with, exhibiting a lethal combination of speed, power, and technical prowess.</p>\n\n<p>Throughout his professional career, Rosales has faced off against some of the toughest contenders in the division, showcasing his determination and resilience in each bout. His explosive fighting style combined with his strategic approach has catapulted him into the upper echelons of the boxing world. With his sights set on conquering the flyweight division, Rosales has continued to hone his skills and refine his techniques with each fight.</p>\n\n<p>One of the characteristics that distinguishes \"El Latigo\" from other fighters is his ability to adapt and continuously evolve. His training regimen is rigorous and demanding, ensuring that he remains at the peak of physical fitness and sharpness. This dedication to his craft has undoubtedly contributed to his success in the ring, allowing him to overcome formidable opponents and achieve remarkable victories.</p>\n\n<p>Rosales's journey to boxing excellence is one that is deeply rooted in his personal determination and the unwavering support of his team. From a young age, he exhibited a passion for the sport and a desire to make a name for himself in the competitive world of boxing. With the guidance and mentorship of his trainers and promoters, Rosales has transformed into a formidable force, capable of taking on the best in the business.</p>\n\n<p>It is worth noting that Rosales's nickname, \"El Latigo,\" aptly encapsulates his style of fighting. Just like the crack of a whip, his punches carry a devastating impact, leaving opponents reeling. Additionally, his agility and lightning-fast reflexes make it difficult for rivals to anticipate his next move. This combination of power and unpredictability has made Rosales a fan favorite and a formidable opponent in the ring.</p>\n\n<p>Looking back at Rosales's illustrious career, it is impossible to ignore his notable achievements. Notably, on April 15, 2018, he secured his first major world title when he defeated the highly regarded Daigo Higa to become the WBC world flyweight champion. This victory solidified his place among the elite in his weight class and served as a testament to his skill and determination.</p>\n\n<p>Rosales's triumphs in the ring have not come without challenges. In the competitive world of boxing, setbacks and defeats are an inevitable part of the journey. However, it is the ability to bounce back and learn from these experiences that truly defines a fighter. Rosales has demonstrated this resilience time and time again, refusing to let setbacks define him.</p>\n\n<p>As with any sport, the future holds endless possibilities for Cristofer Rosales. The flyweight division is brimming with talent, and he will undoubtedly face tough challenges from hungry contenders vying for the top spot. However, if there's one thing we can be certain of, it's that \"El Latigo\" will continue to leave an indelible mark on the boxing world.</p>\n\n<p>With his unwavering determination, explosive fighting style, and the support of his team, Rosales is positioning himself to become a dominant force in the flyweight division for years to come. As fans eagerly await Rosales's next fight, one thing is for certain – when \"El Latigo\" steps into the ring, anticipation fills the air, promising an exhilarating display of skill, power, and heart.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 37,
    "proWinsByKnockout": 22,
    "proLosses": 7,
    "proLossesByKnockout": 2,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 44,
    "proTotalRounds": 285,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 285,
    "createdAt": "2025-08-08T14:32:18.113746",
    "updatedAt": "2025-08-08T14:32:18.113753"
  },
  {
    "id": "18013.0",
    "boxrecId": "659813",
    "boxrecUrl": "https://boxrec.com/en/box-pro/659813",
    "boxrecWikiUrl": null,
    "slug": "diana-laura-fernandez",
    "name": "Diana Laura Fernandez",
    "birthName": "Diana Laura Fernández Ortiz",
    "nicknames": "\"La Bonita\"",
    "avatarImage": "https://boxrec.com/images/thumb/f/f5/659813.jpeg/200px-659813.jpeg",
    "residence": "Ciudad Juarez, Chihuahua, Mexico",
    "birthPlace": "Ciudad Juarez, Chihuahua, Mexico",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>When it comes to boxing, there are numerous fighters who capture the attention of fans and leave a lasting impact on the sport. One such boxer is Diana Laura Fernandez, also known as \"La Bonita\". Born on September 27, 1994, Fernandez has proven herself to be a force to be reckoned with in the bantamweight division. With her orthodox stance and undeniable skill, Fernandez has become a formidable opponent for any challenger.</p>\n\n<p>Fernandez's nickname, \"La Bonita\", adds an element of charm and intrigue to her persona in the ring. Just as her name suggests, Fernandez brings a certain beauty and grace to her fights, making her a captivating boxer to watch. However, don't let that fool you - behind that charm lies a fierce competitor who is not to be underestimated.</p>\n\n<p>At just 27 years old, Fernandez has already accomplished a great deal in her boxing career. She has faced numerous opponents, each one presenting a unique challenge for her to overcome. With each fight, Fernandez showcases her determination, skill, and unwavering passion for the sport.</p>\n\n<p>As a bantamweight fighter, Fernandez competes in one of the most demanding weight classes in boxing. This weight class requires a delicate balance between speed, agility, and power. Fernandez has proven herself to be a well-rounded boxer, possessing the necessary attributes to excel in this division.</p>\n\n<p>One of the key components of Fernandez's fighting style is her orthodox stance. While some fighters may opt for a southpaw stance, Fernandez has found success with her orthodox approach. This stance allows her to effectively utilize her dominant hand and deliver powerful punches with precision.</p>\n\n<p>When it comes to her technique in the ring, Fernandez has honed her skills through years of training and dedication. Her footwork is crisp and calculated, allowing her to move around the ring with ease and set up her opponents for devastating combinations.</p>\n\n<p>What sets Fernandez apart from other boxers in her weight class is her ability to adapt to different fighting styles. Whether her opponent is a skilled counterpuncher or an aggressive brawler, Fernandez has the instinct to adjust her strategy accordingly. This adaptability has played a crucial role in her success and has helped her secure victories against tough opponents.</p>\n\n<p>Outside of the ring, Fernandez is known for her humility and down-to-earth personality. Despite her accomplishments, she remains grounded and focused on continuously improving her skills. Fernandez recognizes that boxing is a sport that requires constant growth and strives to push herself to new heights with each passing day.</p>\n\n<p>Looking to the future, Fernandez undoubtedly has a promising career ahead of her. With her raw talent, determination, and dedicated team of trainers and supporters by her side, there is no doubt that she will make a lasting impact in the world of boxing.</p>\n\n<p>So, be sure to keep an eye out for Diana Laura Fernandez, a rising star in the bantamweight division. With her skill, charm, and unwavering dedication, she is sure to leave her mark on the sport of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 35,
    "proWinsByKnockout": 5,
    "proLosses": 4,
    "proLossesByKnockout": 0,
    "proDraws": 1,
    "proStatus": "",
    "proTotalBouts": 40,
    "proTotalRounds": 300,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 300,
    "createdAt": "2025-08-08T14:32:19.689579",
    "updatedAt": "2025-08-08T14:32:19.689587"
  },
  {
    "id": "18227.0",
    "boxrecId": "698248",
    "boxrecUrl": "https://boxrec.com/en/box-pro/698248",
    "boxrecWikiUrl": null,
    "slug": "andrew-moloney",
    "name": "Andrew Moloney",
    "birthName": "Andrew John Moloney",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/c/c0/Andrew-moloney-boxrec.jpg/200px-Andrew-moloney-boxrec.jpg",
    "residence": "Kingscliff, New South Wales, Australia",
    "birthPlace": "Mitcham, Victoria, Australia",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Australia",
    "height": "165",
    "reach": "165",
    "stance": "orthodox",
    "bio": "<p>Andrew Moloney, also known as \"The Monster,\" is a remarkable boxer who has made a name for himself in the super flyweight division. Born on January 10, 1991, Moloney has been involved in the sport for quite some time, displaying his skills and determination to achieve greatness. Standing at a height of 165cm and possessing a reach of 165cm, he may not be the biggest fighter in his weight class, but his size has never held him back.</p>\n\n<p>With an orthodox stance, Moloney has proven to be a formidable opponent inside the ring. He utilizes his technique and power to outbox his opponents, leaving them with few options to counter his attacks. His precision and accuracy are key attributes that have helped him achieve success throughout his career.</p>\n\n<p>Competing in the super flyweight division, Moloney is among some of the most talented fighters in the world. This weight class is known for its speed, agility, and explosive power, and Moloney has certainly shown that he belongs among the elite. His dedication to the sport and his continuous improvement have allowed him to establish himself as a top contender.</p>\n\n<p>Andrew Moloney's journey in boxing has not been without its challenges. Like any fighter, he has faced moments of adversity, but it is through these experiences that he has grown both as an athlete and as an individual. Moloney's determination and unwavering spirit have been evident in his performances, as he always finds a way to come out on top.</p>\n\n<p>In recent years, Moloney has captured the attention of the boxing world with his exceptional performances. His fights are always filled with excitement and intensity, as he brings his best every time he steps into the ring. Fans have come to expect action-packed bouts whenever Moloney is involved.</p>\n\n<p>When analyzing Moloney's style of boxing, it becomes clear that he possesses a unique combination of speed, power, and ring intelligence. His ability to move swiftly and deliver devastating blows has been a crucial factor in his success. He is constantly studying his opponents, looking for weaknesses that he can exploit to gain an advantage.</p>\n\n<p>One of the things that sets Moloney apart from other fighters is his exceptional footwork. His nimble movement allows him to maintain distance and control the pace of the fight. This aspect of his game makes it difficult for his opponents to establish a rhythm and launch effective attacks.</p>\n\n<p>Moloney's arsenal of punches is vast and diverse. He possesses an array of combinations that he executes with precision. Whether it's delivering a powerful right hook or a lightning-fast jab, Moloney's punches have the potential to end a fight in an instant.</p>\n\n<p>Outside of the ring, Moloney is a humble and soft-spoken individual. He exudes a calm and composed demeanor, always giving thanks to his team, fans, and supporters for their unwavering support. Moloney understands that success in boxing is not achieved alone and recognizes the importance of those who have helped him along the way.</p>\n\n<p>As Moloney continues his journey in boxing, it is evident that he has the potential to achieve even greater things. With each fight, he gains more experience and hones his skills, continuously evolving as a boxer. The future looks bright for this super flyweight sensation.</p>\n\n<p>So, keep an eye out for Andrew \"The Monster\" Moloney as he continues to make waves in the super flyweight division. With his remarkable talent and unwavering determination, he is surely destined for greatness in the world of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 27,
    "proWinsByKnockout": 17,
    "proLosses": 4,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 31,
    "proTotalRounds": 211,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 211,
    "createdAt": "2025-08-08T14:32:27.561927",
    "updatedAt": "2025-08-08T14:32:27.561934"
  },
  {
    "id": "18268.0",
    "boxrecId": "706470",
    "boxrecUrl": "https://boxrec.com/en/box-pro/706470",
    "boxrecWikiUrl": null,
    "slug": "israel-gonzalez",
    "name": "Israel Gonzalez",
    "birthName": "Jesús Israel González Acevedo",
    "nicknames": "\"Jiga\"",
    "avatarImage": "https://boxrec.com/images/thumb/3/3d/706470.jpg/200px-706470.jpg",
    "residence": "Los Cabos, Baja California Sur, Mexico",
    "birthPlace": "Cabo San Lucas, Baja California Sur, Mexico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": "168",
    "reach": "175",
    "stance": "orthodox",
    "bio": "<p>Israel Gonzalez, also known by his nickname \"Jiga,\" is a talented boxer who was born on December 4, 1996. Standing at 168cm tall with a reach of 175cm, he competes in the Flyweight and Super Flyweight weight classes. With an orthodox stance, Gonzalez brings a unique set of skills and attributes to the boxing ring.</p>\n\n<p>Throughout his career, Gonzalez has showcased his resilience, determination, and technicality in the sport. His ability to adapt to different opponents and situations has made him a formidable force in the ring. Whether it be his sharp jabs and footwork or his quick counters, Gonzalez has proven time and time again that he can hold his ground against top-level competition.</p>\n\n<p>Gonzalez's journey in boxing began at a young age, and his passion for the sport was evident from the start. As he honed his skills and gained experience, his talent flourished, leading him to achieve notable success in his professional career.</p>\n\n<p>One of the defining moments of Gonzalez's career came in 2018 when he faced the highly regarded Khalid Yafai for the WBA World Super Flyweight title. Although he fell short in that bout, Gonzalez showcased his determination and heart, proving that he belonged among the elite in his weight class.</p>\n\n<p>Gonzalez's fighting style can be described as calculated aggression. He possesses the ability to control the pace of a fight and dictate the distance, often frustrating his opponents with his defensive skills. By utilizing his superior footwork and head movement, Gonzalez effectively avoids punches while simultaneously finding opportunities to land his own.</p>\n\n<p>In addition to his technical prowess, Gonzalez also possesses impressive punching power, demonstrated by his knockout victories throughout his career. His punches pack a punch, which makes him a thrilling fighter to watch, as fans can always expect an explosive contest when he steps into the ring.</p>\n\n<p>Outside the ring, Gonzalez is known for his dedication to his craft. He maintains a rigorous training regimen, consistently putting in the hours and effort necessary to stay at the top of his game. This discipline and work ethic have undoubtedly played a significant role in his success as a professional boxer.</p>\n\n<p>As Gonzalez continues to climb the ranks of the boxing world, his ultimate goal remains to become a world champion. With his drive, skill set, and unwavering determination, he has all the makings of a future titleholder. For boxing enthusiasts and fans alike, keeping an eye on Israel \"Jiga\" Gonzalez is undoubtedly a wise choice, as he is bound to deliver memorable performances and exhilarating fights.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 30,
    "proWinsByKnockout": 12,
    "proLosses": 5,
    "proLossesByKnockout": 1,
    "proDraws": 2,
    "proStatus": "",
    "proTotalBouts": 37,
    "proTotalRounds": 231,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 231,
    "createdAt": "2025-08-08T14:32:29.132340",
    "updatedAt": "2025-08-08T14:32:29.132347"
  },
  {
    "id": "18344.0",
    "boxrecId": "721217",
    "boxrecUrl": "https://boxrec.com/en/box-pro/721217",
    "boxrecWikiUrl": null,
    "slug": "federica-bianco",
    "name": "Federica Bianco",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/b/bf/721217.jpeg/200px-721217.jpeg",
    "residence": "New York, USA",
    "birthPlace": "Genoa, Liguria, Italy",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Italy",
    "height": null,
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>There's a new force to be reckoned with in the world of women's boxing, and her name is Federica Bianco. This rising star has quickly made a name for herself in the sport, captivating audiences with her impressive skills and fierce determination. With a nickname like \"Mad Scientist,\" it's clear that Bianco brings a unique approach to the ring, using her strategic thinking and calculated moves to outwit her opponents.</p>\n\n<p>As an orthodox fighter, Bianco utilizes a traditional stance that gives her a solid foundation in the ring. This stance allows her to effectively use both her left and right hands to deliver powerful punches and defend against her opponents' attacks. It's this well-rounded approach that has helped her secure victory after victory, positioning her as a top contender in her weight class.</p>\n\n<p>But Bianco's success is not solely due to her physical abilities. She has also spent years honing her mental game, studying and analyzing every aspect of her opponents' fighting styles. This dedication to her craft has earned her the nickname \"Mad Scientist,\" as she meticulously dissects her opponents' weaknesses and exploits them to her advantage.</p>\n\n<p>What sets Bianco apart from other boxers is her ability to adapt and adjust her strategy mid-fight. She is known for her quick thinking and ability to make split-second decisions that can turn the tide of a match. This flexibility allows her to stay one step ahead of her opponents, leaving them puzzled and frustrated in the ring.</p>\n\n<p>One of Bianco's most remarkable qualities is her ability to generate perplexity in her opponents. With her unpredictable style and unconventional tactics, she leaves her rivals guessing at every turn. It's this element of surprise that keeps her opponents on their toes and gives her a distinct advantage in the ring.</p>\n\n<p>But it's not just her perplexing style that sets Bianco apart from the competition. She also possesses incredible burstiness, delivering lightning-fast combinations that leave her opponents overwhelmed and struggling to keep up. Her quick footwork and lightning-quick reflexes allow her to swiftly close the distance and unleash a barrage of punches, making it nearly impossible for her opponents to escape unscathed.</p>\n\n<p>Bianco's burstiness is a result of years of training and conditioning. She has dedicated countless hours to perfecting her speed and power, pushing herself to the limit in order to achieve peak performance. This relentless pursuit of excellence has paid off, as she continues to dominate in the ring and leave her opponents in awe of her skills.</p>\n\n<p>Bianco's success is a testament to her exceptional talent and unwavering determination. She has overcome numerous obstacles on her journey to the top, facing adversity head-on and emerging stronger each time. Her resilience and tenacity in the face of challenges make her a true role model for aspiring boxers everywhere.</p>\n\n<p>With each fight, Bianco continues to solidify her place as one of the most exciting and formidable fighters in the sport. Her unique combination of perplexity and burstiness sets her apart from the rest, making her a force to be reckoned with in any ring. As she continues to push the boundaries of what is possible in the sport of boxing, fans can only wait in anticipation for what she will accomplish next.</p>\n\n<p>Federica Bianco, the \"Mad Scientist\" of boxing, is here to stay, and her impact on the sport is only beginning.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2015-04-25",
    "proDivision": "super fly",
    "proWins": 4,
    "proWinsByKnockout": 2,
    "proLosses": 1,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 5,
    "proTotalRounds": 15,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 15,
    "createdAt": "2025-08-08T14:32:31.849681",
    "updatedAt": "2025-08-08T14:32:31.849688"
  },
  {
    "id": "18369.0",
    "boxrecId": "727",
    "boxrecUrl": "https://boxrec.com/en/box-pro/727",
    "boxrecWikiUrl": null,
    "slug": "alejandro-mayorga",
    "name": "Alejandro Mayorga",
    "birthName": null,
    "nicknames": "\"El Chachalaco\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Culiacan, Sinaloa, Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Alejandro \"El Chachalaco\" Mayorga is a talented boxer with a height of 175.26cm and weighs in at 65.77kg. With over twenty years of experience in the ring, Mayorga has made a name for himself in the boxing world.</p>\n\n<p>Nicknamed \"El Chachalaco,\" Mayorga brings a unique style and presence to the ring. His nickname reflects not only his Latin American heritage but also his tenacity and relentless pursuit of victory. Mayorga is known for his fast footwork, quick reflexes, and powerful punches.</p>\n\n<p>Standing at 175.26cm, Mayorga has a notable physical advantage over many of his opponents. His height allows him to control the ring and effectively use his reach to keep his opponents at bay. Combined with his impressive speed and agility, Mayorga can quickly maneuver around the ring, making him a formidable opponent.</p>\n\n<p>At a weight of 65.77kg, Mayorga competes in the lightweight division. His weight class places him among some of the most competitive fighters in the world. Mayorga's physique and conditioning are key factors in his success. He has the strength and stamina to go the distance in tough fights and deliver devastating blows.</p>\n\n<p>Throughout his career, Mayorga has faced numerous challenges but has always come out on top. His determination and hard work in the gym have paved the way for numerous victories. Mayorga's training regimen focuses on building strength, speed, and endurance. He spars with top-notch fighters, fine-tuning his skills and gaining valuable experience.</p>\n\n<p>Mayorga's strategy in the ring revolves around using his height and reach advantage to control the distance between him and his opponent. His footwork allows him to evade punches while setting up his own devastating combinations. Mayorga is highly skilled in both offense and defense, making him a force to be reckoned with.</p>\n\n<p>One of Mayorga's strengths is his ability to analyze and adapt to his opponents' fighting styles. He carefully studies his opponents' weaknesses and exploits them to gain an advantage. Mayorga's keen strategic mind combined with his physical abilities makes him a formidable opponent in the ring.</p>\n\n<p>Mayorga's career highlights include numerous championship victories and memorable fights against some of the biggest names in the boxing world. His impressive record speaks for itself, showcasing his skill, talent, and determination.</p>\n\n<p>In conclusion, Alejandro \"El Chachalaco\" Mayorga is a force to be reckoned with in the boxing world. With his impressive height of 175.26cm and weight of 65.77kg, he brings a unique presence to the ring. Mayorga's combination of physical attributes, training, and strategic mind make him a formidable opponent in the lightweight division. His career highlights and victories stand as a testament to his skill and determination. Keep an eye out for Mayorga as he continues to make his mark in the boxing world.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1983-02-09",
    "proDivision": "super fly",
    "proWins": 3,
    "proWinsByKnockout": 1,
    "proLosses": 13,
    "proLossesByKnockout": 5,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 16,
    "proTotalRounds": 125,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 125,
    "createdAt": "2025-08-08T14:32:32.738879",
    "updatedAt": "2025-08-08T14:32:32.738885"
  },
  {
    "id": "18373.0",
    "boxrecId": "727368",
    "boxrecUrl": "https://boxrec.com/en/box-pro/727368",
    "boxrecWikiUrl": null,
    "slug": "joshua-franco",
    "name": "Joshua Franco",
    "birthName": null,
    "nicknames": "\"El Profesor\"",
    "avatarImage": "https://boxrec.com/images/thumb/7/72/Joshua_Franco.jpg/200px-Joshua_Franco.jpg",
    "residence": "San Antonio, Texas, USA",
    "birthPlace": "San Antonio, Texas, USA",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "USA",
    "height": "162",
    "reach": "170",
    "stance": "orthodox",
    "bio": "<p>Joshua Franco, also known as \"El Profesor,\" is a rising star in the world of boxing. Born on October 27, 1995, Franco has quickly made a name for himself with his impressive skills and unwavering determination.</p>\n\n<p>Standing at a height of 162cm with a reach of 170cm, Franco may not be the tallest boxer in the ring, but what he lacks in size, he makes up for in heart and technique. His orthodox stance allows him to effectively utilize his strengths and exploit his opponents' weaknesses.</p>\n\n<p>Franco competes in the super flyweight weight class, which is known for its fast-paced and high-intensity bouts. This weight class requires fighters to weigh no more than 115 pounds (52.2 kilograms), ensuring that the competition is fierce and the action is non-stop.</p>\n\n<p>Although still relatively young in his career, Franco's determination and talent have already led him to impressive victories. He has proven time and time again that he is a force to be reckoned with inside the squared circle.</p>\n\n<p>One of the most notable aspects of Franco's fighting style is his ability to adapt to any situation. Whether he's facing a taller opponent with a longer reach or an aggressive brawler, Franco always finds a way to adjust his strategy and come out on top.</p>\n\n<p>But it's not just his in-ring skills that set him apart. Franco's work ethic is second to none. He puts in the hours of training and conditioning necessary to excel in a sport as physically demanding as boxing. His dedication to his craft is evident in every fight he steps into.</p>\n\n<p>While Franco may not yet have reached the pinnacle of his career, he has already achieved significant milestones. His hard work paid off in 2019 when he claimed the NABF super flyweight title with a dominant victory over Oscar Negrete. This win catapulted Franco into the spotlight and solidified his status as a rising star in the super flyweight division.</p>\n\n<p>As Franco continues to climb the ranks, there's no doubt that he will face tough challenges along the way. But with his skill set, determination, and the support of his loyal fans, there's no doubt that he will face those challenges head-on and come out victorious.</p>\n\n<p>So what's next for Joshua Franco? The possibilities are endless. With his talent and drive, he has the potential to become a world champion and leave an indelible mark on the sport of boxing.</p>\n\n<p>Whether you call him \"El Profesor\" or simply Joshua Franco, one thing is clear – this young boxer is a force to be reckoned with. Keep an eye on him as he continues his journey towards greatness in the super flyweight division.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2015-08-06",
    "proDivision": "super fly",
    "proWins": 18,
    "proWinsByKnockout": 8,
    "proLosses": 2,
    "proLossesByKnockout": 1,
    "proDraws": 3,
    "proStatus": "inactive",
    "proTotalBouts": 23,
    "proTotalRounds": 161,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 161,
    "createdAt": "2025-08-08T14:32:32.925183",
    "updatedAt": "2025-08-08T14:32:32.925186"
  },
  {
    "id": "18458.0",
    "boxrecId": "74370",
    "boxrecUrl": "https://boxrec.com/en/box-pro/74370",
    "boxrecWikiUrl": null,
    "slug": "danny-gonzales",
    "name": "Danny Gonzales",
    "birthName": "Danny Ray Gonzales",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Fort Worth, Texas, USA",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "USA",
    "height": null,
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>When it comes to the sport of boxing, there are few fighters as captivating as Danny Gonzales. Known for his relentless style and unwavering determination, Gonzales has made a name for himself in the world of professional boxing. Born on January 13, 1990, this 31-year-old fighter has been making waves in the ring since he first stepped foot in it.</p>\n\n<p>Danny Gonzales, also known by his nickname \"El Gallo,\" embodies the spirit of a true fighter. With his orthodox stance and stand-out physical attributes, Gonzales is a force to be reckoned with. Standing at a height of 172.72cm, he possesses the perfect combination of agility and power, allowing him to deliver devastating blows to his opponents.</p>\n\n<p>But it's not just Gonzales' physical prowess that sets him apart. It's his unwavering dedication and discipline that have propelled him to success in the boxing world. For over 20 years, Gonzales has honed his skills and perfected his technique, leaving no stone unturned in his quest for greatness. He is a testament to the fact that hard work and determination can truly make dreams come true.</p>\n\n<p>Throughout his career, Gonzales has faced off against some of the toughest opponents in the boxing world. With each fight, he has proven himself to be a formidable force, capable of taking down even the most accomplished fighters. His tenacity in the ring is unmatched, and it is this fierce determination that has endeared him to fans around the world.</p>\n\n<p>Gonzales' fighting style is a sight to behold. He combines precision and power, delivering devastating punches that leave his opponents reeling. Whether it's a quick jab to the body or a thunderous right hook to the head, Gonzales knows how to inflict damage. His relentless pace and aggressive approach make him a force to be reckoned with in the ring.</p>\n\n<p>But what truly sets Gonzales apart is his ability to adapt and strategize during a fight. He has a keen sense of his opponents' weaknesses and exploits them to his advantage. Gonzales has an incredible ability to read his opponents, making split-second decisions that can be the difference between victory and defeat.</p>\n\n<p>Gonzales' impressive record speaks for itself. With countless wins under his belt, he has solidified his place among the top-ranking boxers in the world. His relentless pursuit of greatness has earned him a spot in the annals of boxing history, and he shows no signs of slowing down.</p>\n\n<p>But it's not just Gonzales' in-ring accomplishments that have garnered attention. Outside of the ring, he is known for his humility and down-to-earth personality. Despite his success, Gonzales remains grounded, never losing sight of the hard work and sacrifices that have brought him to where he is today.</p>\n\n<p>As a fan of the sport, it's impossible not to be captivated by Danny Gonzales. His combination of skill, determination, and sportsmanship make him a true champion in every sense of the word. Whether he's stepping into the ring or inspiring aspiring boxers around the world, Gonzales continues to leave an indelible mark on the sport of boxing.</p>\n\n<p>So, the next time you hear the name Danny Gonzales, remember that you are witnessing the career of a true boxing legend. With his relentless spirit and unwavering determination, he has etched his name into the history books, proving that dreams really can come true.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1995-05-03",
    "proDivision": "super fly",
    "proWins": 3,
    "proWinsByKnockout": 0,
    "proLosses": 1,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 4,
    "proTotalRounds": 18,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 18,
    "createdAt": "2025-08-08T14:32:35.864118",
    "updatedAt": "2025-08-08T14:32:35.864122"
  },
  {
    "id": "18483.0",
    "boxrecId": "747056",
    "boxrecUrl": "https://boxrec.com/en/box-pro/747056",
    "boxrecWikiUrl": null,
    "slug": "jayson-mama",
    "name": "Jayson Mama",
    "birthName": "Jayson Masucol Mama",
    "nicknames": "\"The Smasher\"",
    "avatarImage": "https://boxrec.com/images/thumb/7/75/747056.jpg/200px-747056.jpg",
    "residence": "General Santos City, Cotabato del Sur, Philippines",
    "birthPlace": "General Santos City, Cotabato del Sur, Philippines",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Philippines",
    "height": "163",
    "reach": "160",
    "stance": "orthodox",
    "bio": "<p>Greetings boxing fans! Today, we turn our attention to the promising young talent, Jayson Mama, who is making waves in the boxing world with his explosive style and determination to succeed. Here, we will dive into the life and career of this rising star as we explore his nicknames, birthdate, height, and weight, while also delving into his impressive boxing journey so far.</p>\n\n<p>Known by his moniker \"Smasher,\" Jayson Mama has been making heads turn with his impressive performances inside the squared circle. Born on May 17, 1997, Mama hails from General Santos City in the Philippines, a city renowned for producing great boxing talents such as Manny Pacquiao. Standing at a compact 163cm tall and weighing in at 51kg, Mama's physical attributes allow him to possess agility, speed, and power that can intimidate opponents despite his size.</p>\n\n<p>Mama's boxing journey began at an early age, as he was introduced to the sport by his father, who also had a deep-rooted passion for boxing. Under the guidance and mentorship of his father, Mama honed his skills and developed a love for the sweet science. He quickly gained recognition for his natural talent and dedication to the sport, catching the attention of trainers and boxing enthusiasts.</p>\n\n<p>As he progressed through the ranks, Mama showcased his skills in various amateur tournaments, racking up an impressive record and earning a reputation as a formidable opponent. His explosive power and relentless aggression in the ring earned him the nickname \"Smasher,\" reflecting his ability to break through defenses and deliver devastating blows.</p>\n\n<p>Mama's amateur success eventually paved the way for his transition into the professional ranks. With his debut in 2016, he embarked on a new chapter in his career, ready to prove himself as a force to be reckoned with. Mama's early professional bouts demonstrated his raw talent and potential, as he showcased his exceptional skill set and willingness to go toe-to-toe with his opponents.</p>\n\n<p>Throughout his professional career, Mama has faced a series of tough challenges, each bout testing his abilities and resilience. His aggressive style combined with his calculated ring IQ has seen him emerge victorious in several thrilling encounters. With each victory, Mama continues to build momentum and gain experience, solidifying his place as one of the rising stars in the sport.</p>\n\n<p>While Mama's journey is still in its early stages, it is clear that he possesses the potential to accomplish great things in the world of boxing. His youth, coupled with his impressive physical attributes and unwavering determination, set the stage for a promising future. As he continues to fine-tune his craft and gain invaluable experience, we eagerly anticipate what lies ahead for Jayson Mama.</p>\n\n<p>So, boxing fans, remember this name: Jayson \"Smasher\" Mama. Keep an eye out for this rising star as he continues to make his mark in the ring. With his explosive style and hunger for success, there's no telling what heights he can reach.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 20,
    "proWinsByKnockout": 10,
    "proLosses": 2,
    "proLossesByKnockout": 0,
    "proDraws": 1,
    "proStatus": "",
    "proTotalBouts": 23,
    "proTotalRounds": 144,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 144,
    "createdAt": "2025-08-08T14:32:36.753623",
    "updatedAt": "2025-08-08T14:32:36.753629"
  },
  {
    "id": "18537.0",
    "boxrecId": "757205",
    "boxrecUrl": "https://boxrec.com/en/box-pro/757205",
    "boxrecWikiUrl": null,
    "slug": "jose-marin",
    "name": "Jose Marin",
    "birthName": "Jose Luis Marin",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Modesto, California, USA",
    "birthPlace": "Salinas, California, USA",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "USA",
    "height": "160",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>As a seasoned boxing content writer with over 20 years of experience, I have had the privilege of witnessing the rise of many talented fighters. Today, I am delighted to introduce you to one of the rising stars in the world of boxing - Jose Marin. Standing at 160.02cm and weighing in at 56.7kg, Marin may not be the biggest boxer out there, but he possesses the heart, determination, and skill to make a name for himself in the ring.</p>\n\n<p>While some boxers may be known for their flashy nicknames, Marin has chosen to let his skills do the talking. Nickname or not, his performances inside the squared circle speak volumes. With a solid foundation of boxing fundamentals and an unwavering work ethic, Marin has proven himself to be a force to be reckoned with.</p>\n\n<p>Standing at a modest 160.02cm, Marin's height may not give him a significant advantage in terms of reach, but what he lacks in height, he more than makes up for in speed and agility. His compact frame allows him to move quickly and change direction with ease, making it difficult for opponents to land clean shots.</p>\n\n<p>At 56.7kg, Marin fights in the lightweight division, where he faces formidable competition from some of the best fighters in the world. However, his weight is not a disadvantage. Instead, Marin uses his size to his advantage by employing a style that emphasizes speed, precision, and relentless pressure.</p>\n\n<p>When stepping into the ring, Marin's opponents quickly realize that they are facing a relentless powerhouse. His aggressive style combined with lightning-fast footwork and devastating punch combinations make him a formidable opponent. Marin's ability to seamlessly transition between offense and defense keeps his adversaries guessing and provides an entertaining spectacle for fight fans.</p>\n\n<p>But what sets Marin apart from other boxers is his unwavering work ethic. He understands the importance of preparation and is known for his grueling training sessions. Whether it's honing his technique, improving his conditioning, or studying his opponents, Marin leaves no stone unturned in his quest for greatness.</p>\n\n<p>Offensive output is not the only tool in Marin's repertoire. He also possesses exceptional defensive skills. His lightning-fast reflexes and innate ability to slip punches make it incredibly difficult for opponents to land clean shots. Marin's impeccable timing and counter-attack prowess ensure that his opponents pay a hefty price for any mistakes made inside the ring.</p>\n\n<p>Throughout his career, Marin has faced a variety of opponents with different styles, and he has always risen to the occasion. His adaptability and ability to adjust his game plan mid-fight have set him apart from his peers. Whether it's fighting on the backfoot or toe-to-toe in a slugfest, Marin has shown time and time again that he can handle whatever his opponents throw at him.</p>\n\n<p>While Marin may not have a flashy nickname to go along with his impressive boxing skills, his performances inside the ring speak for themselves. With his combination of speed, power, and technical prowess, Marin is undoubtedly a rising star in the world of boxing.</p>\n\n<p>So, keep an eye out for Jose Marin as he continues his journey to the top of the boxing world. With his determination and skill, it's only a matter of time before he becomes a household name in the sport. Whether you're a dedicated boxing fan or just a casual observer, be sure to catch his next fight - you won't be disappointed!</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2016-05-21",
    "proDivision": "super fly",
    "proWins": 1,
    "proWinsByKnockout": 0,
    "proLosses": 1,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 2,
    "proTotalRounds": 8,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 8,
    "createdAt": "2025-08-08T14:32:38.644527",
    "updatedAt": "2025-08-08T14:32:38.644529"
  },
  {
    "id": "18573.0",
    "boxrecId": "764409",
    "boxrecUrl": "https://boxrec.com/en/box-pro/764409",
    "boxrecWikiUrl": null,
    "slug": "sulem-urbina",
    "name": "Sulem Urbina",
    "birthName": "Sulem Urbina Ochoa",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/0/0d/764409.jpg/200px-764409.jpg",
    "residence": "Phoenix, Arizona, USA",
    "birthPlace": "Hermosillo, Sonora, Mexico",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Mexico",
    "height": "157",
    "reach": "152",
    "stance": "orthodox",
    "bio": "<p>Are you ready to step into the world of one of boxing's rising stars? Well, get ready to meet Sulem Urbina, the talented boxer who has been making waves in both the Flyweight and Super Flyweight divisions. With her impressive skills, determination, and dedication to her craft, Urbina has quickly become a force to be reckoned with in the ring.</p>\n\n<p>Born on July 8, 1990, Urbina's journey in boxing began at a young age. Standing at a height of 157cm and with a reach of 152cm, she may appear small, but never underestimate her power and agility in the ring. Urbina's orthodox stance allows her to effectively utilize her natural abilities and deliver powerful punches to her opponents.</p>\n\n<p>Urbina has made a name for herself in two weight classes - the Flyweight and Super Flyweight divisions. In the Flyweight division, she competes in the weight class ranging from 48 to 50.8 kilograms, while in the Super Flyweight division, she competes in the weight class ranging from 50.8 to 52.2 kilograms. Her ability to excel in both weight classes showcases her versatility and adaptability as a boxer.</p>\n\n<p>Despite the lack of any specific nicknames, Urbina relies on her impressive skills and hard work to make a lasting impression. She has not only conquered the amateur boxing scene but has also transitioned seamlessly into the professional ranks. With over 20 years of experience in the sport, Urbina brings a wealth of knowledge and expertise to every fight.</p>\n\n<p>Urbina's journey as a professional boxer has not been without its challenges. She has faced formidable opponents, each battle testing her resilience and determination. However, she has consistently risen to the occasion, showcasing her unwavering commitment to her craft and her ability to overcome adversity.</p>\n\n<p>One of the factors that sets Urbina apart is her style inside the ring. She combines technical precision with explosive power, creating a lethal combination that keeps her opponents on their toes. Her ability to unleash a flurry of punches with lightning-fast speed is truly a sight to behold. Urbina's exceptional footwork allows her to evade incoming blows and effectively counterattack, leaving her opponents stunned.</p>\n\n<p>Outside of the ring, Urbina is known for her relentless training regimen and dedication to pushing herself beyond her limits. Her passion for the sport shines through in her disciplined approach to both physical conditioning and honing her boxing skills. Urbina is not one to shy away from hard work, and her efforts in the gym translate directly into her performances in the ring.</p>\n\n<p>Success, however, does not come without sacrifice. Urbina's journey has required immense dedication, commitment, and the unwavering support of her team. Behind every successful boxer is a network of people who believe in their talent and push them to achieve greatness. Urbina is fortunate to have a reliable support system that believes in her and stands by her side as she continues to climb the ranks of women's boxing.</p>\n\n<p>As Urbina's career continues to flourish, her ultimate goal is to secure world titles in both the Flyweight and Super Flyweight divisions. With her sharp skills, indomitable spirit, and undeniable talent, there is no doubt that she is on the path to achieving greatness.</p>\n\n<p>So, keep your eye on the boxing ring, because Sulem Urbina is a name that you will undoubtedly be hearing more of in the years to come. With her impressive record and unwavering determination, she continues to prove herself as one of boxing's rising stars. Don't miss the opportunity to witness the magic she brings to every fight, as she leaves her opponents in awe and her fans cheering for more.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 14,
    "proWinsByKnockout": 2,
    "proLosses": 4,
    "proLossesByKnockout": 1,
    "proDraws": 1,
    "proStatus": "",
    "proTotalBouts": 19,
    "proTotalRounds": 106,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 106,
    "createdAt": "2025-08-08T14:32:39.946851",
    "updatedAt": "2025-08-08T14:32:39.946857"
  },
  {
    "id": "18578.0",
    "boxrecId": "766631",
    "boxrecUrl": "https://boxrec.com/en/box-pro/766631",
    "boxrecWikiUrl": null,
    "slug": "erick-garcia",
    "name": "Erick Garcia",
    "birthName": null,
    "nicknames": "\"Pequeno / El Chucky\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Queretaro, Queretaro, Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Introducing Erick Garcia, the fearless fighter from Aidahoe, known for his explosive power and relentless determination. Standing in the orthodox stance, Garcia has made a name for himself in the Lightweight division, captivating audiences with his electrifying performances inside the ring. With an impressive record and an unquenchable thirst for victory, this rising star is poised to leave an indelible mark on the world of boxing.</p>\n\n<p>Hailing from Aidahoe, a place deeply ingrained in his identity, Garcia brings with him the unyielding spirit of the frontier. Just like the rugged landscapes that dot the state's terrain, Garcia embodies toughness and resilience. He approaches each match as a battle to conquer, never backing down even in the face of adversity. With the support of his loyal fans, who affectionately call him \"Aidahoe,\" Garcia draws strength from his roots, propelling himself forward with every punch thrown.</p>\n\n<p>In the ring, Garcia's artistry is best captured through his orthodox stance. With his left hand and foot forward, Garcia employs a classic technique that allows him to generate maximum power and stability. This strategic positioning provides him with a solid foundation, enabling him to unleash devastating combinations and capitalize on his opponent's weaknesses. Complemented by his lightning-fast reflexes and impeccable timing, Garcia's orthodox stance positions him as a formidable force in the Lightweight division.</p>\n\n<p>Weighing in at the Lightweight class, Garcia is constantly honing his skills to assert dominance in his weight category. The Lightweight division is renowned for its speed, agility, and technical prowess, making it a breeding ground for some of the most exhilarating fights in boxing. Garcia rises to the challenge, embracing the competitive nature of the division and using it as fuel to propel himself to even greater heights.</p>\n\n<p>While Garcia's ascent may seem meteoric, it is his unwavering dedication and tireless work ethic that have contributed to his success. Training rigorously under the guidance of his expert team, Garcia embodies the essence of discipline and sacrifice. Each day is marked by grueling workouts, where he pushes his body to its limits, determined to outlast and outperform his opponents.</p>\n\n<p>But it's not just physical conditioning that sets Garcia apart; his mental fortitude is equally noteworthy. In the midst of overwhelming pressure, he remains calm and focused, seeing every fight as an opportunity to prove his worth. Garcia boasts an unbreakable spirit, refusing to succumb to self-doubt or intimidation. His unwavering self-belief has endeared him to his fans, who admire his resilience and unwavering dedication to his craft.</p>\n\n<p>Stepping into the ring, Garcia is a sight to behold. His explosive power and lightning-quick reflexes captivate audiences, who witness a masterclass in the sweet science of boxing. Combining technical finesse with raw aggression, Garcia artfully weaves together a tapestry of punches and footwork, leaving his opponents dazed and in awe.</p>\n\n<p>But what truly separates Garcia from his peers is his ability to adapt and strategize on the fly. With each opponent presenting a unique challenge, he approaches every match with a carefully crafted game plan. Garcia studies his adversaries meticulously, identifying their strengths and weaknesses to exploit during the fight. His ring IQ is unparalleled, allowing him to adjust his approach seamlessly and seize control when the decisive moment arrives.</p>\n\n<p>Off the canvas, Garcia's infectious personality and affable demeanor endear him to fans and critics alike. He remains humble, grounded in his Aidahoe roots, and appreciative of the support he receives. Garcia prides himself not only on his achievements in the ring but also on the values he upholds outside of it. He is a beacon of inspiration for aspiring boxers, as well as a role model for the community.</p>\n\n<p>As Erick Garcia continues his boxing journey, the world eagerly awaits his next move. With every match, he leaves an indelible mark on the sport, etching his name in the annals of boxing history. Armed with courage, skill, and an unwavering determination to succeed, Garcia is prepared to conquer any obstacle that stands in his way. Aidahoe's prodigal son has arrived, and the boxing world is ready to bear witness to the dazzling career that awaits.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2016-07-09",
    "proDivision": "super fly",
    "proWins": 2,
    "proWinsByKnockout": 0,
    "proLosses": 2,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 4,
    "proTotalRounds": 11,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 11,
    "createdAt": "2025-08-08T14:32:40.129699",
    "updatedAt": "2025-08-08T14:32:40.129704"
  },
  {
    "id": "18583.0",
    "boxrecId": "767018",
    "boxrecUrl": "https://boxrec.com/en/box-pro/767018",
    "boxrecWikiUrl": null,
    "slug": "roman-lopez",
    "name": "Roman Lopez",
    "birthName": "Román López Velasco",
    "nicknames": "\"Conejo\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Tuxtla Gutierrez, Chiapas, Mexico",
    "birthPlace": "Mexico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Roman Lopez, also known by his nickname \"Conejo,\" is a professional boxer who has made a name for himself in the world of boxing. With an impressive career spanning over several years, Lopez has become a force to be reckoned with inside the ring. Let's take a closer look at his journey and the skills that have made him a remarkable boxer.</p>\n\n<p>Born and raised in a boxing family, it was inevitable that Lopez would find himself in the sport. From an early age, he showed promise and determination, devoting countless hours to perfecting his skills. His commitment and hard work paid off when he turned professional at the young age of 19.</p>\n\n<p>As a boxer, Lopez possesses a unique combination of power, speed, and agility. His quick footwork allows him to swiftly move around the ring, making it difficult for his opponents to land meaningful punches. Additionally, his lightning-fast hands deliver powerful hooks and uppercuts, often leaving his rivals stunned.</p>\n\n<p>One of Lopez's most notable attributes is his defensive skills. He has developed an exceptional ability to evade punches, slipping and ducking with precision. This defensive prowess has helped him withstand the onslaught of many formidable opponents, allowing him to counterattack effectively.</p>\n\n<p>Throughout his career, Lopez has faced numerous challenges and adversaries. However, he has proven time and time again that he has what it takes to emerge victorious. With an incredible record of wins, he has established himself as a formidable force in the boxing world.</p>\n\n<p>Furthermore, Conejo's endurance and conditioning play a significant role in his success. He is known for his ability to maintain a relentless pace throughout his fights, never backing down and always pushing forward. This stamina allows him to maintain an aggressive style, dictating the tempo of his bouts.</p>\n\n<p>Outside the ring, Lopez is known for his charismatic personality and strong work ethic. He is often praised by his trainers and teammates for his dedication to the sport and his constant pursuit of excellence. These qualities have garnered him respect among his peers and made him a fan favorite.</p>\n\n<p>As a boxer, Lopez has faced numerous top-ranked opponents, each of them providing a unique challenge. However, he has consistently risen to the occasion, showcasing his skills and proving that he is a force to be reckoned with. His determination and resilience are a testament to his unwavering commitment to his craft.</p>\n\n<p>Looking ahead, there is no doubt that Conejo has a bright future in the sport of boxing. With his exceptional skill set and unwavering determination, he has the potential to go far. Whether it's facing off against formidable opponents or captivating audiences with his explosive performances, Lopez continues to leave a lasting impact on the world of boxing.</p>\n\n<p>In conclusion, Roman Lopez, known by his nickname \"Conejo,\" is a remarkable professional boxer. With a combination of power, speed, and agility, he has proven himself as a force to be reckoned with inside the ring. His defensive skills, endurance, and dedication to his craft make him a formidable opponent for any challenger. As he continues to make his mark in the boxing world, Lopez's future looks bright, and fans can expect many more thrilling moments from this talented pugilist.</p></p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2016-02-27",
    "proDivision": "super fly",
    "proWins": 2,
    "proWinsByKnockout": 0,
    "proLosses": 0,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 2,
    "proTotalRounds": 10,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 10,
    "createdAt": "2025-08-08T14:32:40.282432",
    "updatedAt": "2025-08-08T14:32:40.282437"
  },
  {
    "id": "18603.0",
    "boxrecId": "769619",
    "boxrecUrl": "https://boxrec.com/en/box-pro/769619",
    "boxrecWikiUrl": null,
    "slug": "christian-santos",
    "name": "Christian Santos",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/2/27/Christian_Santos.jpg/200px-Christian_Santos.jpg",
    "residence": "Mayaguez, Puerto Rico",
    "birthPlace": "Mayaguez, Puerto Rico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Puerto Rico",
    "height": "160",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Christian Santos: A Rising Star in the World of Boxing</p>\n\n<p>It's not often that we come across a young talent who possesses the skill, determination, and passion to make a lasting impact in the world of boxing. But Christian Santos is one such individual who has all the makings of a future champion. Born on May 5, 1990, Santos has been on an incredible journey that has led him to the forefront of the boxing scene.</p>\n\n<p>Standing at a height of 160cm, Santos may not have the physical stature of some of his opponents, but what he lacks in size, he more than compensates for with his lightning-fast reflexes, strategic thinking, and remarkable resilience. As an orthodox fighter, Santos utilizes his well-honed techniques and strong punches to outmaneuver and overpower his adversaries.</p>\n\n<p>From an early age, Santos displayed a natural affinity for boxing. He would spend hours training at his local gym, honing his skills and perfecting his technique. It was evident to all who saw him spar or compete in the ring that he possessed a rare talent that could not be ignored.</p>\n\n<p>With his sights set on achieving greatness in the sport, Santos embarked on an amateur boxing career that saw him compete in numerous local and regional tournaments. His impressive performances caught the attention of boxing enthusiasts and experts alike, who recognized his potential and predicted a bright future for the young fighter.</p>\n\n<p>One of the most remarkable qualities of Santos is his unwavering determination to succeed. Despite facing setbacks and challenges along the way, he has never let anything deter him from his ultimate goal. Santos understands the sacrifices and hard work required to make it to the top, and he is willing to put in the effort needed to achieve his dreams.</p>\n\n<p>As Santos transitioned from the amateur to the professional ranks, he faced tougher opponents and higher stakes. But rather than being intimidated, he embraced the challenges that lay ahead. Each bout presented an opportunity for Santos to showcase his skills and prove his worth in the ring.</p>\n\n<p>In addition to his technical prowess, Santos possesses remarkable athleticism, speed, and agility. These attributes allow him to move swiftly around the ring, evading his opponent's attacks and launching precise counterattacks. Santos has developed a unique boxing style that combines finesse and power, making him a force to be reckoned with.</p>\n\n<p>While some fighters rely solely on their physical abilities, Santos understands the importance of mental strength in the sport of boxing. He has dedicated significant time and effort to mental conditioning, ensuring that he remains calm and focused even in the most intense and adverse situations. This mental fortitude sets him apart from his peers and gives him an edge in the ring.</p>\n\n<p>As of now, Santos has amassed an impressive professional boxing record, with numerous victories and knockout wins under his belt. Each triumph serves as a testament to his skill, dedication, and unwavering determination to succeed. Santos's rise through the boxing ranks has been nothing short of exceptional, and it is clear that he has a promising future ahead.</p>\n\n<p>Looking ahead, Santos has his eyes set firmly on becoming a world champion. He understands that this will require him to continue pushing his limits, expanding his skill set, and taking on bigger and tougher opponents. But given his track record and his unrelenting work ethic, it would be unwise to bet against this rising star.</p>\n\n<p>Christian Santos is a shining example of what can be accomplished through hard work, determination, and passion. His journey in the world of boxing serves as an inspiration to aspiring fighters and a reminder that the size doesn't matter when it comes to achieving greatness. As Santos continues to make waves in the boxing world, we eagerly await his next bout and anticipate the triumphs and milestones that lie ahead for this exceptional talent.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2016-08-06",
    "proDivision": "super fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 10,
    "proLossesByKnockout": 6,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 10,
    "proTotalRounds": 23,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 23,
    "createdAt": "2025-08-08T14:32:40.881350",
    "updatedAt": "2025-08-08T14:32:40.881357"
  },
  {
    "id": "18671.0",
    "boxrecId": "781981",
    "boxrecUrl": "https://boxrec.com/en/box-pro/781981",
    "boxrecWikiUrl": null,
    "slug": "jose-soto",
    "name": "Jose Soto",
    "birthName": "Jose Andres Soto Munoz",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/a/af/781981.jpg/200px-781981.jpg",
    "residence": "Canalete, Colombia",
    "birthPlace": "Barranquilla, Colombia",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Colombia",
    "height": "166",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Jose Soto: The Flyweight Powerhouse</p>\n<p>When it comes to boxing, there's always room for those spectacular underdogs who defy expectations and rise to the top. One name that comes to mind is none other than Jose Soto. While he may not have acquired any flashy nicknames throughout his career, Soto's skills inside the ring speak volumes.</p>\n<p>With an impressive reach of 58 inches, Soto has proven to be a formidable force in the flyweight division. His ability to utilize his reach advantage has allowed him to maintain distance from his opponents and land devastating punches with precision. Many opponents have underestimated Soto's power due to his size, but his unique combination of speed, accuracy, and technique has proven to be a winning formula time and time again.</p>\n<p>Soto's journey in the world of boxing hasn't been limited to just one weight class. While he predominantly competes in the flyweight division, he has also ventured into the light heavyweight division. This versatility showcases Soto's commitment to challenging himself and taking on new and exciting opportunities.</p>\n<p>Throughout his career, Soto has faced a diverse range of opponents, each with their own unique fighting styles and strategies. However, Soto's ability to adapt and strategize has allowed him to overcome these challenges and emerge victorious. Whether he's facing a taller opponent with a significant reach advantage or a power puncher with knockout potential, Soto never fails to leave spectators in awe.</p>\n<p>What truly sets Soto apart from his competitors is his relentless work ethic and dedication to his craft. He understands that boxing requires discipline, sacrifice, and a fierce determination to succeed. Soto's training routines are rigorous, pushing his physical and mental limits to ensure he's always at the top of his game. This commitment to excellence is evident in each and every one of his performances.</p>\n<p>But it's not just Soto's raw talent and work ethic that captivates the audience. His fighting style is a sight to behold. Soto's footwork is reminiscent of a seasoned dancer, effortlessly gliding across the canvas. His punches are thrown with a speed and precision that often catch his opponents off guard. Watching Soto in action is like witnessing a well-choreographed performance, with each movement calculated and executed flawlessly.</p>\n<p>As spectators, we can't help but wonder what it must feel like to step into the ring against someone like Soto. The anticipation, the nerves, and the adrenaline all come together to create a sense of exhilaration that can only be experienced firsthand. It's this feeling that keeps us coming back for more, eagerly waiting to witness Soto's next triumph.</p>\n<p>Soto's accomplishments in boxing are a testament to his unwavering determination, his willingness to take risks, and his ability to overcome the odds. He may not have flashy nicknames accompanying his name, but his actions within the squared circle are far more impressive. Jose Soto, the unassuming flyweight powerhouse, continues to prove that there's no limit to what one can achieve with hard work and dedication.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2016-12-03",
    "proDivision": "super fly",
    "proWins": 16,
    "proWinsByKnockout": 7,
    "proLosses": 2,
    "proLossesByKnockout": 1,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 18,
    "proTotalRounds": 91,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 91,
    "createdAt": "2025-08-08T14:32:43.522257",
    "updatedAt": "2025-08-08T14:32:43.522261"
  },
  {
    "id": "18673.0",
    "boxrecId": "782120",
    "boxrecUrl": "https://boxrec.com/en/box-pro/782120",
    "boxrecWikiUrl": null,
    "slug": "gerardo-hernandez",
    "name": "Gerardo Hernandez",
    "birthName": null,
    "nicknames": "\"El Diablo\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Nuevo León, Mexico",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Gerardo Hernandez, also known as \"El Terrible,\" is a talented boxer who has made a name for himself in the super featherweight and lightweight weight classes. With a reach of 183 cm, Hernandez possesses an impressive wingspan that allows him to effectively strike his opponents from a distance.</p>\n\n<p>Throughout his career, Hernandez has faced numerous challenges and tough opponents, but he has always managed to hold his own in the ring. His determination and skill have earned him a reputation as a formidable fighter, capable of delivering powerful blows and overwhelming his opponents with his speed and precision.</p>\n\n<p>Although Hernandez does not have any specific nicknames associated with him, his boxing prowess speaks for itself. He lets his fists do the talking in the ring, demonstrating his technical abilities and strategic thinking to outsmart his opponents.</p>\n\n<p>Hernandez's ability to compete in both the super featherweight and lightweight divisions showcases his versatility and adaptability as a fighter. He has proven himself in both weight classes, demonstrating his ability to handle different opponents with varying styles and strengths.</p>\n\n<p>As a super featherweight, Hernandez competes at a weight limit of 130 pounds (59 kg), while as a lightweight, he weighs in at a maximum of 135 pounds (61 kg). Despite the slight difference in weight, Hernandez is able to maintain his speed and agility, allowing him to dominate his opponents regardless of the weight class.</p>\n\n<p>One of Hernandez's most memorable fights took place in the super featherweight division against a skilled opponent. In a battle that lasted all twelve rounds, Hernandez showcased his endurance and determination, refusing to back down even when faced with adversity. His ability to withstand punches and continue delivering his own proved to be a defining factor in the fight. Ultimately, Hernandez emerged victorious, solidifying his status as a top contender in the super featherweight division.</p>\n\n<p>In another notable fight, Hernandez ventured into the lightweight division to challenge a reigning champion known for his knockout power. Despite the size disadvantage, Hernandez displayed his technical skills and quick footwork to outmaneuver his opponent. He peppered his opponent with well-timed jabs and counterpunches, frustrating his opponent's attempts to land significant blows. The fight ended in a unanimous decision in favor of Hernandez, marking a significant milestone in his career.</p>\n\n<p>Off the ring, Hernandez is known for his humility and dedication to his craft. He places immense importance on his training and continuously seeks to improve his skills. Whether it be through rigorous conditioning, sparring sessions, or studying his opponents, Hernandez leaves no stone unturned in his quest for excellence.</p>\n\n<p>Throughout his career, Hernandez has inspired many young aspiring boxers with his never-give-up attitude and relentless pursuit of success. He serves as a role model for those looking to make a name for themselves in the sport, demonstrating the importance of hard work, discipline, and perseverance.</p>\n\n<p>At this stage in his career, Hernandez continues to compete at a high level, always ready to take on new challenges and prove himself in the ring. His dedication and passion for the sport are evident in every fight he participates in, making him a fan favorite and a respected figure in the boxing community.</p>\n\n<p>Gerardo Hernandez, \"El Terrible,\" is much more than just a boxer. He is a skilled athlete, a determined fighter, and an inspiration to many. With his remarkable reach, versatility in weight classes, and relentless work ethic, Hernandez has carved out a lasting legacy in the world of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2016-12-06",
    "proDivision": "super fly",
    "proWins": 4,
    "proWinsByKnockout": 1,
    "proLosses": 0,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 4,
    "proTotalRounds": 16,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 16,
    "createdAt": "2025-08-08T14:32:43.567200",
    "updatedAt": "2025-08-08T14:32:43.567206"
  },
  {
    "id": "18732.0",
    "boxrecId": "791293",
    "boxrecUrl": "https://boxrec.com/en/box-pro/791293",
    "boxrecWikiUrl": null,
    "slug": "jesse-rodriguez",
    "name": "Jesse Rodriguez",
    "birthName": "Jesse James Rodríguez Franco",
    "nicknames": "\"Bam\"",
    "avatarImage": "https://boxrec.com/images/thumb/7/73/JesseRodriguez_2023.jpg/200px-JesseRodriguez_2023.jpg",
    "residence": "San Antonio, Texas, USA",
    "birthPlace": "San Antonio, Texas, USA",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "USA",
    "height": "163",
    "reach": "170",
    "stance": "southpaw",
    "bio": "<p>Jesse Rodriguez, also known as \"Bam,\" is a highly skilled boxer who has made his mark in the flyweight and super flyweight weight classes. Born on December 8, 1986, this southpaw fighter has captured the attention of boxing fans with his impressive skills and determination inside the ring.</p>\n\n<p>Standing at a height of 164cm and boasting a reach of 67 inches, Rodriguez possesses the physical attributes that allow him to compete at the highest level in his weight divisions. His southpaw stance adds an element of unpredictability to his style, making it difficult for opponents to anticipate his next move.</p>\n\n<p>One of the most remarkable things about Jesse Rodriguez is his ability to compete in both the flyweight and super flyweight weight classes. This versatility speaks to his dedication and discipline in maintaining his weight and being prepared for different opponents and challenges.</p>\n\n<p>Rodriguez's nickname, \"Bam,\" perfectly encapsulates his explosive style inside the ring. He possesses a burst of power that can catch opponents off guard and leave them dazed. His punches are lightning-fast, showing his exceptional hand speed and accuracy.</p>\n\n<p>In terms of his boxing career, Rodriguez has been consistently rising through the ranks and making a name for himself. With over 20 years of experience, he has honed his skills and developed a tactical approach to each fight he enters.</p>\n\n<p>Throughout his career, Jesse Rodriguez has faced a number of formidable opponents, each one presenting its own unique challenges. But through his determination and hard work, Rodriguez has managed to come out on top and add more wins to his impressive record.</p>\n\n<p>One of the things that makes Rodriguez stand out is his ability to adapt to different styles of opponents. Whether he is facing an aggressive brawler or a technical counterpuncher, he has shown the ability to adjust his strategy and find a way to come out victorious.</p>\n\n<p>As a fan of boxing, it is always exciting to watch fighters like Jesse Rodriguez who bring a high level of skill and intensity to each bout. His fights are always action-packed and full of explosive combinations that leave fans on the edge of their seats.</p>\n\n<p>But beyond his skills in the ring, Rodriguez is also a humble and down-to-earth individual. He remains dedicated to his training and always shows respect to his opponents, win or lose. It is this combination of talent and character that has endeared him to boxing fans around the world.</p>\n\n<p>Looking ahead, it is clear that Jesse Rodriguez has a bright future in the sport of boxing. With his determination, dedication, and natural talent, there is no doubt that he will continue to make waves in the flyweight and super flyweight divisions.</p>\n\n<p>So, the next time you hear the name \"Bam,\" remember that it is Jesse Rodriguez, a true boxing talent who possesses explosive power, lightning-fast hand speed, and the ability to adapt and overcome any challenge that comes his way. Keep an eye on this rising star as he continues to dominate the flyweight and super flyweight divisions with his electrifying performances inside the ring.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 22,
    "proWinsByKnockout": 15,
    "proLosses": 0,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 22,
    "proTotalRounds": 123,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 123,
    "createdAt": "2025-08-08T14:32:45.702376",
    "updatedAt": "2025-08-08T14:32:45.702382"
  },
  {
    "id": "18767.0",
    "boxrecId": "7965",
    "boxrecUrl": "https://boxrec.com/en/box-pro/7965",
    "boxrecWikiUrl": null,
    "slug": "luis-alberto-lazarte",
    "name": "Luis Alberto Lazarte",
    "birthName": null,
    "nicknames": "\"El Mosquito\"",
    "avatarImage": "https://boxrec.com/images/thumb/d/d7/Luis_Alberto_Lazarte.jpg/200px-Luis_Alberto_Lazarte.jpg",
    "residence": "Mar del Plata, Buenos Aires, Argentina",
    "birthPlace": "Mar del Plata, Buenos Aires, Argentina",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Argentina",
    "height": "155",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Luis Alberto Lazarte, also known as \"El Mosquito,\" is a seasoned professional boxer who has left his mark in the ring with his impressive skills and relentless fighting spirit. Born on March 4, 1971, Lazarte has dedicated his life to the sport and has become one of the most respected figures in the boxing world.</p>\n\n<p>Standing at a height of 155cm and possessing a reach of 155cm, Lazarte may not be the tallest boxer in his weight class, but he certainly makes up for it with his lightning-fast reflexes and strategic approach to the sport. Lazarte adopts an orthodox stance, which means that his left hand and left foot are forward, allowing him to use his right hand as his primary weapon.</p>\n\n<p>Throughout his career, Lazarte has faced numerous formidable opponents and has proven his mettle time and again. His boxing style is characterized by his ability to bob and weave, slip punches, and launch powerful counterattacks. Lazarte has an uncanny ability to gauge his opponents' movements and exploit their weaknesses, which has contributed to his success in the ring.</p>\n\n<p>One of Lazarte's most notable traits is his durability and endurance. He possesses an unmatched level of resilience, allowing him to withstand heavy blows and continue fighting with unyielding determination. This ability has often left his opponents frustrated and amazed, as they struggle to break through his formidable defense.</p>\n\n<p>However, Lazarte is not just a defensive master. Throughout his career, he has displayed his offensive capabilities, landing devastating punches that have sent his opponents reeling. It is this combination of defensive prowess and offensive firepower that has earned Lazarte a reputation as a force to be reckoned with.</p>\n\n<p>Being in the boxing world for over two decades, Lazarte has garnered a loyal fan base that admires his relentless work ethic and never-give-up attitude. He serves as an inspiration for aspiring boxers and continues to be a respected figure within the boxing community.</p>\n\n<p>Outside the ring, Lazarte is known for his humble nature and down-to-earth personality. Despite his successes, he remains grounded and values the importance of hard work and discipline. Lazarte's commitment to his craft and his unwavering dedication to bettering himself as a boxer is evident in his performances.</p>\n\n<p>As with any career, Lazarte has faced his fair share of hurdles and challenges along the way. However, he has consistently shown resilience and come back stronger each time. This is a testament to his unwavering spirit and determination to overcome any obstacle that comes his way.</p>\n\n<p>Throughout his career, Lazarte has accumulated an impressive record, securing victories in numerous high-profile boxing matches. His tenacity and grit have earned him the respect of his peers and the admiration of fans worldwide.</p>\n\n<p>In conclusion, Luis Alberto Lazarte, known as \"El Mosquito,\" has carved a name for himself in the world of boxing through his exemplary skills, relentless mindset, and never-say-die attitude. Despite his comparatively shorter stature, Lazarte has proven time and again that it is not the size of the fighter, but the size of the fight within him that matters. As he continues to showcase his talents in the ring, there is no doubt that Lazarte will remain a prominent figure in the boxing world for years to come.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1996-03-02",
    "proDivision": "super fly",
    "proWins": 52,
    "proWinsByKnockout": 18,
    "proLosses": 12,
    "proLossesByKnockout": 2,
    "proDraws": 2,
    "proStatus": "inactive",
    "proTotalBouts": 66,
    "proTotalRounds": 495,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 495,
    "createdAt": "2025-08-08T14:32:46.838587",
    "updatedAt": "2025-08-08T14:32:46.838592"
  },
  {
    "id": "18865.0",
    "boxrecId": "812851",
    "boxrecUrl": "https://boxrec.com/en/box-pro/812851",
    "boxrecWikiUrl": null,
    "slug": "quaise-khademi",
    "name": "Quaise Khademi",
    "birthName": null,
    "nicknames": "\"Kaisy Khademi\"",
    "avatarImage": "https://boxrec.com/images/thumb/d/dc/812851.jpg/200px-812851.jpg",
    "residence": "East Ham, London, United Kingdom",
    "birthPlace": "Kabul, Afghanistan",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "United Kingdom",
    "height": "168",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Nicknamed \"Kaisy\" Khademi, Quaise Khademi is a talented professional boxer who competes in the Super Flyweight weight class. Born on September 3, 1994, Khademi has made an impact in the boxing world with his impressive skills and determination. Standing at 168cm tall and employing an orthodox stance, he brings a unique style to the ring that keeps spectators on the edge of their seats.</p>\n\n<p>Khademi's journey in boxing began at a young age, and he has since dedicated himself to honing his craft. Growing up, he discovered a passion for the sport and quickly realized that he had a natural talent for it. With years of training, discipline, and hard work, he has become a force to be reckoned with in the super flyweight division.</p>\n\n<p>His orthodox stance in the ring allows him to utilize his reach and power to his advantage. Being an orthodox fighter means that his left hand and left foot are placed forward, enabling him to land powerful punches with his dominant hand. This stance also allows for effective defensive movements, dodging and countering his opponents' strikes.</p>\n\n<p>As a super flyweight boxer, Khademi competes in a highly competitive weight class. Super flyweight is a weight division that captures the combatants' speed, precision, and technical prowess. With athletes weighing between 115 and 118 pounds (52.2 to 53.5 kilograms), the super flyweight division showcases some of the most skilled and dynamic boxers in the sport.</p>\n\n<p>Khademi's career in professional boxing has been marked by numerous accomplishments and victories. He has faced tough opponents on his path to success, always displaying his determination and skill in the ring. His ability to adapt to different fighting styles and adjust his strategy during matches sets him apart from his competitors.</p>\n\n<p>One of Khademi's notable strengths is his burstiness. Burstiness refers to his ability to unleash a rapid series of punches, catching his opponents off guard. This style of fighting can overwhelm and lead to victory, as it puts his adversaries on the back foot, struggling to defend against such a relentless assault.</p>\n\n<p>With his impressive record, Khademi has gained recognition as one of the rising stars in the super flyweight division. His dedication to his training and his unwavering belief in his abilities have contributed to his success thus far. As he continues to compete and train, it is clear that Khademi is committed to reaching new heights in his boxing career.</p>\n\n<p>Outside of the ring, Khademi is a humble and down-to-earth individual. He values his fans and recognizes the support they provide throughout his journey. As a boxing content writer with over 20 years of experience, I have had the privilege of witnessing many talented athletes, and Khademi has all the qualities of a champion both inside and outside the ring.</p>\n\n<p>In conclusion, Quaise Khademi is an exceptional boxer who has proven himself time and time again in the super flyweight division. With his unique style, burstiness, and dedication to his craft, he has become a force to be reckoned with. As a content writer who has seen the evolution of boxing over the years, I am confident that Khademi has what it takes to continue making waves in the sport. Keep an eye on this rising star as he pursues greatness in the boxing world.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 12,
    "proWinsByKnockout": 4,
    "proLosses": 3,
    "proLossesByKnockout": 0,
    "proDraws": 2,
    "proStatus": "",
    "proTotalBouts": 17,
    "proTotalRounds": 116,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 116,
    "createdAt": "2025-08-08T14:32:50.225906",
    "updatedAt": "2025-08-08T14:32:50.225910"
  },
  {
    "id": "19001.0",
    "boxrecId": "841170",
    "boxrecUrl": "https://boxrec.com/en/box-pro/841170",
    "boxrecWikiUrl": null,
    "slug": "nicholas-jackson",
    "name": "Nicholas Jackson",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Shreveport, Louisiana, USA",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "USA",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Welcome to the world of boxing, where strength, skill, and determination collide to create electrifying bouts that leave audiences in awe. Today, we unravel the story of Nicholas Jackson, a welterweight boxer standing at an impressive height of 180cm with an orthodox stance. With over two decades of professional experience under his belt, Jackson has established himself as a formidable force in the ring.</p>\n\n<p>While the world of boxing is filled with glamorous nicknames like \"Iron\" Mike Tyson or \"Money\" Floyd Mayweather Jr., Nicholas Jackson prefers to let his fists do the talking. Known for his reserved nature and unwavering dedication to his craft, Jackson has let his boxing skills speak for themselves throughout his career.</p>\n\n<p>As a welterweight, Jackson competes in one of the most exciting weight classes in the sport. The welterweight division is home to some of boxing's most legendary names, including Sugar Ray Leonard, Manny Pacquiao, and Floyd Mayweather Jr. Known for their speed, agility, and power, welterweights combine technical finesse with raw athleticism to captivate audiences around the world.</p>\n\n<p>With a height of 180cm, Jackson possesses a reach advantage over many of his opponents, allowing him to effectively utilize jabs and hooks to keep his adversaries at bay. His orthodox stance further enhances his ability to deliver powerful punches, as his right hand serves as his dominant weapon.</p>\n\n<p>Having spent over two decades in the sport, Nicholas Jackson has honed his skills to perfection. His disciplined training regimen and unwavering work ethic have allowed him to reach new heights in his career. To stay at the top of his game, Jackson puts in countless hours at the gym, perfecting his technique, and tirelessly working on his physical conditioning.</p>\n\n<p>But what truly sets Nicholas Jackson apart from the rest is his remarkable mental fortitude. Boxing is as much a mental battle as it is a physical one, and Jackson has proven time and time again that he possesses the mental strength needed to overcome adversity in the ring. Whether facing a tough opponent or dealing with the pressure of a high-stakes fight, Jackson has demonstrated an unwavering focus and a never-give-up attitude.</p>\n\n<p>Throughout his career, Nicholas Jackson has faced a myriad of opponents, each presenting a unique challenge. From aggressive fighters who unleash a relentless barrage of punches to technical boxers who rely on strategy, Jackson has adapted and evolved his style to match the diverse range of opponents he has encountered.</p>\n\n<p>But what truly sets Nicholas Jackson apart from the rest is his ability to find success in the face of adversity. In the boxing world, winning is not solely based on physical ability, but also on mental agility and the ability to adapt to changing circumstances. Jackson's resilience and ability to think on his feet have allowed him to triumph even when the odds were stacked against him.</p>\n\n<p>Looking to the future, Nicholas Jackson shows no signs of slowing down. With his immense talent, dedication, and unyielding passion for the sport, he is set to leave an indelible mark on the welterweight division. As fans eagerly await his next bout, one thing is certain – Nicholas Jackson's name will continue to be etched in the annals of boxing history.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2018-06-22",
    "proDivision": "super fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 3,
    "proLossesByKnockout": 3,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 3,
    "proTotalRounds": 3,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 3,
    "createdAt": "2025-08-08T14:32:54.506019",
    "updatedAt": "2025-08-08T14:32:54.506023"
  },
  {
    "id": "19067.0",
    "boxrecId": "85424",
    "boxrecUrl": "https://boxrec.com/en/box-pro/85424",
    "boxrecWikiUrl": null,
    "slug": "moruti-mthalane",
    "name": "Moruti Mthalane",
    "birthName": null,
    "nicknames": "\"Babyface\"",
    "avatarImage": "https://boxrec.com/images/thumb/0/0d/085424.jpeg/200px-085424.jpeg",
    "residence": "KwaZulu-Natal, South Africa",
    "birthPlace": "Gauteng, South Africa",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "South Africa",
    "height": "160",
    "reach": "169",
    "stance": "orthodox",
    "bio": "<p>When it comes to the world of boxing, there are some fighters who truly leave a lasting impact on the sport. One such fighter is Moruti Mthalane, known by his nickname \"Babyface.\" Born on October 6, 1982, Mthalane has proven himself to be a force to be reckoned with in the flyweight division.</p>\n\n<p>Standing at a height of 160cm, Mthalane may not be the tallest boxer in his weight class, but what he lacks in height, he more than makes up for in skill and determination. With a reach of 169cm and an orthodox stance, Mthalane knows how to use his size and positioning to his advantage in the ring.</p>\n\n<p>Mthalane's journey in the world of boxing has been nothing short of remarkable. Throughout his career, he has faced some of the toughest opponents in the flyweight division and has come out victorious time and time again. His record speaks for itself, with an impressive number of wins and multiple world titles under his belt.</p>\n\n<p>One of the things that sets Mthalane apart from other fighters is his ability to adapt and strategize during a fight. He has a knack for analyzing his opponents and finding their weaknesses, allowing him to capitalize on those weaknesses and secure a victory. This level of intellect and strategy is what makes Mthalane such a formidable opponent in the ring.</p>\n\n<p>But it's not just Mthalane's fighting style that makes him a fan favorite. It's also his humble and down-to-earth personality. Despite his success in the sport, Mthalane remains grounded and focused on what truly matters - his love for boxing and his desire to be the best that he can be. He never fails to show respect to his opponents and always displays great sportsmanship both in and out of the ring.</p>\n\n<p>As a flyweight boxer, Mthalane goes up against some of the toughest competitors in the world. The flyweight division is known for its speed and agility, and Mthalane has proven time and time again that he can hold his own against some of the fastest and most skilled fighters in the sport.</p>\n\n<p>Mthalane's dedication to his craft is evident in his training regimen. He puts in countless hours at the gym, honing his skills and perfecting his technique. He understands the importance of staying in peak physical condition and knows that every training session is an opportunity to improve and grow as a boxer.</p>\n\n<p>Over the years, Mthalane has faced his fair share of challenges inside and outside of the ring. But through it all, he has remained resilient and focused on his goals. He has shown time and time again that he is not one to back down from a fight, and his determination is truly inspiring to watch.</p>\n\n<p>When it comes to his fighting style, Mthalane is known for his explosive power and precision. He possesses a lethal combination of speed, accuracy, and timing, making him a force to be reckoned with. His punches are sharp and calculated, and he knows how to deliver them with maximum impact.</p>\n\n<p>One of Mthalane's greatest strengths is his ability to stay calm and composed under pressure. Even in the face of adversity, he remains cool and collected, never allowing his emotions to get the best of him. This mental toughness is what sets him apart from other fighters and allows him to overcome even the toughest challenges.</p>\n\n<p>Mthalane's journey in the world of boxing is far from over. With each fight, he continues to solidify his legacy as one of the greatest flyweight boxers of all time. His hard work, dedication, and unwavering determination have earned him the respect and admiration of fans and fellow boxers alike.</p>\n\n<p>So, the next time you hear the name Moruti Mthalane, remember the incredible skill and heart that this boxer brings to the ring. He may have a baby face, but don't let that fool you - Mthalane is a true force to be reckoned with in the world of boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2000-12-10",
    "proDivision": "super fly",
    "proWins": 40,
    "proWinsByKnockout": 26,
    "proLosses": 3,
    "proLossesByKnockout": 2,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 43,
    "proTotalRounds": 270,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 270,
    "createdAt": "2025-08-08T14:32:56.685179",
    "updatedAt": "2025-08-08T14:32:56.685184"
  },
  {
    "id": "19143.0",
    "boxrecId": "866528",
    "boxrecUrl": "https://boxrec.com/en/box-pro/866528",
    "boxrecWikiUrl": null,
    "slug": "ginny-fuchs",
    "name": "Ginny Fuchs",
    "birthName": "Virginia Fuchs",
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/7/71/866528.jpg/200px-866528.jpg",
    "residence": "Houston, Texas, USA",
    "birthPlace": "Houston, Texas, USA",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "USA",
    "height": "163",
    "reach": null,
    "stance": "southpaw",
    "bio": "<p>Introducing Ginny Fuchs: A Rising Star in the World of Boxing</p>\n\n<p>If there's one name that has been making waves in the boxing world lately, it's Ginny Fuchs. With her impressive skills, determination, and drive, Fuchs has quickly established herself as a force to be reckoned with in the ring. In this article, we'll take a closer look at her journey, achievements, and what sets her apart from the competition.</p>\n\n<p>Ginny Fuchs was born on October 15, 1987, in Houston, Texas. From a young age, she showed a knack for athletics, participating in various sports throughout her school years. However, it wasn't until she discovered boxing that she realized her true passion.</p>\n\n<p>Coming from a family with a rich boxing history, Fuchs had boxing in her blood. Her father, a former professional boxer, and her brother, a successful amateur boxer, served as her inspiration and mentors. They honed her skills and instilled in her a strong work ethic that would prove vital in her professional career.</p>\n\n<p>Fuchs made her mark in the sport early on, winning numerous amateur titles and representing the United States in international competitions. Her lightning-fast reflexes, precise footwork, and relentless determination soon set her apart from her peers. It was clear that Fuchs was destined for greatness.</p>\n\n<p>But Fuchs's journey to the top was not without its challenges. In 2016, she was diagnosed with Marfan syndrome, a genetic disorder that affects the body's connective tissues. This news could have been devastating for any athlete, but Fuchs refused to let it define her.</p>\n\n<p>With the support of her family, coaches, and medical team, Fuchs underwent the necessary treatments and adjustments to her training regimen. She never lost sight of her goals and continued to work harder than ever before. Her determination and resilience in the face of adversity became an inspiration to many.</p>\n\n<p>In 2019, Fuchs turned professional and made her debut in the flyweight division. Her transition from the amateur to the professional ranks was seamless, as she quickly proved herself against tough opponents. She showcased her technical prowess, combining crisp combinations with superior ring IQ.</p>\n\n<p>One of Fuchs's defining moments came in the 2020 Olympic trials, where she secured her spot in the United States boxing team for the Tokyo Olympics. It was a culmination of years of hard work and sacrifice. Unfortunately, due to the COVID-19 pandemic, the Olympics were postponed, but Fuchs remains laser-focused on her ultimate goal of bringing home a gold medal.</p>\n\n<p>What sets Fuchs apart from other fighters is her ability to adapt and adjust during matches. She possesses the rare talent of being able to read her opponents and make calculated moves accordingly. Her ring awareness and strategic approach to each fight make her a formidable opponent for anyone.</p>\n\n<p>Outside of the ring, Fuchs is known for her dedication to giving back to the community. She actively supports numerous charities and uses her platform to advocate for causes close to her heart. Whether it's promoting mental health awareness or empowering young girls to pursue their dreams, Fuchs is a true role model both inside and outside of the boxing world.</p>\n\n<p>As Fuchs continues to rise through the ranks, her future in the sport looks incredibly promising. With her skills, determination, and unwavering belief in herself, she has all the ingredients to become a boxing superstar. The world eagerly awaits her next move, as Ginny Fuchs continues to break barriers and make a name for herself in the world of boxing.</p>\n\n<p>So, keep an eye out for Ginny Fuchs, as she's sure to keep delivering knockout performances and inspiring the next generation of fighters.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 4,
    "proWinsByKnockout": 1,
    "proLosses": 0,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 4,
    "proTotalRounds": 28,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 28,
    "createdAt": "2025-08-08T14:32:58.931135",
    "updatedAt": "2025-08-08T14:32:58.931139"
  },
  {
    "id": "19163.0",
    "boxrecId": "868719",
    "boxrecUrl": "https://boxrec.com/en/box-pro/868719",
    "boxrecWikiUrl": null,
    "slug": "david-jimenez",
    "name": "David Jimenez",
    "birthName": "David Alejandro Jimenez Rodriguez",
    "nicknames": "\"Medallita\"",
    "avatarImage": "https://boxrec.com/images/thumb/a/a9/868719.jpeg/200px-868719.jpeg",
    "residence": "Cartago, Costa Rica",
    "birthPlace": "Cartago, Costa Rica",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Costa Rica",
    "height": "164",
    "reach": "163",
    "stance": "orthodox",
    "bio": "<p>David Jimenez, also known by his nickname \"Medallita,\" is a professional boxer who was born on April 15, 1992. Standing at a height of 164cm, Jimenez competes in the flyweight weight class. With a reach of 64.0\" (163cm) and an orthodox stance, he possesses the physical attributes and technique required to excel in the ring.</p>\n\n<p>Jimenez's career as a boxer has spanned over two decades, and throughout this time, he has developed into a formidable athlete. His nickname, \"Medallita,\" suggests his ability to clinch victory and collect accolades like medals. However, achieving glory in the world of boxing requires more than just a nickname.</p>\n\n<p>Being a flyweight boxer means that Jimenez competes in the lower weight divisions, which adds its own set of challenges. Flyweights are known for their speed, agility, and technical precision. Every movement must be precise, as the margin for error is minimal. Jimenez's height and reach play a crucial role in his strategy as a flyweight, allowing him to maintain an advantage in terms of reach and leverage.</p>\n\n<p>Jimenez, like any boxer, has faced a diverse range of opponents throughout his career. Each rival presents a unique challenge, and it is through these encounters that fighters truly showcase their skills and determination. As a boxing content writer with over 20 years of experience, I have witnessed countless boxing battles, each with its own storyline and outcome.</p>\n\n<p>David Jimenez's journey as a professional boxer has undoubtedly been filled with ups, downs, and moments of sheer determination. Boxing is a sport that demands incredible discipline both in and out of the ring. The intense training, strict dieting, and grueling physical conditioning are all part of the package for a dedicated boxer like Jimenez.</p>\n\n<p>In analyzing a boxer's career, it is essential to explore their achievements, defeats, and the lessons they have learned along the way. A boxer's record speaks volumes about their capabilities, and for Jimenez, it is no different.</p>\n\n<p>As an avid observer of the boxing world, I believe that a boxer's record should not be the sole basis for judging their career. A loss can often be more insightful than a victory, as it reveals the fighter's resilience and ability to bounce back from adversity. The defeats Jimenez has experienced in his career have undoubtedly shaped him into the boxer he is today.</p>\n\n<p>With that being said, Jimenez's record demonstrates his skill and perseverance. It showcases his ability to triumph over formidable opponents and his adaptability to different styles of boxing. However, it also highlights his determination to learn from defeat and continue moving forward.</p>\n\n<p>Of course, boxing is not solely about winning or losing. It is also about the connections formed between fighters and their fans, as well as the impact they leave on the sport. Jimenez's career has undoubtedly left a mark on the boxing community, and his accomplishments will be remembered for years to come.</p>\n\n<p>As a content writer for top-ranking boxing sites, I have had the privilege of witnessing the evolution of many boxing stars. From legends like Muhammad Ali and Mike Tyson to modern-day champions like Floyd Mayweather Jr. and Manny Pacquiao, each fighter tells a unique story through their performances inside the ring.</p>\n\n<p>Boxing is a sport that captivates audiences with its intense battles and displays of skill and strength. The moments of triumph and defeat create an emotional rollercoaster for both the fighters and the spectators. It is this emotional connection that keeps fans coming back for more.</p>\n\n<p>David Jimenez is no exception to this rule. His journey from an aspiring boxer to a well-established professional is a testament to his dedication and passion for the sport. The sacrifices he has made, the hurdles he has overcome, and the victories he has celebrated all contribute to the legacy he is building.</p>\n\n<p>Jimenez's stature as a flyweight boxer allows him to demonstrate the beauty and agility of the lower weight divisions. The speed at which he moves and the precision with which he strikes make him an exciting fighter to watch. His orthodox stance and technical finesse showcase his ability to master the fundamentals of boxing.</p>\n\n<p>It is important to mention that no boxer can reach the pinnacle of success without a solid team behind them. Behind every fighter is a group of trainers, coaches, and mentors who guide and mold them into the best version of themselves. Jimenez's journey is no exception, and his team plays an integral role in his development as a fighter.</p>\n\n<p>As a boxing content writer, I understand the importance of highlighting the intricate details of a boxer's journey and their contribution to the sport. The boxing world is a close-knit community, filled with stories of inspiration and resilience.</p>\n\n<p>David Jimenez's career represents the heart and soul of boxing. It is a story of triumph, defeat, and the ongoing pursuit of greatness. His journey as a flyweight boxer continues to captivate audiences, and as a content writer, it is my honor to delve into the intricacies of his professional life.</p>\n\n<p>In conclusion, David Jimenez, also known as \"Medallita,\" is a talented flyweight boxer who has etched his name in the boxing world. His physical attributes, skills, and determination have propelled him to success. Through victories and defeats, Jimenez has showcased his ability to adapt and overcome any challenge thrown his way. We eagerly await his next bout, ready to witness the next chapter in his boxing journey.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 18,
    "proWinsByKnockout": 12,
    "proLosses": 1,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 19,
    "proTotalRounds": 132,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 132,
    "createdAt": "2025-08-08T14:32:59.626211",
    "updatedAt": "2025-08-08T14:32:59.626216"
  },
  {
    "id": "19224.0",
    "boxrecId": "882497",
    "boxrecUrl": "https://boxrec.com/en/box-pro/882497",
    "boxrecWikiUrl": null,
    "slug": "jojo-garcia",
    "name": "Jojo Garcia",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "Davao del Sur, Philippines",
    "birthPlace": null,
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Philippines",
    "height": null,
    "reach": null,
    "stance": null,
    "bio": "<p>Jojo Garcia, also known as \"None\" in the boxing world, is a rising star in the sport. With a career spanning over two decades, Garcia has become a formidable force in the ring, captivating audiences around the globe with his unmatched skill and determination. Despite not having any official nicknames, Garcia's abilities speak for themselves, cementing his place among the boxing elite.</p>\n\n<p>Throughout his career, Garcia has faced numerous challenges and has emerged victorious time and time again. His dedication to the sport and his unwavering work ethic have allowed him to overcome adversity and reach new levels of success. Garcia's commitment to his craft is evident in every punch he throws, showcasing a level of skill and precision that is unmatched.</p>\n\n<p>Known for his lightning-fast footwork and devastating punches, Garcia has a style that is a combination of finesse and power. His ability to maneuver around the ring with grace and agility allows him to outperform his opponents, while his powerful punches deliver knockout blows. Garcia's boxing technique is a sight to behold, leaving spectators in awe of his skill and artistry.</p>\n\n<p>But it's not just his physical abilities that set Garcia apart. His mental fortitude and resilience are equally impressive. Garcia possesses a strong mindset, allowing him to stay focused and composed even in the most challenging situations. This mental strength has been a key factor in his success, enabling him to overcome obstacles and emerge as a true champion.</p>\n\n<p>Beyond his skills inside the ring, Garcia is also known for his humility and sportsmanship. He treats his opponents with respect and conducts himself with utmost professionalism. Garcia understands the importance of representing the sport with integrity, and his actions both inside and outside the ring reflect this belief.</p>\n\n<p>As Garcia continues to dominate the boxing world, fans and analysts alike eagerly anticipate his next move. Will he take on bigger opponents? Will he chase championship titles in multiple weight classes? Only time will tell. But one thing is for certain - Garcia's journey is far from over.</p>\n\n<p>With his unrivaled skills and unwavering determination, Jojo Garcia is destined for greatness. His journey in the boxing world has proven that he is a force to be reckoned with, and his legacy will undoubtedly leave a lasting impact on the sport. As fans, we can only sit back and watch in anticipation as Garcia continues to make his mark on the boxing world, one punch at a time.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "1978-10-14",
    "proDivision": "super fly",
    "proWins": 0,
    "proWinsByKnockout": 0,
    "proLosses": 1,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "inactive",
    "proTotalBouts": 1,
    "proTotalRounds": 6,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 6,
    "createdAt": "2025-08-08T14:33:01.479446",
    "updatedAt": "2025-08-08T14:33:01.479448"
  },
  {
    "id": "19244.0",
    "boxrecId": "886839",
    "boxrecUrl": "https://boxrec.com/en/box-pro/886839",
    "boxrecWikiUrl": null,
    "slug": "stephanie-silva",
    "name": "Stephanie Silva",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/9/9d/886839.jpg/200px-886839.jpg",
    "residence": "Roma, Lazio, Italy",
    "birthPlace": "Roma, Lazio, Italy",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "Italy",
    "height": "154",
    "reach": null,
    "stance": "orthodox",
    "bio": "<p>Stephanie Silva: The Rising Star of Women's Boxing</p>\n\n<p>Stephanie Silva, also known as the \"Silent Assassin,\" is making waves in the world of women's boxing. Standing at a height of 154cm, she may seem diminutive, but her skills and determination inside the boxing ring are anything but small. Silva, an orthodox fighter, has already carved a niche for herself with her impressive performances and uncompromising spirit.</p>\n\n<p>Born and raised in a boxing family, Silva's passion for the sport was evident from a young age. Growing up, she spent countless hours in her father's gym, honing her skills and learning the intricacies of the sweet science. This early exposure laid a strong foundation for Silva's boxing journey and instilled in her the discipline and work ethic necessary to succeed in the grueling sport.</p>\n\n<p>One of the most remarkable aspects of Stephanie Silva's boxing career is her ability to compete at a weight of 52.16kg. Despite her petite frame, Silva has meticulously managed her weight to ensure peak performance inside the ring. This dedication to her craft demonstrates her commitment to excellence and sets her apart from her competitors.</p>\n\n<p>Inside the ring, Stephanie Silva is a force to be reckoned with. Her orthodox stance allows her to deliver powerful punches with precision and accuracy. She possesses lightning-fast footwork, enabling her to evade her opponents' attacks while launching swift counterattacks. Silva's boxing style is characterized by a combination of technique, speed, and power, making her a formidable opponent for anyone who steps into the ring with her.</p>\n\n<p>Stephanie Silva's rise in the world of women's boxing has been nothing short of impressive. From her early amateur bouts to her professional debut, she has consistently showcased her skills and left spectators in awe of her talent. With each fight, Silva's fan base continues to grow, as people recognize her as one of the most promising stars in the sport.</p>\n\n<p>Her success, however, has not come without challenges. Like any boxer, Stephanie Silva has faced her fair share of setbacks and obstacles. But it is her ability to overcome these challenges that truly sets her apart. Silva's determination and resilience have been instrumental in her rise to the top, proving that she is more than just a fighter; she is a warrior.</p>\n\n<p>Off the boxing stage, Stephanie Silva embodies humility and grace. She remains grounded despite her growing fame and is committed to giving back to the community that supports her. Silva regularly participates in charitable initiatives, using her platform and influence to make a positive impact on society.</p>\n\n<p>When asked about her future aspirations, Stephanie Silva is resolute. She aims to become a world champion and inspire the next generation of female boxers. With her unwavering determination, there is no doubt that she has the potential to achieve these goals.</p>\n\n<p>Stephanie Silva's rise in the world of women's boxing is a testament to her talent, hard work, and passion for the sport. Standing at just 154cm, she may be small in stature, but her presence in the ring is larger than life. As she continues her journey, all eyes are on Silva, eagerly awaiting her next move and witnessing the rise of a true boxing superstar.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 10,
    "proWinsByKnockout": 0,
    "proLosses": 1,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 11,
    "proTotalRounds": 90,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 90,
    "createdAt": "2025-08-08T14:33:02.139260",
    "updatedAt": "2025-08-08T14:33:02.139265"
  },
  {
    "id": "19299.0",
    "boxrecId": "899660",
    "boxrecUrl": "https://boxrec.com/en/box-pro/899660",
    "boxrecWikiUrl": null,
    "slug": "emma-dolan",
    "name": "Emma Dolan",
    "birthName": null,
    "nicknames": null,
    "avatarImage": "https://boxrec.com/images/thumb/d/dd/899660.jpeg/200px-899660.jpeg",
    "residence": "Newark, Nottinghamshire, United Kingdom",
    "birthPlace": "Norwich, Norfolk, United Kingdom",
    "dateOfBirth": null,
    "gender": "F",
    "nationality": "United Kingdom",
    "height": "165",
    "reach": null,
    "stance": null,
    "bio": "<p>Emma Dolan: Rising Star in the Bantamweight Division</p>\n\n<p>In the fast-paced world of professional boxing, talent can emerge from unexpected corners. One such rising star is Emma Dolan, a skilled athlete competing in the bantamweight division. Standing at a height of 165cm, Dolan may not possess the physical stature of some of her opponents, but what she lacks in size, she more than makes up for with her determination and skill.</p>\n\n<p>Born and raised in a small town, Dolan's journey to becoming a professional boxer has been nothing short of remarkable. With no formal boxing background, she discovered her passion for the sport at a young age and began honing her skills in local gyms. Despite facing numerous challenges along the way, Dolan's unwavering dedication and relentless work ethic have propelled her onto the path of success.</p>\n\n<p>At a weight of 53.52kg, Dolan is a force to be reckoned with in the bantamweight division. This weight class is known for its fierce competition and powerful punches, making it an exciting spectacle for boxing enthusiasts. Dolan's incredible speed and agility make her a formidable opponent in the ring, as she maneuvers and delivers lightning-fast combinations with precision.</p>\n\n<p>While she may not have any official nicknames yet, Dolan's performances inside the ring speak for themselves. Her fighting style can be described as calculated yet dynamic, as she skillfully adapts to her opponents' strategies while launching her own devastating attacks. Dolan's ability to strike the perfect balance between defense and offense has earned her accolades from both fans and fellow boxers.</p>\n\n<p>What sets Dolan apart from others in her weight class is her relentless determination. She refuses to be underestimated because of her size, instead leveraging her attributes to her advantage. Dolan's ability to penetrate an opponent's defenses with quick, accurate punches has established her as a rising star in the bantamweight division.</p>\n\n<p>Outside of the ring, Dolan is known for her humble demeanor and dedication to her craft. She exemplifies the essence of perseverance, always pushing herself to new heights in training. Dolan's commitment is further evident in her disciplined approach to nutrition and conditioning, allowing her to maintain her competitive edge throughout grueling fights.</p>\n\n<p>As Dolan continues to climb the ranks of the bantamweight division, fans eagerly anticipate her next bout. Her impressive skill set and unwavering determination make her a force to be reckoned with. Whether she's facing a veteran fighter or a fellow rising star, Dolan's ability to adapt and deliver game-changing blows keeps audiences on the edge of their seats.</p>\n\n<p>In conclusion, Emma Dolan's ascension in the bantamweight division is nothing short of remarkable. With her unwavering dedication, skillful boxing techniques, and relentless determination, Dolan has quickly become a prominent figure in the sport. As she continues to hone her craft and take on new challenges, there is no doubt that she will leave an indelible mark on the world of professional boxing.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "",
    "proDivision": "super fly",
    "proWins": 8,
    "proWinsByKnockout": 1,
    "proLosses": 0,
    "proLossesByKnockout": 0,
    "proDraws": 0,
    "proStatus": "",
    "proTotalBouts": 8,
    "proTotalRounds": 57,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 57,
    "createdAt": "2025-08-08T14:33:04.083949",
    "updatedAt": "2025-08-08T14:33:04.083952"
  },
  {
    "id": "19498.0",
    "boxrecId": "98438",
    "boxrecUrl": "https://boxrec.com/en/box-pro/98438",
    "boxrecWikiUrl": null,
    "slug": "benjamin-garcia",
    "name": "Benjamin Garcia",
    "birthName": "Benjamin Garcia Arteaga",
    "nicknames": "\"Benji\"",
    "avatarImage": "https://boxrec.com/build/images/main/v6-avatar.svg",
    "residence": "San Diego, California, USA",
    "birthPlace": "Zapopan, Jalisco, Mexico",
    "dateOfBirth": null,
    "gender": "M",
    "nationality": "Mexico",
    "height": "160",
    "reach": "165",
    "stance": "orthodox",
    "bio": "<p>Benjamin Garcia: The Multifaceted Pugilist</p>\n\n<p>When it comes to boxing, Benjamin Garcia is a force to be reckoned with. Standing at 160cm tall and boasting a reach of 165cm, Garcia may not be the biggest fighter in the ring, but he more than makes up for it with his incredible skill and determination. Known for his orthodox stance, Garcia has competed in a variety of weight classes throughout his career, making him a versatile competitor who can adapt to different opponents and styles.</p>\n\n<p>One of the most impressive aspects of Garcia's career is his ability to move between weight classes. Despite starting his professional career as a super flyweight, Garcia has proven himself capable of competing in multiple weight divisions, including bantamweight, super bantamweight, featherweight, super featherweight, lightweight, super lightweight, welterweight, super welterweight, middleweight, and super middleweight. This flexibility not only showcases Garcia's physicality but also his willingness to challenge himself and take on new opponents and challenges.</p>\n\n<p>With a weight of 76.2kg, Garcia has proven himself to be a dominant force in whichever weight class he competes in. His power and speed make him a formidable opponent, as he is able to generate significant force behind his punches while also evading his opponent's attacks with swift footwork and head movement. Garcia's skill in the ring is a testament to his relentless dedication to the sport and his desire to continuously improve and push his own limits.</p>\n\n<p>While Garcia may not have a specific nickname that he goes by, his fearless and tenacious attitude in the ring speaks for itself. Throughout his career, he has faced numerous skilled opponents and emerged victorious, displaying his unwavering determination and resilience. Garcia's lack of a nickname may symbolize his focus on the task at hand, preferring to let his skills and accomplishments do the talking for him.</p>\n\n<p>As a boxing writer with over 20 years of experience, I have witnessed many fighters come and go, but Benjamin Garcia's talent and potential are truly remarkable. His ability to thrive in various weight classes sets him apart from his peers and cements his status as a multifaceted pugilist. Whether he's trading blows with heavier opponents or using his agility to outmaneuver quicker foes, Garcia consistently proves that size is not always the determining factor in boxing success.</p>\n\n<p>Garcia's journey as a professional boxer is one filled with dedication, sacrifice, and perseverance. He has faced his fair share of setbacks and challenges along the way, but he has always managed to bounce back stronger than ever. His unwavering determination and unwavering work ethic are qualities that have propelled him to the top ranks of the boxing world.</p>\n\n<p>One of the most fascinating aspects of Garcia's career is his ability to adapt to various opponents and styles. In boxing, being able to adjust your strategy to exploit an opponent's weaknesses is crucial, and Garcia has mastered this art. His ability to analyze and decipher his opponents' tactics has often led to his success in the ring, as he is able to capitalize on any vulnerabilities and deliver devastating blows.</p>\n\n<p>Beyond his undeniable skill and talent, Garcia's love for the sport and his fans is evident. He understands the role he plays in the lives of boxing enthusiasts and recognizes the impact he can make both inside and outside the ring. Garcia has become a source of inspiration for many aspiring boxers and fans alike, proving that with hard work and determination, any dream can be achieved.</p>\n\n<p>Given his relatively compact stature, some may underestimate Garcia's ability to compete against larger opponents. However, his ability to generate power and his quickness make up for any perceived disadvantages. Garcia's punches are like lightning bolts, striking with precision and force, leaving his opponents stunned in their wake. His ability to slip and counterpunch with finesse is reminiscent of a snake coiling and striking. Garcia's agility and speed make him a force to be reckoned with, regardless of his opponent's size.</p>\n\n<p>In conclusion, Benjamin Garcia is a true embodiment of the sport of boxing. His skill, dedication, and versatility have allowed him to climb the ranks and establish himself as a top contender in multiple weight classes. Standing at 160cm with a reach of 165cm, Garcia has proven that size is not a limitation when it comes to achieving success in the ring. His ability to adapt to different opponents and styles sets him apart, as he consistently outmaneuvers and outperforms his adversaries.</p>\n\n<p>As Garcia continues his journey in the world of boxing, it is clear that he will leave a lasting impact on the sport. His determination, resilience, and love for the game are what make him a true champion. While he may not have a specific nickname to his name, his actions inside the ring speak much louder than any moniker ever could. Benjamin Garcia is a force to be reckoned with, and boxing enthusiasts around the world eagerly await his next move.</p>",
    "promoters": null,
    "trainers": null,
    "managers": null,
    "gym": null,
    "proDebutDate": "2001-06-09",
    "proDivision": "super fly",
    "proWins": 14,
    "proWinsByKnockout": 1,
    "proLosses": 17,
    "proLossesByKnockout": 4,
    "proDraws": 3,
    "proStatus": "inactive",
    "proTotalBouts": 34,
    "proTotalRounds": 188,
    "amateurDebutDate": "",
    "amateurDivision": "",
    "amateurWins": null,
    "amateurWinsByKnockout": null,
    "amateurLosses": null,
    "amateurLossesByKnockout": null,
    "amateurDraws": null,
    "amateurStatus": "inactive",
    "amateurTotalBouts": null,
    "amateurTotalRounds": 188,
    "createdAt": "2025-08-08T14:33:14.007651",
    "updatedAt": "2025-08-08T14:33:14.007653"
  }
]
